{"title":"Sam Phillips_ The Man Who Inven - Peter Guralnick.epub","uid":12922149,"size":8856582,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01b2c8916dd8e6e5e8a9dca8d633272b3f87e937&amp;dn=Sam+Phillips_+The+Man+Who+Inven+-+Peter+Guralnick.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mr_mando","files":1,"time":1449427512,"description":"Sam Phillips: The Man Who Invented Rock 'N' Roll - Peter Guralnick \r\n\r\nThe author of the critically acclaimed Elvis Presley biography Last Train to Memphis brings us the life of Sam Phillips, the visionary genius who singlehandedly steered the revolutionary path of Sun Records.\r\n\r\nThe music that he shaped in his tiny Memphis studio with artists as diverse as Elvis Presley, Ike Turner, Howlin' Wolf, Jerry Lee Lewis, and Johnny Cash, introduced a sound that had never been heard before. He brought forth a singular mix of black and white voices passionately proclaiming the vitality of the American vernacular tradition while at the same time declaring, once and for all, a new, integrated musical day. With extensive interviews and firsthand personal observations extending over a 25-year period with Phillips, along with wide-ranging interviews with nearly all the legendary Sun Records artists, Guralnick gives us an ardent, unrestrained portrait of an American original as compelling in his own right as Mark Twain, Walt Whitman, or Thomas Edison.\r\n\r\nPRAISE\r\n&quot;Beautiful and meticulous... Mr. Guralnick is the perfect man to tell this story.&quot; (Dwight Garner, New York Times).\r\n\r\n&quot;Peter Guralnick isn't just a music writer or a biographer--he's one of the essential chroniclers of American popular culture, and his work illuminates some of the crucial components of our national identity: race, religion, fame, and the big business of having fun, among others. In this epic biography of Sam Phillips, Guralnick bears witness to the birth of rock and roll and the cultural revolution it inspired. It's not only an unforgettable portrait of an eccentric visionary, it's a testament to the power of ordinary people to change the world with nothing more than a beautiful idea and a handful of songs.&quot; (Tom Perrotta, author of The Leftovers).\r\n\r\n&quot;When Elvis Presley stepped into a Memphis recording studio with producer Sam Phillips in 1954, they defined rock 'n' roll as we know it. Peter Guralnick already gave us Elvis's story in two landmark books. He now returns with a brilliant, intensely human look at Phillips, the endlessly fascinating figure who also recorded Johnny Cash, B.B King, Howlin' Wolf, and Jerry Lee Lewis. It's a bold, insightful work that tells us in novelistic detail about the obsessions and struggles of the man who presided over the uneasy birth of rock 'n' roll.&quot; (Robert Hilburn, author of Johnny Cash).\r\n\r\n&quot;Sam Phillips is an epic biography, at once sweeping and personal, in which the gifted writer Peter Guralnick captures the voice and life of a transformational figure in American music.&quot; (Jess Walter, author of Beautiful Ruins).\r\n\r\n&quot;Rigorously researched.... Definitive.&quot; (Will Hermes, Rolling Stone).\r\n\r\n&quot;A monumental biography of the larger-than-life loner who fought for the acceptance of black music and discovered an extraordinary group of poor, country-boy singers whose records would transform American popular culture.... A wonderful story that brings us deep into that moment when America made race music its own and gave rise to the rock sound now heard around the world.&quot; (Kirkus Reviews (starred review)).\r\n\r\n&quot;Guralnick wrote definitive biographies of Elvis and now does the same for Phillips, a visionary who gave voice to a rich and diverse culture long marginalized.... Essential reading for music fans.&quot; (Ben Segedin, Booklist (starred review))","torrent":{"xt":"urn:btih:01b2c8916dd8e6e5e8a9dca8d633272b3f87e937","amp;dn":"Sam+Phillips_+The+Man+Who+Inven+-+Peter+Guralnick.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01b2c8916dd8e6e5e8a9dca8d633272b3f87e937","infoHashBuffer":{"type":"Buffer","data":[1,178,200,145,109,216,230,229,232,169,220,168,214,51,39,43,63,135,233,55]},"announce":[],"urlList":[]}}