{"title":"Acid Rain and the Rise of the Environmental Chemist in Nineteent","uid":12649729,"size":2763208,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:038c16288781068ee7a1f821994f043cecc8e6be&amp;dn=Acid+Rain+and+the+Rise+of+the+Environmental+Chemist+in+Nineteent&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1446115199,"description":"Acid Rain and the Rise of the Environmental Chemist in Nineteenth-Century Britain - Peter Reed (Ashgate, 2014).pdf\r\n\r\nISBN 9781409457756\r\n\r\nRobert Angus Smith (1817-1884) was a Scottish chemist and a leading investigator into what came to be known as 'acid rain'. This study of his working life, contextualized through discussion of his childhood, education, beliefs, family, interests and influences sheds light on the evolving understanding of sanitary science during the nineteenth century. Born in Glasgow and initially trained for a career in the Church of Scotland, Smith instead went on to study chemistry in Germany under Justus von Liebig. On his return to Manchester in the 1840s, Smith's strong Calvinist faith lead him to develop a strong concern for the insanitary environmental conditions in Manchester and other industrial towns in Britain. His appointment as Inspector of the Alkali Administration in 1863 enabled him to marry his social concerns and his work as an analytical chemist, and this book explores his role as Inspector of the Administration from its inception through battles with chemical manufacturers in the courts, to the struggle to widen and tighten the regulatory framework as other harmful chemical nuisances became known. This study of Smith's life and work provides an important background to the way that 'chemical' came to have such negative connotations in the century before publication of Rachel Carson's Silent Spring. It also offers a fascinating insight into the changing landscape of British politics as regulation and enforcement of the chemical industries came to be seen as necessary, and is essential reading for historians of science, technology and industry in the nineteenth century, as well as environmental historians seeking background context to the twentieth-century environmental movements","torrent":{"xt":"urn:btih:038c16288781068ee7a1f821994f043cecc8e6be","amp;dn":"Acid+Rain+and+the+Rise+of+the+Environmental+Chemist+in+Nineteent","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"038c16288781068ee7a1f821994f043cecc8e6be","infoHashBuffer":{"type":"Buffer","data":[3,140,22,40,135,129,6,142,231,161,248,33,153,79,4,60,236,200,230,190]},"announce":[],"urlList":[]}}