{"title":"Waiting for the Electricity_ A Novel - Christina Nichol.epub","uid":12984903,"size":1118909,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:056541e51f8441727edb612fe611d0db0ee96711&amp;dn=Waiting+for+the+Electricity_+A+Novel+-+Christina+Nichol.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mr_mando","files":1,"time":1450066035,"description":"Waiting for the Electricity: A Novel - Christina Nichol\r\n\r\nIn the republic of Georgia, the Communists are long gone, replaced by . . . well, by what?  Something much more confusing, that’s for sure.\r\n\r\nThere are no jobs in the cities.  And when there are jobs, employees aren’t compensated.  And when they are compensated, it’s because the jobs are . . . not strictly scrupulous. In the village, life goes on much as it always did, but these days, the homemade farmers cheese is giving way to the oil pipeline.\r\n\r\nAnd as for romance in this strange, confounding modern age . . . the less said, the better.\r\n\r\nAnd why is Hilary Clinton so interested in our hero, Slims Makashvili?\r\nBut there’s one man in Georgia who remains unseduced by corruption, unfazed by nostalgia, and unable to abandon chivalry, no matter how antiquated a notion it may be.  This man is Slims Achmed Makashvili, a humble maritime lawyer and the hero of this brilliant novel.\r\n\r\nWhen Slims discovers an application for an American small business internship program sponsored by Hillary Clinton, he knows that he has found his calling.  In his letters to Senator Clinton, Slims dreams of bringing efficiency, opportunity, and the American dream to his homeland, even as his friends and relatives embrace decadence, lethargy, and a staggering array of unsavory business practices.\r\n\r\nAnd what would America have to teach you once you finally got here?\r\nBut when he finally gets to America—specifically to utopian San Francisco—Slims sees what reform and progress look like up close.  And  suddenly, his loud, bickering family and his anguished, joyful country no longer seem so grim.\r\n\r\nA gleeful picaresque, a hilarious satire, and a work of extraordinary empathy and imagination, Waiting for the Electricity is a marvelously imaginative debut novel in the tradition of Jonathan Safran Foer’s Everything Is Illuminated and Gary Shteyngart’s Absurdistan","torrent":{"xt":"urn:btih:056541e51f8441727edb612fe611d0db0ee96711","amp;dn":"Waiting+for+the+Electricity_+A+Novel+-+Christina+Nichol.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"056541e51f8441727edb612fe611d0db0ee96711","infoHashBuffer":{"type":"Buffer","data":[5,101,65,229,31,132,65,114,126,219,97,47,230,17,208,219,14,233,103,17]},"announce":[],"urlList":[]}}