{"title":"TeraCopy Pro 2.3 DC 21.10.2015 (Local install + Portable)","uid":12679469,"size":5814530,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:05f4a9938f92bfd126a6d880600a7cd5c5d10333&amp;dn=TeraCopy+Pro+2.3+DC+21.10.2015+%28Local+install+%2B+Portable%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jovo_bih","files":1,"time":1446542499,"description":"******************************\r\nTeraCopy Pro 2.3 DC 21.10.2015\r\n******************************\r\n\r\nPopular utility designed to copy files faster and more reliably, providing the user with many features. TeraCopy uses dynamically adjusted buffers to reduce seek times. It can resume broken file transfers and skip bad files during the copying process.\r\n\r\nOne of the most common complaints about newer versions of Windows is the slow copying speed, especially when transferring lots of files over the network. If you want to speed up your copying or if you regularly transfer large amounts of data and have to stop the process to perform some other disk-intensive task, this program may be just what you need.\r\n\r\nTeraCopy is designed to copy and move files at the maximum possible speed. It skips bad files during the copying process, and then displays them at the end of the transfer so that you can see which ones need attention. TeraCopy can automatically check the copied files for errors by calculating their CRC checksum values. It also provides a lot more information about the files being copied than its Windows counterpart. TeraCopy integrates with Windows Explorer's right-click menu and can be set as the default copy handler.\r\n\r\n\r\n- Copy files faster: TeraCopy uses dynamically adjusted buffers to reduce the seek times. Asynchronous copying speeds up the file transfer between two physical hard drives.\r\n- Pause and resume file transfer activities: Pause the copy process at any time in order to free up system resources and continue with a single click.\r\n- Error recoveryIn case of a copy error: TeraCopy will try several times to recover and, in the worse case scenario, will simply skip the file, not terminating the entire transfer.\r\n- Interactive file list: TeraCopy shows the failed file transfers and lets you fix the problem and recopy only the problem files.\r\n- Shell integration: TeraCopy can completely replace the Explorer copy and move functions, in turn enabling you to work with files as usual.\r\n- Full Unicode support.\r\n- Windows 8 x64 support.\r\n\r\nSystem requirements: 2K/XP/Vista/7/8/8.1/10/x64\r\n\r\nHomepage http://www.codesector.com/teracopy","torrent":{"xt":"urn:btih:05f4a9938f92bfd126a6d880600a7cd5c5d10333","amp;dn":"TeraCopy+Pro+2.3+DC+21.10.2015+%28Local+install+%2B+Portable%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05f4a9938f92bfd126a6d880600a7cd5c5d10333","infoHashBuffer":{"type":"Buffer","data":[5,244,169,147,143,146,191,209,38,166,216,128,96,10,124,213,197,209,3,51]},"announce":[],"urlList":[]}}