{"title":"Planet Diver v2.0.2 Apk + Data","uid":12919566,"size":131373610,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:07e6802b18897e1ea33f509ea9c17bbbabc55e6a&amp;dn=Planet+Diver+v2.0.2+Apk+%2B+Data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":3,"time":1449401232,"description":"Planet Diver v2.0.2 Apk + Data\r\n\r\nPlanet Diver is about an adventurous daredevil tackling her newest obsession: Wing suit diving. With her close robotic companion Buddy she'll travel across space to seek out the most dangerous planets and their respective chasms to dive in. You'll dive through a variety of deadly and exotic planets, fighting off the flora and fauna of each locale, while collecting valuable star stuff to further fund your adventures.\r\n\r\nUse your hard earned rewards to fly to more distant planets, as well as to acquire new outfits and special ability modifiers! Along the way you can compete online for the best dive or try to unlock rewards by completing tough challenges. Careful how deep you dive though... Who knows what slumbers within the planet's core?\r\n\r\n- PLANET DIVER FEATURES -\r\n- An extensive campaign made out of 3 planets, 9 biomes and 75 unique missions with a quirky story and challenges.\r\n- Carefully crafted, randomly generated chasms that make each dive unique!\r\n- An endless arcade mode for each planet that pushes the challenge to the limit.\r\n- All planets have their own special biomes, obstacles, enemies and bosses!\r\n- Fast paced gameplay where you need to avoid, brake and speed up like a pro!\r\n- Unique obstacles and enemies like bats that follow your every move, lava that slowly cuts off your escape or a... giant whale?!\r\n- A lot of terrifying boss fights that require fast reflexes and a sharp mind.\r\n- A vibrant setting with a fun, quirky story to explore in the depth of space!\r\n- A cool astro shop full of unlockables like diving suits, modifiers and music!\r\n- Competitive leaderboards for the score junkies out there!\r\n- Plenty of hidden easter eggs that can be found throughout the extensive planet surfaces you explore!\r\n\r\n- HOW DO I PLAY PLANET DIVER? -\r\nThe goal's simple, dive down while collecting all the star stuff along the way! Along the way you'll need to take the offensive or defensive to survive... This game might be easy to learn, but it is hard to master! The faster you go, the higher the star stuff multiplier. There are 75 missions to explore, and each level pushes you to new limits with specific goals you need to accomplish.\r\n\r\nIn your dives you collect star stuff, which is essential to your progress! You can spend it on outfits or modifiers that adjust your abilities! You can also spend them on star maps unlocking distant planets with new missions, obstacles, biomes and enemies!\r\n\r\nAre you ready to tackle the vastness of space and become the raddest, intergalactic chasm diver? Yeah, of course you are! Get diving!\r\n\r\n\r\nWhat's new:\r\n- Store visuals adjusted\r\n- Calypso Mission 25 finish line now fully visible\r\n- Finishing a mission while the screen flashes now successfully pauses the game\r\n\r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play.\r\nRequires Android: 2.2+","torrent":{"xt":"urn:btih:07e6802b18897e1ea33f509ea9c17bbbabc55e6a","amp;dn":"Planet+Diver+v2.0.2+Apk+%2B+Data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07e6802b18897e1ea33f509ea9c17bbbabc55e6a","infoHashBuffer":{"type":"Buffer","data":[7,230,128,43,24,137,126,30,163,63,80,158,169,193,123,187,171,197,94,106]},"announce":[],"urlList":[]}}