{"title":"B-M Mattsson - Vi tolererar inga förlorare - Svensk","uid":12946320,"size":699322133,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:084061c89a913e29217faac9ed8eddf033a9fb97&amp;dn=B-M+Mattsson+-+Vi+tolererar+inga+f%26ouml%3Brlorare+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"totomas1","files":208,"time":1449681561,"description":"Britt-Marie Mattsson – Vi tolererar inga förlorare\r\n\r\nKlanen Kennedy\r\n\r\n&quot;Vi tolererar inga förlorare.&quot; Det var på den grunden som Joseph P Kennedy byggde sin familjedynasti. Och han insåg att pengar var vägen till framgång, först på Wall Street och i filmindustrin med Gloria Swanson, sedan i politiken.\r\nCharmfull, skrupelfri och hänsynslös jagade han den makt och det inflytande som berövats honom av de förnämsta släkterna i hemstaden Boston. Revanschlusten blev drivkraften också för hustrun Rose och de nio barnen.\r\n\r\nNär Joseph P Kennedy inte lyckats med en politisk karriär ställdes kravet på den äldste sonen att bli USA:s president. Men när han omkommit i andra världskrigets slutskede överfördes ambitionen på den näst äldste sonen John F Kennedy.\r\nOch när han mördats som president gick uppgiften vidare till näste son Robert som sköts ihjäl just som han var på väg att nå Vita huset. För att lämnas vidare till den yngste sonen Ted som inte klarade av att bli president men som blev en av USA:s mest långvariga och betydande senatorer.\r\n\r\nKennedyklanens framväxt och dominans tillhör det mest fascinerande i historien med enastående framgångar och glamour blandat med bottenlös sorg och tragedi, och en exempellös förmåga att från början skapa den glorifierade bild av släkten som länge levde vidare.\r\n\r\nBritt-Marie Mattsson berättar i romanens form Kennedysagan från början av 1910-talets Boston till 2010-talets Washington. Det är en rikt detaljerad dramatisering med stark verklighetsförankring. Romanen bygger på historiska dokument, böcker och författarens egna erfarenheter från fyrtio års nyhetsbevakning av amerikansk politik och ett intresse för Kennedyklanen sedan presidentvalet år 1960.\r\n\r\n\r\nMp3-CD\r\nUppläsare: Peder Falk\r\nSpeltid: Ca 23 timmar","torrent":{"xt":"urn:btih:084061c89a913e29217faac9ed8eddf033a9fb97","amp;dn":"B-M+Mattsson+-+Vi+tolererar+inga+f%26ouml%3Brlorare+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"084061c89a913e29217faac9ed8eddf033a9fb97","infoHashBuffer":{"type":"Buffer","data":[8,64,97,200,154,145,62,41,33,127,170,201,237,142,221,240,51,169,251,151]},"announce":[],"urlList":[]}}