{"title":"The Matrix Trilogy (1999-2003) 720p 5.1 BRrip x264 NL Collected","uid":12921155,"size":8702789580,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:0b5662b46d7a411a56bbb6a0eb983c65008c5ca9&amp;dn=The+Matrix+Trilogy+%281999-2003%29+720p+5.1+BRrip+x264+NL+Collected+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gljeffrey45","files":3,"time":1449417166,"description":"The Matrix Trilogy (1999-2003) 720p 5.1 BRrip x264 NL Collected By Jeffrey \r\n\r\nThe Matrix 1 (1999) \r\n\r\nVerenigde Staten / Australië \r\nActie / Sciencefiction \r\n136 minuten \r\n\r\ngeregisseerd door Andy Wachowski en Lana Wachowski \r\nmet Keanu Reeves, Laurence Fishburne en Carrie-Anne Moss \r\n\r\nWaarneming: Onze alledaagse wereld is echt. Realiteit: Deze wereld is bedrog, een gedetailleerde leugen voortgebracht door oppermachtige machines met kunstmatige intelligentie die ons leven beheersen. Wow. Verbijsterende stunts. Verbluffende technobeelden. Mega-actie. Keanu Reeves en Laurence Fishburne leiden de strijd voor de bevrijding van het menselijk ras in The Matrix, de cyberthriller geschreven en geregisseerd door de gebroeders Wachowski (Bound), die je, één keer gezien, niet meer loslaat. Het verhaal is van het hoogste niveau, de speciale effecten zijn baanbrekend voor de filmindustrie - kortom, de film pakt je. \r\n\r\nNL Subs (ingebakken) \r\nAVI \r\n************************************************** \r\n\r\nThe Matrix 2 Reloaded (2003) \r\n\r\nVerenigde Staten / Australië \r\nActie / Sciencefiction \r\n138 minuten \r\n\r\ngeregisseerd door Andy Wachowski en Lana Wachowski \r\nmet Keanu Reeves, Laurence Fishburne en Carrie-Anne Moss \r\n\r\nDe machines hebben de locatie van Zion, de laatste menselijke stad, gevonden. De enige hoop voor de rebellen is The Keymaker, een man met toegang tot alle deuren naar de machinewereld. Hij wordt echter bewaakt door The Twins, een gedreadlocked duo dat kan verdwijnen en verschijnen als geesten. Agent Smith kan zich inmiddels als een virus in The Matrix vermenigvuldigen, wat de zoektocht voor Neo, Trinity en Morpheus bemoeilijkt. \r\nSentinels zwermen. Smith kloont. Neo vliegt... maar misschien is zelfs een Uitverkorene, met zijn verbazingwekkende nieuwe krachten, niet bij machte om de opmars van de Machines te stuiten. Neo. Morpheus. Trinity. Ze staan scherp voor het verpletterende tweede hoofdstuk van The Matrix trilogie, en ze krijgen de hulp van machtige nieuwe vrienden. De strijd tegen een vijand die zichzelf kan klonen en upgraden en die op het punt staat de laatste enclave van de mensheid te overrompelen, kan losbarsten. Ook regisseursduo de Wachowski Brothers en producer Joel Silver staan paraat om de mensheid andermaal te verbluffen met hun spectaculaire toekomstvisie en grensverleggende filmtaal. Wat is The Matrix? De vraag krijgt nog geen afdoend antwoord, en leidt naar een andere vraag: Wie schiep The Matrix? De antwoorden voeren ons naar nog andere werelden. De beelden en acties zijn verbijsterend. \r\n\r\nNL Subs (ingebakken) \r\nAVI \r\n*************************************************** \r\n\r\nThe Matrix 3 Revolutions (2003) \r\n\r\nAustralië / Verenigde Staten \r\nActie / Sciencefiction \r\n129 minuten \r\n\r\ngeregisseerd door Andy Wachowski en Lana Wachowski \r\nmet Keanu Reeves, Hugo Weaving en Carrie-Anne Moss \r\n\r\nTerwijl het een kwestie van uren is voor de machines Zion binnen zullen dringen moeten Trinity en Morpheus op zoek naar Neo, die gevangen zit in een wereld tussen de Matrix en de echte wereld. Wanneer het gevecht tussen de machines en de bewoners van Zion begint probeert Neo definitief af te rekenen met Agent Smith. \r\nNeo. Trinity. Morpheus. Zij en andere helden staan op de rand van de zege of de vernietiging in hun epische oorlog tegen de Machines, het verbluffende sluitstuk van de Matrix-trilogie. Neo's missie is te gaan waar geen mens hem ooit voorging, naar het hart van Machine City, waar hij een meedogenloze strijd moet aanbinden met het op hol geslagen en enorm in kracht toegenomen programma Smith. De missie van auteurs-regisseurs de Wachowski Brothers en producer Joel Silver luidt: het overtreffen van de nooitgeziene visuele inventiviteit van de eerste twee films. De revolutie is nu: The Matrix Revolutions \r\n\r\nNL Subs (ingebakken) \r\nAVI \r\n**************************************************************************************************************\r\n\r\n\r\n\r\nBeste gebruikers, \r\nde torrents worden geüpload met een server, en voor de omschrijving ben ik dus afhankelijk van wat ik zelf  binnen krijg aan info. \r\nIk kan dus niet alles wat ik upload nalopen op fouten in de omschrijving. \r\nWaardeer je mijn uploads,laat dan even een commentaartje achter. \r\nTorrents uploaden is puur hobby voor mij. \r\n\r\nVeel plezier met de door jouw gedownloade torrent. \r\n[/size]","torrent":{"xt":"urn:btih:0b5662b46d7a411a56bbb6a0eb983c65008c5ca9","amp;dn":"The+Matrix+Trilogy+%281999-2003%29+720p+5.1+BRrip+x264+NL+Collected+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b5662b46d7a411a56bbb6a0eb983c65008c5ca9","infoHashBuffer":{"type":"Buffer","data":[11,86,98,180,109,122,65,26,86,187,182,160,235,152,60,101,0,140,92,169]},"announce":[],"urlList":[]}}