{"title":"The.True.Story.s05e04.Scream.360p.LDTV.WEBRIP.[MPup]","uid":12983862,"size":227462876,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0b63c3b23453d47b5b056da5085ae123185ac314&amp;dn=The.True.Story.s05e04.Scream.360p.LDTV.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":1,"time":1450056475,"description":"The.True.Story.s05e04.Scream.360p.LDTV.WEBRIP.[MPup]\r\nLow-Definition Television (LDTV) ABC iview WEBRIP: 640x360\r\n[b]AKA The Real Story 2008[/b]\r\n\r\n[i]The True Story AU s05e04 Scream 360p LDTV WEBRIP [MPup] AKA The Real Story US [2008][/i]\r\n\r\n[i][b]The ABC AU Website mislabeled this episode as s05e03. It is actually s05e04, therefore I used the correct episode numbering[/b][/i]\r\n\r\nFormat: MPEG-4\r\nSize: 640x360\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 44.1 KHz\r\n\r\nThe True Story is a documentary series revealing the real-life events that inspired some of Hollywood’s most famous blockbusters this episode looks at the real story behind modern horror classic Scream.\r\n\r\n[img]http://extraimago.com/images/2015/12/14/5f312b678d6468f7ccd8e657b6bb6b9c.jpg[/img]\r\n\r\nSlasher film Scream, released in 1996 went on to spawn one of the most successful horror franchises in film history taking in in excess of 400 million dollars in the United States alone. The sadistic killer and his iconic mask have entertained and terrified audiences around the world.\r\n\r\nWith Nightmare on Elm Street director Wes craven at the helm, the first Scream film is credited with revitalizing the horror genre. Scream blended slasher violence with murder mystery and it played on the stereotypes and conventions of classic horror films breathing new life into the genre.\r\n\r\nAlthough the plot of the masked, small town serial killer targeting high-school students and picking them off one-by one may seem like pure Hollywood fiction it was partly inspired by true events and a real masked murderer who terrified students in a small town.\r\n\r\nIn 1990, serial killer 36- year old Danny Harold Rolling, stalked, tortured and murdered five young students in Gainsville, Florida. The murders triggered a student exodus, mass panic and the largest manhunt in Florida’s history. The killer was even dubbed the Gainesillve Ripper.\r\n\r\nThe True Story explores the real life case of the masked killer charting the trials and tribulations of the full year long investigation. Including missed evidence, the wrongful arrest of an innocent scarred schizophrenic man and also how the forensic team finally pieced together the killer’s methodology using a key piece of evidence.\r\n\r\nThrough first hand witnesses, homicide investigators and forensic scientists we tell the story behind the story and prove that sometimes reality can be just as terrifying as the movies","torrent":{"xt":"urn:btih:0b63c3b23453d47b5b056da5085ae123185ac314","amp;dn":"The.True.Story.s05e04.Scream.360p.LDTV.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b63c3b23453d47b5b056da5085ae123185ac314","infoHashBuffer":{"type":"Buffer","data":[11,99,195,178,52,83,212,123,91,5,109,165,8,90,225,35,24,90,195,20]},"announce":[],"urlList":[]}}