{"title":"Victoria.2015.BRRip.1280X720.aac.mkv-makalakato","uid":12965780,"size":3686395716,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:0bb659ae4e50eaa76da952806d8abb8bc4d48291&amp;dn=Victoria.2015.BRRip.1280X720.aac.mkv-makalakato&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makalakat","files":11,"time":1449888638,"description":"Spoke in English with some few dialogues in German. Subtitles: arabic, bulgarian, czech, english, indonesian, portuguese, serbian, slovenian and spanish. Sorry my very low upload speed and please help me seeding. \r\n\r\n\r\nVictoria, a German thriller shot in a single, unedited take, has won big at the Lolas, Germany's equivalent of the Oscars, winning six trophies, including best film, best director for Sebastian Schipper, and best acting honors for stars Laia Costa and Frederick Lau.\r\n\r\nUnlike Alejandro Gonzalez Inarritu's Oscar-winning drama, which uses camera tricks and special effects to create the appearance of a single-take, Victoria is the real deal. Schipper and his team shot the entire two hour and twenty minute film without a single cut.\r\n\r\nThe movie follows the eponymous Victoria, a Spanish party girl (Costa) looking for thrills who hits the town with four Berlin locals. But their night of partying takes a wrong turn and they end up taking part in a bank robbery.\r\n\r\nVictoria premiered at the Berlin Film Festival, where it won a Silver Bear for outstanding artistic achievement for cinematographer Sturla Brandth Grovlen. Grovlen picked up a best cinematography Lola for his groundbreaking work, with Victoria also taking the trophy for best film music. Adopt Film has acquired Victoria for the U.S..\r\n\r\nHollywood Reporter\r\n\r\nTrailer/Preview","torrent":{"xt":"urn:btih:0bb659ae4e50eaa76da952806d8abb8bc4d48291","amp;dn":"Victoria.2015.BRRip.1280X720.aac.mkv-makalakato","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bb659ae4e50eaa76da952806d8abb8bc4d48291","infoHashBuffer":{"type":"Buffer","data":[11,182,89,174,78,80,234,167,109,169,82,128,109,138,187,139,196,212,130,145]},"announce":[],"urlList":[]}}