{"title":"Akatsuki.Blitzkampf-LiPEH","uid":12797573,"size":343907832,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0c13f723370c983c4cf204e830eb996375b2a75a&amp;dn=Akatsuki.Blitzkampf-LiPEH&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LiPEH","files":44,"time":1448000646,"description":"LiPEH\r\n\r\n  .:::::::::::::::::::::::::PRESENT'S GAMES ANTIGOS::::::::::::::::::::::::::::::. \r\n\r\n[WWW . GAMESANTIGOS .. COM]\r\n\r\nAkatsuki.Blitzkampf-LiPEH\r\n\r\nAkatsuki Blitzkampf  (PC) [2007]\r\n\r\nFight / Luta\r\n\r\nAkatsuki Blitzkampf é um jogo de luta 2D doujins japonês, desenvolvido pela SUBTLE STYLE  para Microsoft Windows. Lançado em 30 de abril de 2007, o jogo é uma sequela para Akatsuki Shisei Ichigo. O título tem muita atenção no Japão e em outros lugares por suas sprites de alta resolução e jogabilidade estilo mais antigo.\r\n\r\nAkatsuki Blitzkampf (ou Denko Senki em japonês) é ambientado em um futuro fictício envolvendo vários personagens que se assemelham mais ou menos soldados alemães da época da Segunda Guerra Mundial, entre outros. No jogo visual complementar este tipo de tema específico militarista e meio ambiente, retratado pelo plano e um pouco cubista retratos dos personagens e imagens da sequência história.\r\n\r\nEm termos de estilo de jogo de Blitzkampf, é considerado como relativamente &quot;old school&quot; em comparação com muitos outros lançamentos de combate doujins como Melty Blood, Eternal Fighter Zero, ou Big Bang Beat, como muitos dos sistemas e convenções no jogo são bastante semelhante a vários jogos de luta do final dos anos 90 criados pela Capcom. Por exemplo, muitos jogadores fazem alusão ao sistema de defesa, que se assemelha a uma das parcelas Street Fighter III. A quantidade gratuita de modos extras de jogo proporciona (como Survival, Time Attack, ou Sugoroku) e as formas que eles estão desbloqueados é em grande parte uma reminiscência de um lançamento do console de um jogo de luta arcade, reforçando ainda mais a sensação semi-retro. Em outras palavras, o foco do jogo está sobre o controle do espaço e jogo de pernas cuidadosos em vez de combos chamativos e intenso combate aéreo.\r\n\r\n::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\r\n\r\nAkatsuki Blitzkampf is a 2D fighting game doujinshi Japanese, developed by SUBTLE STYLE for Microsoft Windows. Released on 30 April 2007, the game is a sequel to Akatsuki Shisei Ichigo. The title has a lot of attention in Japan and elsewhere for its high resolution sprites and gameplay older style.\r\n\r\nAkatsuki Blitzkampf (or Denko Senki Japanese) is set in a fictional future involving various characters that resemble more or less the German soldiers during the Second World War, among others. In addition visual play this kind of specific topic and militaristic environment, portrayed by the plan and a little cubist portraits of characters and images of the story sequence.\r\n\r\nIn terms of Blitzkampf game style, is regarded as relatively &quot;old school&quot; compared to many other doujins fighting releases like Melty Blood, Eternal Fighter Zero, or Big Bang Beat, as many of the systems and conventions in the game are quite similar the various end of fighting games 90s created by Capcom. For example, many players allude to the defense system, which resembles the one of Street Fighter III installments. The free amount of playing extra modes provides (such as Survival, Time Attack, or Sugoroku) and the ways they are unlocked is largely reminiscent of a release of an arcade fighting game console, further reinforcing the feeling semi -retro. In other words, the game's focus is on the control of space and play careful legs rather than flashy combos and intense aerial combat.\r\n\r\n::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\r\n\r\nRequisitos Mínimos\r\n\r\nProcessador: Pentium III ou Athlon\r\nVelocidade do processador: 1 GHz\r\nMemória RAM: 128 MB\r\nMemória de vídeo: 64 MB\r\nVersão do DirectX: 9.0c \r\nSistemas Operacionais: Windows 2000/XP/Vista/7\r\nEspaço: 350 MB livres em HD\r\n\r\n::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\r\n\r\n01. Baixar\r\n02. Clicar em &quot;config.exe&quot; para configurar o jogo\r\n03. Executar o arquivo &quot;akatsukibk.exe&quot;\r\n04. Jogar ;)\r\n\r\nCover:\r\n \nhttp://i.imgur.com/fV97XYB.png\r\n\r\nScreenshots:\r\n \nhttp://i.imgur.com/jUo0zA7.jpg \nhttp://i.imgur.com/Kv9ntEp.jpg \nhttp://i.imgur.com/gsnMBOD.jpg \nhttp://i.imgur.com/MSEdytY.jpg","torrent":{"xt":"urn:btih:0c13f723370c983c4cf204e830eb996375b2a75a","amp;dn":"Akatsuki.Blitzkampf-LiPEH","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c13f723370c983c4cf204e830eb996375b2a75a","infoHashBuffer":{"type":"Buffer","data":[12,19,247,35,55,12,152,60,76,242,4,232,48,235,153,99,117,178,167,90]},"announce":[],"urlList":[]}}