{"title":"Philippine Madrigal Singers - Halo-Halo[2015] - lossless","uid":12979719,"size":270782126,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0c72db5f694b65bcdad1c44bbec14ce553039f12&amp;dn=Philippine+Madrigal+Singers+-+Halo-Halo%5B2015%5D+-+lossless&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kuruhaka","files":18,"time":1450019542,"description":"Halo-halo - Mga Awiting Bayan, is a collection of Philippine Folk Songs from 14 of the country's over 50 ethnic groups and tribes\r\nAbout the artists: University of the Philippines Madrigal Singers, also known as the Philippine Madrigal Singers or simply Madz, named by UNESCO as Artist of Peace in 2009, are arguably the most internationally award-winning choral group in the World. The Madrigal Singers first earned critical acclaim during their performance in the First Choruses of the World Festival at the Lincoln Center in New York in 1969. This concert welcomed them to the international choral community, eventually paving their way to joining the most distinguished international choral competitions - Spittal, Austria; Arezzo and Gorizia, Italy; Neuchâtel, Switzerland; Debrecen, Hungary; Varna, Bulgaria; Tolosa, Spain; and Marktoberdorf in Germany, and winning all the top prizes. In June 1997, the Philippine Madrigal Singers came home from their ninth world concert tour, winning the grand prize in the Grand Prix European de Chant Choral Competition in Tours, France, besting five other grand prize winners of the most prestigious choral competition in Europe: Guido d'Arezzo, Italy; Debrecen, Hungary; Varna, Bulgaria; Gorizia, Italy; and Tolosa, Spain. The Madz displayed a virtuoso performance so moving one juror had to describe the group's music as the &quot;most beautiful sound on earth&quot;. In July 2006, the Madz won the grand prize (Grand Prix de la Ville de Tours) at the Florilege de Tours choral competition in France, making them eligible for the 2007 European Choral Grand Prix (to be held in Arezzo, Italy). In the same competition, the Madz were also awarded the first prize for Category III (mixed vocal ensemble), first prize for Category IV (free program) and the Prix University François Rabelais for best interpretation of a Renaissance number. On August 26, 2007, the Philippine Madrigal Singers won, for the second time, the grand prize in the European Grand Prix for Choral Singing in Arezzo, Italy. This victory makes them the first of the only two choirs in the world to win the grand prize twice. The European Grand Prix is widely understood to be the Olympics of the choral circuit","torrent":{"xt":"urn:btih:0c72db5f694b65bcdad1c44bbec14ce553039f12","amp;dn":"Philippine+Madrigal+Singers+-+Halo-Halo%5B2015%5D+-+lossless","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c72db5f694b65bcdad1c44bbec14ce553039f12","infoHashBuffer":{"type":"Buffer","data":[12,114,219,95,105,75,101,188,218,209,196,75,190,193,76,229,83,3,159,18]},"announce":[],"urlList":[]}}