{"title":"Rent.A.Cop.s01e04.EN.SUB.MPEG4.x264.WEBRIP.[MPup]","uid":12811075,"size":513793763,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0d0d0840a0c5fa976b95a12dfd43a3be78c9dc99&amp;dn=Rent.A.Cop.s01e04.EN.SUB.MPEG4.x264.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1448181401,"description":"Rent.A.Cop.s01e04.EN.SUB.MPEG4.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]4 of 8[/b]\r\n\r\nSeries following a Darlington-based private security firm. Francis goes undercover to try and solve a mysterious outbreak of vandalism at a local fishing pond.\r\n\r\n[img]http://extraimago.com/images/2015/11/21/d53f4ebc3f752a332a7a7967f251eee1.jpg[/img]\r\n\r\nObservational documentary series following Sparta Security, a Darlington-based private security firm. Sparta is run by well-known local character Francis Jones, who has given behind-the-scenes access to himself, his staff and their operations.\r\n\r\nFrancis is a born-again Christian and former professional boxer. He is a man with a big personality and he's on a mission to clean up the streets of Darlington. No job is too small for Sparta Security, and Francis often goes the extra mile to help his clients with often outrageous but also hilarious consequences.\r\n\r\nFrancis relies on his office team Rachel and Claire who use their unusual sales techniques to help him find and secure new business. The work they bring in varies from mediating in neighbourhood disputes to guarding against grand larceny at big businesses in the area. Francis employs a number of security staff to work with him including balaclava-clad ex-forces officers, part-time bouncers and a personal trainer, and together they use a range of unorthodox methods to make Darlington a better place to live.\r\n\r\nFrancis goes undercover to try and solve a mysterious outbreak of vandalism at a local fishing pond. The pond, which has been a target for fly-tippers, has had its gate padlock repeatedly sabotaged with superglue. Francis dons his trademark tree suit to try and unmask the culprit. The Sparta office team Rachel and Claire have been sent by Francis to hunt for new business at a local networking event. They have high hopes of success until a dress code violation throws a spanner in the works. A local family asks Francis for help in making their home more secure in the aftermath of a burglary","torrent":{"xt":"urn:btih:0d0d0840a0c5fa976b95a12dfd43a3be78c9dc99","amp;dn":"Rent.A.Cop.s01e04.EN.SUB.MPEG4.x264.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d0d0840a0c5fa976b95a12dfd43a3be78c9dc99","infoHashBuffer":{"type":"Buffer","data":[13,13,8,64,160,197,250,151,107,149,161,45,253,67,163,190,120,201,220,153]},"announce":[],"urlList":[]}}