{"title":"La Pointe-Courte","uid":12667689,"size":6694328320,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0e1b11d7e0ccfe265fcc651cfbed1caec15ef3de&amp;dn=La+Pointe-Courte&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"asc11","files":25,"time":1446390137,"description":"An IMDb review:\r\n\r\n********** [10 of 10] Agnès Varda's first film may be her greatest\r\n13 September 2002 | by zetes (Saint Paul, MN)\r\n\r\nThis film, Varda's directorial debut, is as impressive and accomplished as any of the other New Wavers' debuts. It's definitely on the same level as Jean-Luc Godard's Breathless, Francois Truffaut's The 400 Blows, or Alain Resnais's Hiroshima, Mon Amour (Resnais actually worked as the editor for this film). I actually think I prefer it to all three of those (as well as the other three films of Varda's that I've seen). Historically, it's one of the most fascinating films I've ever witnessed. It, in one of its two sections, sprouts from a mixture of both French Poetic Realism of the 1930s and Italian Neorealism in the 1940s. It contains the social drama of such Neorealism classics as Visconti's La Terra Trema, as this plotline deals with a group of poor fishermen and their families. However, Varda doesn't play this hand melodramatically at all. Even when a character dies, we only witness his mourning in a precisely documentarian way. We aren't asked to feel any real emotion for him, which, for some reason, makes it all the more profound. In this way, the film resembles the French poetic realism classics. L'Atalante is clearly echoed, as stray cats occupy many empty spaces in the composition; they appear in nearly every scene in some capacity. Also, the village festival that takes up most of its tail end resembles very much the folksy rural wedding at the beginning of L'Atalante. The film also contains the good humor of Vigo's masterpiece. The second half of the film alternates with the first, switching over exactly every ten minutes, a technique which Varda kind of pilfered from William Faulkner's Wild Palms (aka If I Forget Thee, Jerusalem), a novel which Godard brings up in two of his films, Breathless and Two or Three Things I Know About Her. This second half points toward the future. The French New Wave, just getting underway in 1956 (although the program notes that I received insisted that it was made in 1954), comes to full bloom here. This half, which deals with a husband and wife who have started to grow tired of each other, consists of beautifully choreographed and composed shots of the two lovers strolling along the beaches of the fishing town. The style here is instantly recognizable as one which Resnais would adopt in Hiroshima Mon Amour and Last Year at Marienbad, and even has that semi-resigned feeling to it, as if, in a way, it's half-joking. What's really shocking is that this section does not just predict some of the techniques of the French New Wave, but also the style of Ingmar Bergman's films. I would doubt that Bergman was influenced at all by this film, as it's doubtful he ever saw it. Besides, he was well on his way to hitting his peaks by 1954, as we can see from such early masterpieces as Sawdust and Tinsel. But there are some shots in this film that, once again, will instantly call to mind nearly identical ones from films such as The Seventh Seal and, even more so, Persona.\r\n\r\nWhile it's a lot of fun to identify these old and new (and future) trends in La Pointe Courte, the film more than stands up on its own. Besides, according to the program notes, Agnès Varda was no great cinephile, unlike the other French New Wavers. The two storylines, and their differing styles, complement each other perfectly. It helps that Varda's direction is impeccable. Before she came to the cinema, she was a photojournalist, and it's extremely obvious. Her composition is absolutely stunning, with a lot of concentration on surface textures. The film opens with a tight close-up of a handcrafted wooden chair. You can't tell what it is initially, but as the camera follows the grooves and backs up, the object is revealed for what it is. When one character goes to the train station to pick up his wife, the shot is absolutely award-worthy with its multiple diagonals in the train tracks and the power lines in the distance. The use of sound in the film is also amazing. It's interesting when sound effects are included and when they're occluded. When the married couple walks through a field, there are carts squeaking down rusty tracks (it's a very odd event, but quite remarkable to see and hear). But later, when a large train passes by them only a dozen feet away, we don't hear it at all. Godard would play with sound more thoroughly, but never as subtly.\r\n\r\nIt's a rather great tragedy that La Pointe Courte has gone almost entirely unavailable. It barely got a release when it was first made, and, even after Varda gained prominence in the French cinema, it seems to have effectively dropped off the face of the planet. I hope that someday there will be a full retrospective of her work on DVD. This film deserves to impress others as much as it impressed me. 10/10.\r\n\r\n46 of 57 people found this review helpful","torrent":{"xt":"urn:btih:0e1b11d7e0ccfe265fcc651cfbed1caec15ef3de","amp;dn":"La+Pointe-Courte","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e1b11d7e0ccfe265fcc651cfbed1caec15ef3de","infoHashBuffer":{"type":"Buffer","data":[14,27,17,215,224,204,254,38,95,204,101,28,251,237,28,174,193,94,243,222]},"announce":[],"urlList":[]}}