{"title":"ExploitedCollegeGirls - Allison (Natural Double D)","uid":12807672,"size":372486051,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0e79aa64f528437930d1cc9b3183bb402bf14ca1&amp;dn=ExploitedCollegeGirls+-+Allison+%28Natural+Double+D%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"feeldabyte","files":1,"time":1448141908,"description":"Screens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/rXDvi \nhttp://imgkiss.com/image/rXKGv\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nWe've managed to locate yet another set of big, perfect tits. Lucky for you (and us) they are attached to an adorable 21 year old beauty named Allison. In addition to all natural double D's she's got a mane of sexy brown hair, a cute little bush and a nearly perfect body that she lets Jay take complete control of. Also, this should be the update that changes your life because you may have just found out a terrific little secret. Lurking inside that innocent, curvy hottie at the burger joint is a wild porn starlet just looking for an excuse to come out. So next time you order a number 3, try to lay on some charm and see if you can get a number 69 for take out after closing time.\r\n\r\nIt takes Allison a little while to warm up to Jay's interview style but eventually she confesses that she flips burgers for a living and happens to love girl on girl porn. Well, shoot, that and her double D's actually check all the boxes. What else could you want from a girl? Well she sort of also hints that she doesn't like sucking cock very much. Did you see the part about all natural double D's? Unless you're the type of guy who tries to move a futon with a Ferrari, this little quirk is best ignored. If you need something to distract you, are you familiar with Allison's double D cup tits?\r\n\r\nAfter a quick trip to the bathroom to inspect her big, natural titties; Jay gets Allison to the bed for a bit more chit chat. Allison admits that despite her love of lesbo porn she's never been with a girl and Jay, being the GENIUS that he is, suggests she make a return trip to Ex Co Gi to live out that fantasy. Eventually she just wants to get started and he begins with his fingers on her clit, and then ramps up to a vibrator. The vibrations really get her going and she gets very turned on, very quickly. So much so that when Jay takes a break and has her drop to her knees to show off her blowjob skills, she hardly seems to mind and turns the task into some creatively angled titty fucking.\r\n\r\nUnable to resist any more, Jay throws Allison onto the bed and gives her the pounding she's been craving. She's quiet, but clearly enjoying herself. She orgasms several times, but it's quiet and you'll need to pay close attention to find each one. After getting some more angles of Allison's amazing tits bouncing, and testing the waters by fingering her ass, Jay has her drop back to her knees so he can glaze her face and tits with a nice, splashy facial.\r\n\r\n\r\nSail to another one :  https://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:0e79aa64f528437930d1cc9b3183bb402bf14ca1","amp;dn":"ExploitedCollegeGirls+-+Allison+%28Natural+Double+D%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e79aa64f528437930d1cc9b3183bb402bf14ca1","infoHashBuffer":{"type":"Buffer","data":[14,121,170,100,245,40,67,121,48,209,204,155,49,131,187,64,43,241,76,161]},"announce":[],"urlList":[]}}