{"title":"JoyMii - My Dark Side","uid":12772840,"size":468886390,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0f7de899b899135efadb6424213675f5d64ac3c0&amp;dn=JoyMii+-+My+Dark+Side&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hunter534","files":1,"time":1447701563,"description":"Rilynn says about herself, that she was the whore at the parties when she was younger. She just loves guys and girls and the guys she met never had to beg for a blowjob. Rilynn is so liberal about her sexuality and she knows that there is nothing bad abou it! She loves SEX! And she loves to try new things. One of her desires is to get fucked by a huge hung black guy. We assisted her and found a very good looking black guy with this ridiculous huge cock. Rilynn feels like sharing this amazing experience and we couldn't be happier about that - mostly because what she feels like sharing are her early sexual experiences and feelings about sex and her sexuality. She also shared how excited she was to meet, and get fucked by, Isiah.... and that's exactly what she gets. Things start off slow and sensual. Isiah is in no rush and neither is Rilynn. She wants to experience every minute of this and Isiah is happy to give her the time of her life. She completely lets go and lets him lead the way... receiving pleasure all the while... until it's her turn to give him some pleasure just before he sticks his long hard dick inside of her... and it's even better than she thought it would be. Come on in and see for yourself just how good it is for her as she explores her 'dark side'... enjoy! :)\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://myimg.info/img-564a1e07ca93b.html \r\n \nhttp://photo-up.info/img-564a1e0e0c917.html","torrent":{"xt":"urn:btih:0f7de899b899135efadb6424213675f5d64ac3c0","amp;dn":"JoyMii+-+My+Dark+Side","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f7de899b899135efadb6424213675f5d64ac3c0","infoHashBuffer":{"type":"Buffer","data":[15,125,232,153,184,153,19,94,250,219,100,36,33,54,117,245,214,74,195,192]},"announce":[],"urlList":[]}}