{"title":"Ugly Duckling (2015).epub Gooner","uid":12881063,"size":8872744,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0fd09f7b3206f25980f657576120d4ab844d682d&amp;dn=Ugly+Duckling+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1449008785,"description":"Ugly Duckling - A True Life Story of Beauty, Manipulation and Murder (2015).epub Gooner\r\n\r\nPublisher: CreateSpace Independent Publishing Platform; 1 edition (January 13, 2015)\r\nLanguage: English\r\nISBN-10: 1500625205\r\nISBN-13: 978-1500625207\r\n\r\nThis is a true-life story of beauty, manipulation and murder. Gary Triano, of Tucson, was violently killed on his birthday, Nov 1, 1996, when a pipe bomb exploded inside his rented Lincoln town car. His body was blown to pieces by this remotely detonated bomb. Former Aspenite, Pamela Phillips Triano, is accused of paying Ronald Young, one of her lovers, to execute her ex-husband. Ronald Young was captured, tried and found guilty of first-degree murder in 2009. Featured on America’s Most Wanted and Dateline NBC, Pamela continued to evade imprisonment. This tale of international intrigue took a twist when Pamela was apprehended in Vienna by Interpol on an unrelated criminal offense in Lichtenstein. During her booking, Interpol discovered that her name was red flagged by the FBI. She was ultimately extradited to the Pima County Jail in Tucson, Arizona on July 3, 2010. With this written account, Royal Phillips, aunt of Pamela Phillips Triano is telling all. Royal was a former columnist for the Montecito Journal and has been writing since 1948. Documented through diaries, correspondence, and family photographs, Royal reveals a truthful portion of their wealthy, eccentric family who stimulated Pam’s hungers","torrent":{"xt":"urn:btih:0fd09f7b3206f25980f657576120d4ab844d682d","amp;dn":"Ugly+Duckling+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fd09f7b3206f25980f657576120d4ab844d682d","infoHashBuffer":{"type":"Buffer","data":[15,208,159,123,50,6,242,89,128,246,87,87,97,32,212,171,132,77,104,45]},"announce":[],"urlList":[]}}