{"title":"The Bible Series 2 - Christology - The Study of The Christ Jesus","uid":12796722,"size":9538188282,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:109b4c88c14866ba12e7bf738f8161c46c9a0bf7&amp;dn=The+Bible+Series+2+-+Christology+-+The+Study+of+The+Christ+Jesus&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"POtHS11","files":80,"time":1447982472,"description":"Christology\r\nThe Study of The Christ Jesus\r\n\r\n\r\nPOtHS Comment: There are over 30 Videos from Whistle Blowers from Area 51..........DEMONS ARE NOT FALLEN ANGELS!!! Demons are the disembodied Spirits of The Nephilim. They want to enter your Body, but they must have your permission.\r\n\r\nINTRODUCTION\r\n\r\nChristology (from Christ and Greek -λογία, -logia) is the field of study within Christian theology which is primarily concerned with the nature and person of Jesus Christ.[2] Primary considerations include the relationship of Jesus' nature and person with the nature and person of God. As such, Christology is concerned with the details of Jesus' life (what he did) and his teachings (what he said) in order to arrive at a clearer understanding of who he is in his person, and his role in salvation.[3]\r\n\r\nA major component of the Christology of the Apostolic Age was that of Saint Paul whose central themes were the notion of pre-existence of Christ and the worship of Christ as Kyrios (the Lord).[4] Following the Apostolic Age, a number of issues in Christology were debated, and due to seemingly minor, but politically charged differences in the 5th century schisms among denominations developed.\r\n\r\nIn the 13th century Saint Thomas Aquinas provided the first systematic Christology that consistently resolved a number of the existing issues. In his Christology from above, Aquinas also championed the principle of perfection of Christ's human attributes.[5][6][7] The Middle Ages also witnessed the emergence of the &quot;tender image of Jesus&quot; as a friend and a living source of love and comfort, rather than just the Kyrios image.[8]\r\n\r\nAccording to theologian Karl Rahner, the purpose of modern Christology is to formulate the Christian belief that &quot;God became man and that God-made-man is the individual Jesus Christ&quot; in a manner that this statement can be understood consistently, without the confusions of past debates and mythologies.\r\n\r\nCHRISTOLOGY - A Study of Jesus\r\nChristology 1 - Explained\r\nChristology 2 - The Diety of Christ\r\nChristology 3 - The Union of Deity and Humanity of Christ\r\nChristology 4 - Critical Doctrine\r\nChristology 5 - Resurrection and Ascension of Christ\r\nChristology 6 - The Present Ministry of Christ\r\nChristology 7 - The Second Coming of Christ\r\nChristology 8 - The Second Coming 2\r\nChristology 9 - The Rapture\r\nChristology in Laymens Terms\r\nThe Christology Symposium Muslim Views on Jesus\r\nXTRAS\r\n\r\n\r\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\r\n\r\nJESUS: Believe this about Jesus to move on to Greener Pastures.\r\n\r\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\r\n\r\nRAPtURE (My transportation outta here).\r\n\r\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\r\n\r\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\r\n\r\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\r\n\r\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\r\n\r\n\r\n\r\n      :thankyou:    :thankyou:     Thank You JESUS","torrent":{"xt":"urn:btih:109b4c88c14866ba12e7bf738f8161c46c9a0bf7","amp;dn":"The+Bible+Series+2+-+Christology+-+The+Study+of+The+Christ+Jesus","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"109b4c88c14866ba12e7bf738f8161c46c9a0bf7","infoHashBuffer":{"type":"Buffer","data":[16,155,76,136,193,72,102,186,18,231,191,115,143,129,97,196,108,154,11,247]},"announce":[],"urlList":[]}}