{"title":"The Wolf of Wall Street","uid":12780500,"size":7928152064,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:12471bd6d9d6ed3ab3a923a7d7a0d71fa094344c&amp;dn=The+Wolf+of+Wall+Street&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"browsen","files":1,"time":1447788506,"description":"The Wolf of Wall Street is een Amerikaanse misdaadkomedie uit 2013 van regisseur Martin Scorsese.\r\nDe biografische film is gebaseerd op de gelijknamige memoires van beursmakelaar Jordan Belfort.\r\nIn januari 2014 won hoofdrolspeler Leonardo DiCaprio een Golden Globe voor zijn vertolking.\r\n\r\nJordan Belfort wil het op Wall Street maken als beursmakelaar. Nadat het bedrijf waarvoor hij werkt failliet gaat, \r\nwerkt hij enige tijd bij een schimmige firma op Long Island die zich in penny stocks specialiseert. \r\nDeze makelaars benaderen onwetende mensen met agressieve verkooppraatjes en \r\nproberen hen tegen hoge commissies over te halen tot het plaatsen van orders voor waardeloze aandelen.\r\n\r\nHierna richt Belfort zijn eigen beleggingsfirma Stratton Oakmont op, samen met zijn vriend en collega Donnie Azoff. \r\nAl snel groeit de onderneming en hiermee het inkomen van de medewerkers. \r\nForbes interviewt Belfort en publiceert een negatief artikel waarin hij zijn bijnaam 'de Wolf van Wall Street' krijgt. \r\nDeze publiciteit doet de firma overigens alleen maar goed. \r\n\r\nZe overschrijden ook de grenzen van de wet door variaties op de pump and dump truc toe te passen: \r\nde koersen worden kunstmatig aangejaagd waarna de overgewaardeerde aandelen worden 'gedumpt'. \r\nStratton Oakmont strijkt nu niet alleen commissies maar ook koerswinsten op.\r\n\r\nJordan verdient fortuinen en past zijn levensstijl navenant aan. Hij koopt een helikopter en een jacht,\r\nbreekt met zijn echtgenote Teresa en begint een relatie met de beeldschone Naomi Lapaglia. \r\nStratton Oakmont groeit zienderogen en de jonge werknemers aanbidden hun rijke baas, \r\ndie zijn personeel voortdurend trakteert op decadente feestjes. \r\nWanneer de gulzige Jordan en Donnie verslaafd raken aan geld, drugs en seks, raken ze niet alleen alle realiteitszin kwijt, \r\nmaar trekken ze met hun buitensporige levensstijl ook de aandacht van FBI-agent Patrick Denham.\r\n\r\nBelforts vader probeert hem ervan overtuigen zich terug te trekken voor justitie of benadeelden hem alles afnemen, \r\nmaar Belfort is verblind door zijn eigen succes. Hij bedenkt zich tijdens zijn afscheidsspeech en blijft bij de onderneming, \r\nal is het dan minder op de voorgrond. Naomi's Engelse tante Emma wordt als een katvanger gebruikt om \r\nde illegale winsten in Zwitserland te parkeren, maar wanneer Emma overlijdt is het geld onbereikbaar geworden. \r\nDe Zwitserse bankier Saurel wordt bovendien in Miami gearresteerd wegens een andere fraudezaak en vertelt de FBI ook over Belfort. \r\nNaomi is inmiddels de illegale praktijken van haar man zat en vraagt een echtscheiding aan.\r\n\r\nDe FBI ondervraagt verschillende senior medewerkers, aanvankelijk zonder succes. \r\nBelfort besluit echter met de FBI mee te werken in ruil voor strafkorting. De FBI doet een inval bij Stratton Oakmont en \r\narresteert Azoff en een groot aantal andere senior medewerkers. \r\nBelfort zit de drie jaren gevangenisstraf uit en begint daarna een nieuwe carriere als motivatiespreker","torrent":{"xt":"urn:btih:12471bd6d9d6ed3ab3a923a7d7a0d71fa094344c","amp;dn":"The+Wolf+of+Wall+Street","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12471bd6d9d6ed3ab3a923a7d7a0d71fa094344c","infoHashBuffer":{"type":"Buffer","data":[18,71,27,214,217,214,237,58,179,169,35,167,215,160,215,31,160,148,52,76]},"announce":[],"urlList":[]}}