{"title":"Brutal Castings - Lizzie Bell","uid":12694910,"size":276402422,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:12aa5ddb4cb343e71b9150e23087f4ef960c6560&amp;dn=Brutal+Castings+-+Lizzie+Bell&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hunter534","files":1,"time":1446720096,"description":"Lizzie Bell, a bubbly teen from Kentucky comes to Teen Castings with the hopes of becoming the next big thing. Lizzie's from a small town, and girls from small towns always work harder than anyone else to achieve their goals. The agent gives Lizzie her chance to earn his respect, but she won't take anything off, so he can see what she looks like. The master ties her hands with rope and slaps her face until she comes around to his way of thinking and finally strips down. Humiliation and pain are very effective coaching tools and usually put the girls at ease. Giving a deepthroat blowjob also helps girls to relax, especially teen girls, and Lizzie can barely take the master's huge cock in her throat without choking. She works hard at it though, and gets that hog all the way down. The master decides to switch it up and spanks her naked pussy with the dirty sole of his dress shoe to get her ready for a deep four finger penetration, and he fingerfucks her until she squirts all over the casting couch. A hot fuck finale takes it all the way to the money shot. Lizzie takes a huge load on her face and leaves it there all the way through the post-fuck interview. We got a freshly made sex slave here!\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://photo-up.info/img-563b2428a34d1.html \r\n \nhttp://myimg.info/img-563b242fde81c.html","torrent":{"xt":"urn:btih:12aa5ddb4cb343e71b9150e23087f4ef960c6560","amp;dn":"Brutal+Castings+-+Lizzie+Bell","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12aa5ddb4cb343e71b9150e23087f4ef960c6560","infoHashBuffer":{"type":"Buffer","data":[18,170,93,219,76,179,67,231,27,145,80,226,48,135,244,239,150,12,101,96]},"announce":[],"urlList":[]}}