{"title":"The Anthony Cumia Show 2015-12-08 Mike Recine Joe Matar MP4 MP3","uid":12955109,"size":352246915,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:1757480d3e09e9e145ddda95b9ce69177cde048b&amp;dn=The+Anthony+Cumia+Show+2015-12-08+Mike+Recine+Joe+Matar+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mothergoose58","files":2,"time":1449773068,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\r\n\r\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\r\n\r\n\r\nAfter 1 year of complete broadcasting freedom the Anthony Cumia Network is proud to launch their new studio in New York City! Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\r\n\r\nGuests: Mike Recine, Joe Matarese\r\n\r\nEpisode 278: Tuesday’s show begins with a little desk bitching, some dentist bitching, a Hanukkah update from Rat, a weather update, and a brief global warming discussion. Anthony then gets into last night’s episode of Fargo, Ron Howard walking on eggshells, Twitter scrolling in public, nudie pics, pubic tats, and Joe Matarese and Mike Recine join the show to chat about changing your look and name for entertainment, ugly people in the industry, and Apollonia’s goofy tits. Mike tells us about his relationship, the guys talk about the lack of female groupies, having a sense of humor, juggling gals, parodies, daytime strip clubs and strippers, booth dancers, fucking strippers, and fucked up teeth. The trio then discusses Trump, shitty names, the presidential candidates approval ratings, Trump on muzzies, our PC nation, racism in Love American Style and Happy Days, missed roles, impressionists, Rich Little, and Yakov’s Dinner Adventure. They also yap about the pre-Hulu days of TV, a German Hitler comedy, Robert Loggia kicking the bucket, viral fight videos, Pauly Shore’s fake fight video, Joe’s heckler video, comics personalities, show pitches, being and not being offended, they revisit porno dude James Deen by way of Farrah Abraham, and wrap up talking about banned comics, leaked videos, and Ant muses over still having an agent.\r\n\r\n\r\n\r\n\r\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\r\n\r\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:1757480d3e09e9e145ddda95b9ce69177cde048b","amp;dn":"The+Anthony+Cumia+Show+2015-12-08+Mike+Recine+Joe+Matar+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1757480d3e09e9e145ddda95b9ce69177cde048b","infoHashBuffer":{"type":"Buffer","data":[23,87,72,13,62,9,233,225,69,221,218,149,185,206,105,23,124,222,4,139]},"announce":[],"urlList":[]}}