{"title":"GirlsWay - Jillian Janson, Val Dodds (Kiss Me Longer)","uid":12867303,"size":340766021,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:17ed04aaad3b88bb407e3cda5160bafe0ca7273b&amp;dn=GirlsWay+-+Jillian+Janson%2C+Val+Dodds+%28Kiss+Me+Longer%29+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"feeldabyte","files":1,"time":1448825997,"description":"Screens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/rDXXA \nhttp://imgkiss.com/image/rDsVU\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nVal Dodds and her girlfriend Jillian Janson have been together for a long time, and each and every morning they wake up they're excited to see one another lying there in the nude, exposing some of their best parts. This morning, Jillian wakes to the glorious sight of Val lying there still and soft, just begging to be touched and kissed, long and hard. When Val wakes up she shares her dream with Jillian about how soon she sees them getting married in the forest with their families and how they'll work from home when they're older.\r\n\r\nJillian likes to hear Val's dreams and they resemble hers a lot too, but right now, what's more important is that they show that agreement through a physical act that reaffirms their lesbian love together. Jillian gently caresses her girlfriend's beautiful boobs and tweaks her perky nipples. They lie there sharing their love int he embrace of a kiss. Kissing is, after all the best part of their love, for them, the way they can show the loving chemistry flowing between them. Jillian wants to go further kissing other parts but Val makes her hold out. We see them kiss for long drawn out moments of pure happiness.\r\n\r\nBut that can only last so long, can't it? Jillian uses all her tools to make sure she doesn't have to break her connection with Val's perfect lips, by gently caressing her body and eventually using her expert fingers to stimulate Val's wet pussy, watching her squirm under her soft body, wanting more and more of Jillian inside her pussy until she comes with their lips locked, and their sparkling eyes staring into one another's warm souls.\r\n\r\n\r\nSail to another one :  https://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:17ed04aaad3b88bb407e3cda5160bafe0ca7273b","amp;dn":"GirlsWay+-+Jillian+Janson%2C+Val+Dodds+%28Kiss+Me+Longer%29+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17ed04aaad3b88bb407e3cda5160bafe0ca7273b","infoHashBuffer":{"type":"Buffer","data":[23,237,4,170,173,59,136,187,64,126,60,218,81,96,186,254,12,167,39,59]},"announce":[],"urlList":[]}}