{"title":"ExploitedCollegeGirls - Victoria (Perfect Example)","uid":12807606,"size":408763718,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:183325da82abe7d2187484e23995c5f6d244c7d4&amp;dn=ExploitedCollegeGirls+-+Victoria+%28Perfect+Example%29++&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"feeldabyte","files":1,"time":1448141279,"description":"Screens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/rXCH5 \nhttp://imgkiss.com/image/rXZ6g\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nVictoria doesn't look like your typical porn girl, but after an energy filled shoot and three or four loud, creamy orgasms she convinced us and she'll definitely convince you. We weren't sure about Victoria, and she starts off nervous, but porn loving Victoria actually contacted us to get on the site and after assuring us that she loves to fuck, has BJ skills that are beyond compare and knows how to get herself off no matter what, we gave her a shot.\r\n\r\nSometimes we might talk too much girl's attitude, but that's the difference between Ex Co Gi and most other sites. We try to bring out as much personality and individuality from each of the lovely ladies we invite to the airport Hilton to fuck Jay. Victoria is a perfect example of why we try so hard. From her crazy red hair to her teeny, soft 4'10&quot; bod she's girl next door cute, but her sex loving attitude is what makes her perfect for a shoot.\r\n\r\nOn to the good stuff! Jay starts this one off behind the scenes when he dares Victoria drop to her knees and start sucking his cock as she gets ready in the bathroom. Turns out her BJ skills are as good as she claimed and as nervous as she is she still practically devours his dick. Things get back on track and properly lit as Jay moves to the bed to ask a few more questions, including having Victoria explain her amusing morning porn and sex ritual.\r\n\r\nWhile we could listen to Vic nervously talk about her hilarious habits all day, we've got business to get to. Jay has her strip and get comfy and after just a little bit of Jay's expert finger banging she's creaming up and squirming to her first orgasm. Once she's warmed up, she stays warm and Jay's able to get her off over and over. He pounds her to orgasm three or four more times as she rubs her clit furiously to O after O. He drills her face down, from the back and side and then jack hammers her in reverse cowgirl.\r\n\r\nFor the big finish he has her get on her knees for her complimentary facial. She insisted that Jay avoid shooting in her eyes, and to help out she opens her mouth as wide as possible to try to catch as much as she can. Surprisingly she gets most of it and swallows what she can! \r\n\r\n\r\nSail to another one :  https://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:183325da82abe7d2187484e23995c5f6d244c7d4","amp;dn":"ExploitedCollegeGirls+-+Victoria+%28Perfect+Example%29++","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"183325da82abe7d2187484e23995c5f6d244c7d4","infoHashBuffer":{"type":"Buffer","data":[24,51,37,218,130,171,231,210,24,116,132,226,57,149,197,246,210,68,199,212]},"announce":[],"urlList":[]}}