{"title":"CFNM - Mad Maids (2012) 720p, HDRip","uid":12919299,"size":810995707,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1a0c9540da6c38b769ac4d7648bf47d056627168&amp;dn=CFNM+-+Mad+Maids+%282012%29+720p%2C+HDRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ImgSnaps","files":1,"time":1449397684,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/f\r\n \nhttp://imgsnaps.com/image/I\r\n\r\nDima Lukin and Hugo Antonin feature in this CFNM, with the Mad Maids. The maids are cleaning up after what seems to be a rather messy party. Chatting all the while they go about their work. One of the maid goes to move a blanket and under it she finds a sleeping Dima. They giggle at the sight of him asleep, with a cushion on his body. As one girl tries to peek under the cushion she thinks he is naked. Gently they remove the cushion and, indeed, Dima is naked. Also asleep on a chair is Hugo, as the girls remove his cover they find that he has kept his shorts on. Returning their attention to Dima one girl begins to tickle him with a duster, when she reaches his face he awakens. The other girl quickly grabs his arms while the other one jumps on him and covers his mouth to stop him from screaming out. They gag Dima with a ball gag to keep him quiet, and tie his wrists and ankles. Then they return to Hugo. They wake him by squirting him with cleaning fluid. They pull him to his feet and restrain him with his arms tied and held from above. Next they remove his shorts and gag him with them. His cock is beginning to get hard while they work on him. Taking whips the girls begin to whip his body, with Hugo trying to move out of the way, but unsuccessfully. Then they turn him around and begin to play with his ass and legs. Pulling on the hair and biting his cheeks before one girl shoves a finger in his ass hole. Turning Anton around again they see that his cock is hard and they suck on his cock and pull on his balls. Then they move Dima over to join them and remove his gag. They force him to suck on Anton's cock. Then they turn Hugo around and shove Dima's face into his ass crack trying to make him lick the ass. Dima is made to stand and he is forced to kiss Hugo as well. They release Hugo and put him on the sofa, replacing him with Dima so they can begin to play with him too. Soon they have his cock rock hard and suck on it, as they did with Hugo. Then they turn him around too to use his ass as a receptacle for a finger. Next the girls take a boy each and bend them over the sofa and, wearing strapons, begin to fuck them. They fuck them nice and hard, with the guys moaning as they feel the rubber dicks deep in their asses. Finally the guys are made to kneel facing each other and the girls wank them and make them cum over each other","torrent":{"xt":"urn:btih:1a0c9540da6c38b769ac4d7648bf47d056627168","amp;dn":"CFNM+-+Mad+Maids+%282012%29+720p%2C+HDRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a0c9540da6c38b769ac4d7648bf47d056627168","infoHashBuffer":{"type":"Buffer","data":[26,12,149,64,218,108,56,183,105,172,77,118,72,191,71,208,86,98,113,104]},"announce":[],"urlList":[]}}