{"title":"Windows 10 ADK SDK Nov2015 Seven7i","uid":12702919,"size":3911188480,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1dd60a0508fde587bc3956d6be538dfdad40d56d&amp;dn=Windows+10+ADK+SDK+Nov2015+Seven7i&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Seven7iAfghansofts","files":8,"time":1446796664,"description":"Seven7i Presents\r\n\r\nWhat's new in kits and tools:\r\n[Some information relates to pre-released product which may be substantially modified before it's commercially released. Microsoft makes no warranties, express or implied, with respect to the information provided here.]\r\nThe Windows 10 Insider Preview kits and tools include an updated Windows Driver Kit (WDK), Hardware Lab Kit (HLK), Software Development Kit (SDK), and Assessment and Deployment Kit (ADK).\r\nHere's a summary of what's new in the kits and tools.\r\nWhat’s new in the Windows ADK:\r\nThe Windows ADK now includes Windows Imaging and Configuration Designer, the Windows Assessment Toolkit, the Windows Performance Toolkit, and several new and improved deployment tools that can help you automate a large-scale deployment of Windows 10.\r\nWindows Imaging and Configuration Designer (Windows ICD)\r\nQuickly create a provisioning package that you can use to customize devices without re-imaging.\r\nBuild a customized Windows image for specific market segments and regions.\r\nSee Getting started with Windows ICD for more information.\r\nPush-button reset incorporates system updates by default\r\nUsers can now refresh or restore their PCs to the updated version of the system files, instead of having to reinstall each update individually.\r\nPartial language packs now available\r\nWant to add more languages for users when they turn on their device? Instead of adding full language packs, save space by adding just the base user interface files for a language. Later, if your user needs handwriting or voice recognition capabilities, Windows can download them as needed.\r\nFor more information, see Language Packs (lp.cab) and Windows Deployment.\r\nNew package type: Capabilities\r\nThis new Windows package type lets you request services like Microsoft .NET or languages without specifying the version. Use the DISM tool to search multiple sources like Windows Update or your corporate servers to find and install the latest version.\r\nSave space by running Windows from compressed OS files\r\nYou can now run Windows directly from compressed files. This is similar to WIMBoot, introduced in Windows 8.1 Update 1. This new process uses individual files instead of a static WIM file. When updating system files, Windows now replaces the old files instead of keeping both copies.\r\nWindows Performance Analyzer Sharing and Collaboration\r\nDevelopers can package and share their trace in a zip file along with their trace session, annotations, and (optionally) loaded symbols with Windows Performance Analyzer.\r\nSee What's New in the Windows Performance Toolkit for more information.\r\nWindows Performance Recorder Query Providers\r\nWindows Performance Recorder now supports querying providers. ProcessExeFilter is an optional attribute, allows providers to filter specific processes by their corresponding executable name.\r\nSee What's New in the Windows Performance Toolkit for more information.\r\nWhat's new in the Hardware Lab Kit (HLK)\r\n\r\nPlaylists\r\nPlaylists are used to describe collections of tests. An official playlist is used for the Windows Hardware Certification Program. You can also define your own playlists.\r\nThe Object Model now includes support for playlists.\r\nTo get started with the HLK, see the Windows HLK Getting Started Guide.\r\nWindows Hardware Compatibility Program\r\nHardware certification is no longer required. Instead, the Windows Hardware Compatibility Program is an optional program in which you can participate.\r\nLevels are no longer used to identify content required for the compatibility program; you should use the official playlist instead.\r\nFor more information, see Windows Hardware Compatibility Program.\r\nVirtual machine support\r\nThe HLK Controller now supports installation and execution in a virtual machine. When configuring your virtual machines, ensure the virtual machine meets the minimum requirements for the HLK Controller.\r\nPartial packaging\r\nYou can now package a subset of test results within an HLK project, tailoring the packaging experience to key scenarios. This allows you to capture, share, and diagnose test failures without having to run tests individually in a new project.\r\nRate this Test\r\nYou can now provide feedback on tests in the HLK. To rate tests, you must opt-in to CEIP. To rate a test, right-click on the desired test in the Results Pane, and select Rate This Test.\r\nPreview pane\r\nThe Preview pane provides project and package information including Name, Creation Date, Targets, and Type.\r\nServer support\r\nThe HLK now supports Windows Server 2012 R2\r\n\r\nEnjoy,\r\nSeven7i :)","torrent":{"xt":"urn:btih:1dd60a0508fde587bc3956d6be538dfdad40d56d","amp;dn":"Windows+10+ADK+SDK+Nov2015+Seven7i","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1dd60a0508fde587bc3956d6be538dfdad40d56d","infoHashBuffer":{"type":"Buffer","data":[29,214,10,5,8,253,229,135,188,57,86,214,190,83,141,253,173,64,213,109]},"announce":[],"urlList":[]}}