{"title":"Four.Corners.My.Own.Choice.Assisted.Suicide.288p.WEBRIP.[MPup]","uid":12977656,"size":158127350,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1f4e5710035295c9d24a6dd3fb821d632295ab8c&amp;dn=Four.Corners.My.Own.Choice.Assisted.Suicide.288p.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":1,"time":1450002362,"description":"Four.Corners.2013.09.16.My.Own.Choice.Assisted.Suicide.288p.LDTV.WEBRIP.[MPup]\r\nLow-Definition Television (LDTV) ABC iview WEBRIP: 640x360\r\n\r\nFormat: MPEG-4\r\nSize: 512x288 (with vertical black bars)\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 44.1 KHz\r\n\r\n&quot;I don't want to do something irrational. You know, I don't want to hang myself. I don't want to shoot myself. I don't want to jump off a bridge. I don't want to run in front of a train 'cause that's suicide. This is not suicide what I plan to do.&quot; Jay\r\n\r\n[img]http://extraimago.com/images/2015/12/13/2c46a35c729a07f71ca484f40ead150f.jpg[/img]\r\n\r\nThere are some questions we hope we will never have to answer. But what would you do if you suffered from a debilitating illness that left you in constant and severe pain? What would you do if the only way you could find relief was to take heavy duty pain killers that also impacted heavily on your physical health?\r\n\r\nAfter 36 years struggling with that situation, a young man says he's had enough and he wants to end his own life. Because assisted suicide and voluntary euthanasia are illegal in Australia he is forced to apply to an organisation in a foreign country to fulfil his wish.\r\n\r\nNext on Four Corners reporter Liz Jackson tells Jay's story. She spends time with him finding out what his life has been like and how he lives day-to-day. She follows the path that has led him to his decision, and finds out what he thinks will be the consequences of his decision to die.\r\n\r\nShe is there as he discusses his decision with his family and friends. She is there as he seeks the documentation that will allow him to win medical approval for his plan.\r\n\r\nJay's story raises many questions: why doesn't society allow an individual with an incurable condition the right to seek assistance to end their own life? Is it right that a person is forced to go overseas to die in this way? And why don't our political representatives deal with the issue in an open and free manner?\r\n\r\n&quot;They haven't had to walk in my shoes for these past 36 years and they're not going through what I go through every day, you know, and it's not about them anyway at the end of the day. It's about me and me being able to make my own, my own choice.&quot; Jay","torrent":{"xt":"urn:btih:1f4e5710035295c9d24a6dd3fb821d632295ab8c","amp;dn":"Four.Corners.My.Own.Choice.Assisted.Suicide.288p.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f4e5710035295c9d24a6dd3fb821d632295ab8c","infoHashBuffer":{"type":"Buffer","data":[31,78,87,16,3,82,149,201,210,74,109,211,251,130,29,99,34,149,171,140]},"announce":[],"urlList":[]}}