{"title":"Stephen Baxter - Coalescent (Destiny's Children #1)","uid":12722156,"size":569858404,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:21f659efe558e80cc03a54d7d7f369d544b23408&amp;dn=Stephen+Baxter+-+Coalescent+%28Destiny%27s+Children+%231%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cybotage","files":55,"time":1447005401,"description":"\nStephen Baxter possesses one of the most brilliant minds in modern science fiction. His vivid storytelling skills have earned him comparison to the giants of the past: Clarke, Asimov, Stapledon. Like his greatpredecessors, Baxter thinks on a cosmic scale, spinning cutting-edge scientific speculation into pure, page-turning gold. Now Baxter is back with a breathtaking adventure that begins during the catastrophic collapse of Roman Britain and stretches forward into an unimaginably distant, war-torn future, where the fate of humanity lies waiting at the center of the galaxy. . . .\r\n\r\nGeorge Poole isn’t sure whether his life has reached a turning point or a dead end. At forty-five, he is divorced and childless, with a career that is going nowhere fast. Then, when his father dies suddenly, George stumbles onto a family secret: a sister he never knew existed. A twin named Rosa, raised in Rome by an enigmatic cult. Hoping to find the answers to the missing pieces of his life, George sets out for the ancient city.\r\n\r\nOnce in Rome, he learns from Rosa the enthralling story of their distant ancestor, Regina, an iron-willed genius determined to preserve her family as the empire disintegrates around her. It was Regina who founded the cult, which has mysteriously survived and prospered below the streets of Rome for almost two millennia. The Order, says Rosa, is her real family– and, even if he doesn’t realize it yet, it is George’s family, too. When she takes him into the vast underground city that is the Order’s secret home, he feels a strong sense of belonging, yet there is something oddly disturbing about the women he meets. They are all so young and so very much alike.\r\n\r\nNow, joined by his boyhood friend Peter McLachlan, who arrives in Rome with a dark secret of his own, George uncovers evidence suggesting that the women of the Order have embarked on a divergent evolutionary path. But they are not just a new kind of human. They are a better kind, genetically superior, equipped with all the tools necessary to render homo sapiens as extinct as the Neanderthals. And, chillingly, George and Peter soon have reason to fear that this colony is preparing to leave its overcrowded underground nest. . . .\r\n\r\n\r\nFormat: MP3\r\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:21f659efe558e80cc03a54d7d7f369d544b23408","amp;dn":"Stephen+Baxter+-+Coalescent+%28Destiny%27s+Children+%231%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21f659efe558e80cc03a54d7d7f369d544b23408","infoHashBuffer":{"type":"Buffer","data":[33,246,89,239,229,88,232,12,192,58,84,215,215,243,105,213,68,178,52,8]},"announce":[],"urlList":[]}}