{"title":"HotLegsAndFeet - Julia Roca (Gentlemans Service - Hot-Tempered P","uid":12921380,"size":685378495,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:2246d86a22b076a3747e0e9e0f11ce92d49d9286&amp;dn=HotLegsAndFeet+-+Julia+Roca+%28Gentlemans+Service+-+Hot-Tempered+P&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EndYou","files":1,"time":1449420018,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/album/kB\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nThe name of the actress: Julia Roca\r\nName movie: Gentleman's Service: Hot-Tempered Pampers Him From Head To Cock\r\nNPP site and the site: HotLegsAndFeet.com / DDFNetwork.com\r\n\r\nYear: 2015\r\nGenre: Cum on feet, Deep throat, Foot fetish, Footjob, Hairy Pussy, Handjob, Pussy fucking, Foot licking\r\nDuration: 00:19:28\r\n\r\nJulia Roca offers a very special gentleman's service and today's client is Mr. Lauro Giotto. The young and hot-blooded supermodel from Spain looks incredibly stunning when she opens the door for monsieur Giotto and quickly guides him to the bathroom, where he gets naked and enjoys a hot bath in the bathtub. Julia strokes her amazing thighs and we get a glimpse of her hairy pussy before she sits down behind his head and gives him a very sensual head massage. The hot-tempered teenager pampers him with her sexy feet from head to cock and Lauro gives her some intense toe sucking.\r\n\r\nShe massages his shaft and back with her soles and rubs his helmet with those super hot toes. Lauro turns his head around and stars licking her twat before getting his boner ready for her fuckhole. She slides her panties aside so he can cram that tight cunny with his hard prick and bangs her doggy style before they shift to the bedroom. Her nipples get super hard and he plays with her natural small titties before fucking her pussy hard while licking her big toe. Finally, Julia gives him another foot fuck until he blows his cum all over her amazing feet and red-polished toe nails. DDF Network's foot fetish scene comes in Full HD and delivers high-end entertainment for the gentleman of the world!\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 950x540 29.97fps 4498kbps\r\nAudio: AAC 48000Hz stereo 189kbps","torrent":{"xt":"urn:btih:2246d86a22b076a3747e0e9e0f11ce92d49d9286","amp;dn":"HotLegsAndFeet+-+Julia+Roca+%28Gentlemans+Service+-+Hot-Tempered+P","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2246d86a22b076a3747e0e9e0f11ce92d49d9286","infoHashBuffer":{"type":"Buffer","data":[34,70,216,106,34,176,118,163,116,126,14,158,15,17,206,146,212,157,146,134]},"announce":[],"urlList":[]}}