{"title":"Das Beil von Wandsbek (DEFA, 1951)","uid":12667169,"size":833209206,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:238d62a999b282aa3879ffea8df892c085446e21&amp;dn=Das+Beil+von+Wandsbek+%28DEFA%2C+1951%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mesothorax","files":1,"time":1446377970,"description":"Das Beil von Wandsbek ist ein Drama von Falk Harnack aus dem Jahr 1951 nach dem gleichnamigen Roman von Arnold Zweig (Das Beil von Wandsbek). Es war der erste DEFA-Film mit Aufführungsverbot.\r\n\r\n\r\nHandlung\r\n\r\nHamburg 1934. Adolf Hitler wird in der Stadt erwartet, aber vorher gilt es noch einen „Makel“ zu beseitigen: Vier zum Tode verurteilte Kommunisten sind noch nicht hingerichtet. In der Stadt fehlt aber gerade ein Henker. Der erfolgreiche Reeder und SS-Standartenführer Footh erhofft sich mit der Lösung des Problems die Gunst eines ranghöheren Nazi-Funktionärs. Da kommt es ihm gelegen, dass sein alter Kamerad aus dem Ersten Weltkrieg, der Schlachtermeister Teetjen aus Wandsbek, ihn um finanzielle Hilfe ersucht für eine Modernisierung seiner Metzgerei.\r\n\r\nFooth bietet Teetjen 2000 Mark an, wenn er die Aufgabe des Scharfrichters übernimmt. Nach einer Nacht Bedenkzeit willigt Teetjen ein mit der Bedingung, dass seine Tat geheim bleibt. Er waltet seines Amtes, doch der Zufall will es, dass sich Tat und Täter herumsprechen. Die Kunden aus seinem Bezirk reagieren angewidert und bleiben seinem Laden nun zunehmend fern. Footh ignoriert einen weiteren Hilfeersuch und wendet sich von Teetjen ab. Die finanzielle Not wird fortan größer als zuvor. Eine kurzfristige Unterstützung seiner Kameraden der SA kommt zu spät, seine Frau Stine erhängt sich, woraufhin sich Teetjen erschießt.\r\nHintergrund\r\n\r\nUm den Film gab es heftige Diskussionen. So verlangte die DEFA-Kommission, dass die Schuld des Henkers nicht nur als sein persönliches Versagen herausgestellt werden dürfe, sondern als Schuld des faschistischen Systems. Auch aus dem Zentralkomitee der KPdSU gab es Einwände: Der Film wecke Mitleid mit den Mördern und solle daher aus dem Programm genommen werden.\r\n\r\n    „Noch krasser offenbaren sich die Fehler des kritischen Realismus in dem Film „Das Beil von Wandsbeck“, der nicht die Kämpfer der deutschen Arbeiterklasse zu den Haupthelden macht, sondern ihren Henker. Die Verfilmung dieses Stoffes war ein ernster Fehler der DEFA-Kommission und des DEFA-Vorstandes.“\r\n\r\n– SED-Politbüro[1]\r\n\r\nSo konnte das Beil von Wandsbek nur einen Monat laufen, es hatte 800.000 Besucher. Bertolt Brecht machte erfolglos Änderungsvorschläge zum Film, um den Streit zu schlichten [2]. 1962 kam eine um zwanzig Minuten gekürzte Fassung in die Kinos, 1981 wurde der komplette Film - zum 75. Geburtstag von Erwin Geschonneck - restauriert. Falk Harnack verließ nach den Auseinandersetzungen 1952 die DDR.\r\n\r\n1982 kam es zu einer Neuverfilmung von Horst Königstein und Heinrich Breloer.\r\nKritiken\r\n\r\n    „Harnacks Film, sein Regiedebüt und wohl seine beste Kinoarbeit, folgt dem von Arnold Zweig im Exil in Haifa geschriebenen, erstmals 1943 (in Hebräisch) erschienenen Roman. Wenige Wochen nach dem Start in mehreren Städten der DDR wurde die DEFA-Produktion (Neues Deutschland: „Ein Kunstwerk“) mit der Begründung aus dem Verleih gezogen, der Film wecke Mitleid mit einem Nazi. Erst 1962 gelangte Harnacks Debüt - stark gekürzt - auf Zweigs Empfehlung hin wieder ins Kino.“\r\n\r\n– Lexikon des Internationalen Films\r\nLiteratur\r\n\r\n    Ingrid Poss, Peter Warnecke (Hrsg.): Spur der Filme, Zeitzeugen über die DEFA. DEFA-Stiftung, Berlin 2006, ISBN 978-3-86153-401-3","torrent":{"xt":"urn:btih:238d62a999b282aa3879ffea8df892c085446e21","amp;dn":"Das+Beil+von+Wandsbek+%28DEFA%2C+1951%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"238d62a999b282aa3879ffea8df892c085446e21","infoHashBuffer":{"type":"Buffer","data":[35,141,98,169,153,178,130,170,56,121,255,234,141,248,146,192,133,68,110,33]},"announce":[],"urlList":[]}}