{"title":"[AllGirlMassage] - Aaliyah Love, Natalia Starr - (Do You Cam) [N","uid":12874371,"size":363336627,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:25161de8f114b33cf73801fd58c3e6c045bce731&amp;dn=%5BAllGirlMassage%5D+-+Aaliyah+Love%2C+Natalia+Starr+-+%28Do+You+Cam%29+%5BN&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kuzili1","files":1,"time":1448928704,"description":"Aaliyah Love &amp; Natalia Starr – Do You Cam?\r\nReleased: November 30, 2015\r\n\r\nNatalia Starr takes her masturbation skills to a whole other level, experiencing orgasmic joyousness, but the poor babe strains the muscles in her neck. She calls Aaliyah Love at the Fantasy Massage Spa in hopes of landing an urgent appointment. Natalia feels for some reason she recognized Aaliyah’s voice on the phone and even though Aaliyah shakes off the question, the truth is going to come out one way or another. Aaliyah greets Natalia, taking her to her massage room, showing her where she can prepare herself with towels provided. Natalia is an exhibitionist, flaunting her flawless, silky white frame, laying down on the massage table, now completely naked. But she can’t get her mind off the fact that she knows her masseuse’s face. Something about her voice and eyes made her so familiar, but Natalia can’t pin point where she knows her from and with her mind racing with a million questions, she finally figures it out; Aaliyah was a web cam model. Aaliyah at first is shy and reluctant to admit what she does and feels a little uncomfortable now that the truth is out. Natalia is fascinated at Aaliyah’s skills on camera, how she used strawberries and blue dildos in her pussy, how sexy it was when she rubbed her clit until she came on camera. The more Natalia speaks about Aaliyah’s past, the more Ms. Love becomes impatient and annoyed and just can’t take it anymore. She ends the massage treatment, apologizing that Natalia’s conversation is just too uncomfortable and offers Natalia another masseuse who can take care of her needs. Aaliyah wants to put her past in the past, moving on with her life, she doesn’t need to be reminded of something she is over with. Natalia apologizes and promises she will not mention Aaliyah’s past anymore, but it doesn’t mean she won’t convince her favorite web cam star for some lesbian intimacy!\r\n\r\nFile size                                : 347 MiB\r\nDuration                                 : 36mn 13s\r\nBit rate                                 : 1 200 Kbps\r\nWidth                                    : 720 pixels\r\nHeight                                   : 400 pixels\r\nDisplay aspect ratio                     : 16:9\r\n \nhttp://imgfapper.com/img-565cd7986f278.html\r\n \nhttp://imgfapper.com/img-565cd798788f8.html\r\n \nhttp://imgfapper.com/img-565cd7988244f.html","torrent":{"xt":"urn:btih:25161de8f114b33cf73801fd58c3e6c045bce731","amp;dn":"%5BAllGirlMassage%5D+-+Aaliyah+Love%2C+Natalia+Starr+-+%28Do+You+Cam%29+%5BN","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25161de8f114b33cf73801fd58c3e6c045bce731","infoHashBuffer":{"type":"Buffer","data":[37,22,29,232,241,20,179,60,247,56,1,253,88,195,230,192,69,188,231,49]},"announce":[],"urlList":[]}}