{"title":"NubileFilms - Baby Kate (Invitation To Touch)","uid":12805199,"size":265090811,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:25e18773d6425fbec85e6222ba7e627502554569&amp;dn=NubileFilms+-+Baby+Kate+%28Invitation+To+Touch%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EndYou","files":1,"time":1448116773,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/image/Zlz \nhttp://imgpremium.com/image/Z0D\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nThe name of the actress: Baby Kate\r\nName movie: Invitation To Touch\r\nNPP site and the site: NubileFilms.com / NubilesNetwork.com\r\n\r\nYear: 2015\r\nGenre: Big Areolas, Big Boobs, Blowjob, Brunette, Deep Throat, European, Girl-Boy, Hardcore, Long hair, Massage, Panties, Puffy Nipples, Pussy Licking\r\nDuration: 00:25:29\r\n\r\nBusty sweetie Baby Kate has agreed to let Steve Q. give her a massage. Peeling off her towel and then her bra and panties, Baby lies down on the massage table and lets Steve put his magic hands to work. It is not long before he covers her bubble butt with oil that drips down Baby's creamy bald pussy. What's a man to do besides pull her folds aside and slide two fingers deep into that tight warmth?\r\n\r\nWhen Baby is receptive to Steve's initial advances, he leans forward to lick her clean tight anus. That magical touch inspires Baby to pull Steve closer so that she can pull out his cock to start licking and sucking. Unable to keep his hands from caressing Baby's rump while she deep throats him, Steve soon finds his hips twitching as he mouth fucks his lover. Keeping his magic hands in motion, he soon rewards Baby for her mouth's magic as he brings her to the first of many climaxes.\r\n\r\nNow that she's nicely loosened up, Baby can not wait to have her pussy pounded! Steve slides into her slowly with the help of a healthy dose of massage oil that covers her bald mound and big boobs. Finding her not quite wet enough for his liking, he pulls out again after a few thrusts and then goes to work with his talented mouth eating his lover out until she is dripping with eagerness.\r\n\r\nOnce he's back inside, Steve starts off gentle but soon escalates his strokes until he is moving at a pace that sets Baby's jiggly breasts bouncing. Baby can barely contain her moans and gasps of excitement as Steve works her towards the orgasm she craves, and as he brings her ever closer her cries get louder until they fill the room.\r\n\r\nBaby is not ready to quit yet. Climbing onto Steve's fuck stick, she slides down until her bald snatch is pressed to Steve's balls and then she starts flexing her hips for a lusty stiffie ride. Steve can not keep his hands off of Baby's bouncing knockers as she grinds her hips, and the friction on her puffy nipples brings Baby off yet again!\r\n\r\nAfter another round of pussy eating and anal licking, Steve goes back to work. This time he fucks Baby doggy style with long hard strokes that feel incredible to his lover. He holds nothing back now, fucking Baby's snatch in a furious frenzy that drives her to a final climax just before he pulls out to jizz all over Baby's boobs and juicy ass.\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 960x540 23.976fps 1272kbps\r\nAudio: AAC 44100Hz stereo 109kbps","torrent":{"xt":"urn:btih:25e18773d6425fbec85e6222ba7e627502554569","amp;dn":"NubileFilms+-+Baby+Kate+%28Invitation+To+Touch%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25e18773d6425fbec85e6222ba7e627502554569","infoHashBuffer":{"type":"Buffer","data":[37,225,135,115,214,66,95,190,200,94,98,34,186,126,98,117,2,85,69,105]},"announce":[],"urlList":[]}}