{"title":"Colour-The.Spectrum.of.Science-BBC-2015-3Ep--720p","uid":12790203,"size":3174136979,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:2663cb77adfa53ecac1186177ec8ed24736d24d9&amp;dn=Colour-The.Spectrum.of.Science-BBC-2015-3Ep--720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uggauga","files":6,"time":1447904672,"description":"Colour: The Spectrum of Science\r\n\r\nHelen Czerski goes in search of colour. She reveals what it is, what it does, and why colour doesn't exist outside of our perception.\r\n\r\nWe live in a world ablaze with colour. Rainbows and rainforests, oceans and humanity, Earth is the most colourful place we know of. But the colours we see are far more complex and fascinating than they appear. In this series, Dr Helen Czerski uncovers what colour is, how it works, and how it has written the story of our planet - from the colours that transformed a dull ball of rock into a vivid jewel to the colours that life has used to survive and thrive. But the story doesn't end there - there are also the colours that we can't see, the ones that lie beyond the rainbow. Each one has a fascinating story to tell.\r\n\r\nBBC 2015 - 3 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/p02vmwbt\r\n___________________________________________________\r\n\r\n1280x720 resolution -with subtitles - enjoy !\r\n___________________________________________________\r\n\r\nColours of Earth\r\nEpisode 1 of 3\r\nIn the first episode, Helen seeks out the colours that turned planet Earth multicoloured. To investigate the essence of sunlight Helen travels to California to visit the largest solar telescope in the world. She discovers how the most vivid blue is formed from sulfur atoms deep within the Earth's crust and why the presence of red ochre is a key sign of life. In gold, she discovers why this most precious of metals shouldn't even exist on the surface of the planet and in white, Helen travels to one of the hottest places on Earth to explore the role salt and water played in shaping planet Earth.\r\n\r\nColours of Life\r\nEpisode 2 of 3\r\nThe raw, early Earth had plenty of colour, but that was nothing compared with what was going to come next. That canvas was about to be painted with a vast new palette - and the source of those colours was life. Green is the colour of the natural world and yet it's the one colour that plants have evolved not to use.\r\nThe huge diversity of human skin tones tells the story of how humanity spread and ultimately conquered the planet. But the true masters of colour turn out to be some of the smallest and most elusive. Helen Czerski travels to the Great Smokey Mountains of Tennessee during the one week in the year when fireflies light up the night sky with their colourful mating display. And she reveals the marine animals that hide from the world by changing the colour of their skin.\r\n\r\nBeyond the Rainbow\r\nEpisode 3 of 3\r\nThe colours that we see are only a fraction of what's out there. Beyond the rainbow there are colours invisible to our eyes. In this episode, Dr Helen Czerski tells the story of scientific discovery. To see the universe in a whole new light, Helen takes to the skies in a NASA jumbo jet equipped with a 17-tonne infrared telescope.\r\nWe can't see in ultra violet, but many animals can. Helen explores what the world looks like to the birds and the bees. With the discovery of x-rays we could look inside ourselves in ways that previously had only been possible after death. Today those same x-rays allow us to examine life at the atomic level, helping to develop new drugs and better materials. Ultimately, by harnessing all the colours there are, researchers are beginning to image the human body as never before, revealing new ways to treat disease","torrent":{"xt":"urn:btih:2663cb77adfa53ecac1186177ec8ed24736d24d9","amp;dn":"Colour-The.Spectrum.of.Science-BBC-2015-3Ep--720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2663cb77adfa53ecac1186177ec8ed24736d24d9","infoHashBuffer":{"type":"Buffer","data":[38,99,203,119,173,250,83,236,172,17,134,23,126,200,237,36,115,109,36,217]},"announce":[],"urlList":[]}}