{"title":"The.Pendle.Witch.Child.EN.SUB.HEVC.x265.WEBRIP.[MPup]","uid":12663250,"size":206361604,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:292532dd40291b0d53f54c12b5ca0fd65c06a441&amp;dn=The.Pendle.Witch.Child.EN.SUB.HEVC.x265.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1446329847,"description":"BBC.Documentaries.2011.08.17.The.Pendle.Witch.Child.EN.SUB.HEVC.x265.WEBRIP.[MPup]\r\n\r\nFormat: [b]This is a [i]HEVC x265 MKV[/i] file. You may need to update your video codecs to play this file.[/b]\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nThe story of the most disturbing witch trial in British history and how a young girl's testimony sent her mother, brother, sister and many of her neighbours to the gallows.\r\n\r\n[img]http://extraimago.com/images/2015/10/31/f251a96d2761f44bcb230bfc2e8d0419.jpg[/img]\r\n\r\nSimon Armitage presents the extraordinary story of the most disturbing witch trial in British history and the key role played in it by one nine-year-old girl. Jennet Device, a beggar-girl from Pendle in Lancashire, was the star witness in the trial in 1612 of her own mother, her brother, her sister and many of her neighbours and, thanks to her chilling testimony, they were all hanged. Armitage explores the lethal power and influence of one child's words - a story of fear, magic and demonic pacts retold partly with vivid and innovative hand-drawn animation. He discovers how Jennet's appearance in the witness box cast its shadow way beyond Lancashire, impressing lawyers, politicians, clerics and even King James I himself, and setting a dark precedent for child testimony in witch trials as far away as America. Finally, in a dramatic twist to the tale, he reveals how, twenty two years after the original trial, Jennet's own words were very nearly the death of her - when she herself was put on trial, accused of being a witch by a 10-year-old boy.\r\nWith the help of historians Malcolm Gaskill, Diane Purkiss and Ronald Hutton, Armitage attempts to get inside Jennet's head and understand how the illegitimate and illiterate youngest child of a family of beggars could become both pawn and player in a much bigger story of 17th century religion, power, law, science and the monarchy. What made Jennet speak out so everyone she knew would die? And how did the courts decide to admit her evidence and allow her example to create a precedent for accepting the testimony of other child witnesses who wanted to send their neighbours to the gallows?\r\nAlthough the events in this film may date back four hundred years, its issues resonate today as much as ever - when to believe our children, how the police and the court system should handle child witnesses and above all how, in times of crisis, fear of evil can easily lead us to behave in ways which may corrode the very values that we most wish to protect","torrent":{"xt":"urn:btih:292532dd40291b0d53f54c12b5ca0fd65c06a441","amp;dn":"The.Pendle.Witch.Child.EN.SUB.HEVC.x265.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"292532dd40291b0d53f54c12b5ca0fd65c06a441","infoHashBuffer":{"type":"Buffer","data":[41,37,50,221,64,41,27,13,83,245,76,18,181,202,15,214,92,6,164,65]},"announce":[],"urlList":[]}}