{"title":"Athenian Prostitution - The Business of Sex - Edward E. Cohen","uid":12927254,"size":5095443,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a4c2d5463c24617bdb5f022f5d672e22bb4c4f6&amp;dn=Athenian+Prostitution+-+The+Business+of+Sex+-+Edward+E.+Cohen&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1449483836,"description":"This is a pioneering study that examines the sale of sex in classical Athens from a commercial (rather than from a cultural or moral) perspective. Following the author's earlier book on Athenian banking, this work analyzes erotic business at Athens in the context of the Athenian economy. For the Athenians, the social acceptability and moral standing of human labor was largely determined by the conditions under which work was performed. Pursued in a context characteristic of servile endeavor, prostitution-like all forms of slave labor-was contemptible. Pursued under conditions appropriate to non-servile endeavor, prostitution-like all forms of free labor-was not violative of Athenian work ethics. As a mercantile activity, however, prostitution was not untouched by Athenian antagonism toward commercial and manual pursuits; as the &quot;business of sex,&quot; prostitution further evoked negativity from segments of Greek opinion uncomfortable with any form of carnality. Yet ancient sources also adumbrate another view, in which the sale of sex, lawful and indeed pervasive at Athens, is presented alluringly.\r\n\r\nIn a book that will be of interest to all students of sex and gender, to economic, legal and social historians, and to classicists, the author explores the high compensation earned by female sexual entrepreneurs who often controlled prostitutional businesses that were perpetuated from generation to generation on a matrilineal basis, and that benefitted from legislative restrictions on pimping. The author juxtaposes the widespread practice of &quot;prostitution pursuant to written contract&quot; with legislation targeting male prostitutes functioning as governmental leaders, and explores the seemingly contradictory phenomena of extensive sexual exploitation of slave prostitutes (male and female) coexisting with Athenian society's pride in its legislative protection of slaves and minors against sexual outrage","torrent":{"xt":"urn:btih:2a4c2d5463c24617bdb5f022f5d672e22bb4c4f6","amp;dn":"Athenian+Prostitution+-+The+Business+of+Sex+-+Edward+E.+Cohen","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a4c2d5463c24617bdb5f022f5d672e22bb4c4f6","infoHashBuffer":{"type":"Buffer","data":[42,76,45,84,99,194,70,23,189,181,240,34,245,214,114,226,43,180,196,246]},"announce":[],"urlList":[]}}