{"title":"Ring of Fire (2015).pdf Gooner","uid":12711077,"size":8635563,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2bbf06292e20a4073f356c1b180f215e34713aa1&amp;dn=Ring+of+Fire+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1446894128,"description":"Ring of Fire - An Encyclopedia of the Pacific Rim's Earthquakes, Tsunamis and Volcanoes (2015).pdf Gooner\r\n\r\nPublisher: ABC-CLIO (March 17, 2015)\r\nLanguage: English\r\nISBN-10: 1610692969\r\nISBN-13: 978-1610692960\r\n\r\nOn March 11, 2011, a magnitude 9.0 earthquake struck off Japan's coast, triggering a powerful tsunami. The massive destruction that resulted proved that not even sophisticated, industrialized nations are immune from nature's fury. Written to take some of the mystery out of the earth's behavior, this encyclopedia chronicles major natural disasters that have occurred around the Pacific Rim, an area nicknamed the &quot;Ring of Fire&quot; because of the volatile earth that lies above and below.\r\n\r\nThe encyclopedia offers descriptions of deadly earthquakes, volcanic eruptions, and tsunamis through time. The entries provide in-depth information that promotes an understanding of the structure of the earth and earth processes and shares the insights of scientists whose work helps clarify the causes and effects of these cataclysmic events. At the same time, the work examines how the people and cultures of the Pacific Rim view this active part of the earth, how they live with the threat of disaster, and how they have been affected by major events that have occurred. Readers will come away with a holistic view of what is known, how this knowledge was gained, and what its implications may be","torrent":{"xt":"urn:btih:2bbf06292e20a4073f356c1b180f215e34713aa1","amp;dn":"Ring+of+Fire+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bbf06292e20a4073f356c1b180f215e34713aa1","infoHashBuffer":{"type":"Buffer","data":[43,191,6,41,46,32,164,7,63,53,108,27,24,15,33,94,52,113,58,161]},"announce":[],"urlList":[]}}