{"title":"Escape - 2012","uid":12675191,"size":3218835744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2cc07719c6f8f7fbd0a8d78578a24b1f2a030cb6&amp;dn=Escape+-+2012&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":16,"time":1446498441,"description":"\n\r\nIt seems middle age times were bad times in Norway: The plague killed half of the population and bandits started roaming the lands. &quot;Escape&quot; tells the story of a young girl that is travelling with her family to the next big city when a group of bandits lead by a mercyless blonde woman attack them.\r\n\r\nNorwegian director Roar Uthuag reunites with Ingrid Bolsø Berdal, the star of his break through movie &quot;Cold Prey&quot;, to bring you a grim tale in the beautiful lands of Norway. The landscapes are absolutely stunning and the cinemathography manages to it perfectly capture every last drop of this beautiful nature. The characters are more three dimensional than you'd expect and Ingrid Bolsø Berdal delivers a powerhouse performance highlighting what a great actress she is. No wonder she is now co-starring with Dwayne Johnson in &quot;Hercules&quot;. The supporting cast stays a little underdeveloped, which is a shame because the BluRay has about 5 minutes of deleted scenes that are basically all characterisation. It is especially weird because a common complaint is that the movie is way too short.\r\n\r\nSeeing three dimensional female villains in medieval times is still largely unknown territory outside of &quot;Game of Thrones&quot;, especially when you want to see them kicking ass instead of plotting schemes. So despite some obvious flaws in the last third, this is one cool movie","torrent":{"xt":"urn:btih:2cc07719c6f8f7fbd0a8d78578a24b1f2a030cb6","amp;dn":"Escape+-+2012","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2cc07719c6f8f7fbd0a8d78578a24b1f2a030cb6","infoHashBuffer":{"type":"Buffer","data":[44,192,119,25,198,248,247,251,208,168,215,133,120,162,75,31,42,3,12,182]},"announce":[],"urlList":[]}}