{"title":"A Terrible Revenge - Alfred-Maurice de Zayas [EN PDF]","uid":12638351,"size":7041639,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2df0aeda15d577e75bbdd858dc8364ea21e7f292&amp;dn=A+Terrible+Revenge+-+Alfred-Maurice+de+Zayas+%5BEN+PDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"perfect_stan","files":1,"time":1445961643,"description":"A Terrible Revenge: The Ethnic Cleansing of the East European Germans, 1944-1950 \r\nby Alfred-Maurice de Zayas\r\n\r\nis a book about the expulsion of Germans after World War II. Based on testimonials of German civilians and military, as well as many interviews with British and American politicians and diplomats who participated at the Potsdam Conference, including Robert Murphy, the political advisor of General Eisenhower, Sir Geoffrey Harrison (drafter of article XIII of the Potsdam Protocol concerning population transfers), and Sir Denis Allen (drafter of article IX on the provisional post-war borders), the book also describes the crimes committed by the Soviet Union, Poland, Czechoslovakia, Hungary and Yugoslavia, at the end of World War II, and cites the condemnation of the expulsions by Bertrand Russell, Victor Gollancz, Bishop Bell of Chichester and other contemporary intellectuals.\r\nThe author describes the history of German settlements in Central and Eastern Europe since the 12th century, the impact of the Treaties of Versailles and St. Germain on German minorities left in Poland and Czechoslovakia, the failure of the League of Nations system of minority protection, the outbreak of World War II and crimes committed by the Nazis, followed by the fate of the refugees from the former Eastern parts of Germany (Silesia, East Prussia, Pomerania, East Brandenburg), as well as the fate of German minorities in Czechoslovakia, Hungary, Poland, Romania, Yugoslavia and the Soviet Union.\r\nApproximately two million Germans, many of them children, died during the post period of 1944-1949.\r\nIn the words of de Zayas,\r\nThe tragic experience of the German expellees could have served as a warning to spare other nations the traumata of expulsion from their homelands, heritage, and pride. Alas, for decades the facts of the expulsion of the Germans were systematically ignored by the media and even by professional historians, whose function was and remains to do proper research, to chronicle events and to put them in perspective. No wonder that the ethnic cleansing of the 1990’s in the former Yugoslavia was presented by the media as unprecedented.\r\nBesides being a concise summary of the historical and legal aspects of the expulsion of the Germans, A Terrible Revenge weaves into the narrative numerous literary references, translated from the German by de Zayas, including moments from Goethe's Hermann and Dorothea (a novel about refugees), Schiller's Wilhelm Tell, Rainer Maria Rilke's Volksweise, as well as from other East German poets including the Silesians Joseph von Eichendorff and Gerhart Hauptmann, the East Prussian Agnes Miegel, the Danube Swabian Nicolaus Lenau, and the Sudeten Germans Richard Pleyer and Walter Vorbach.\r\n\r\nPlease SEED!!!","torrent":{"xt":"urn:btih:2df0aeda15d577e75bbdd858dc8364ea21e7f292","amp;dn":"A+Terrible+Revenge+-+Alfred-Maurice+de+Zayas+%5BEN+PDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2df0aeda15d577e75bbdd858dc8364ea21e7f292","infoHashBuffer":{"type":"Buffer","data":[45,240,174,218,21,213,119,231,91,189,216,88,220,131,100,234,33,231,242,146]},"announce":[],"urlList":[]}}