{"title":"Bobbi Starr's SPIT (Split Scenes)","uid":12706379,"size":4594953472,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:2e28a9ca6f2d8c44b089853a14bbc39ff2d662e7&amp;dn=Bobbi+Starr%27s+SPIT+%28Split+Scenes%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"irealu69","files":12,"time":1446833958,"description":"Bobbi Starr's SPIT (Split Scenes)\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n\r\nStarring: Ashlynn Leigh, Bobbi Starr, Chad Alva, Chastity Lynn, Dana DeArmond, Jessie Andrews, Juelz Ventura, Karlo Karrera, Katie St. Ives, Kimberly Kane\r\n\r\nDescription: For freaky fans of the current porn fashion of sex soaked in flowing wads of saliva, stylish director/kinky beauty Bobbi Starr spews forth the nasty, graphic &quot;Spit,&quot; a double-disc load of epic blow jobs slathered in warm, running expectoration. The young ladies of &quot;Spit&quot; are fond of deep-throating raging dicks and getting powerfully face-fucked until rivers of drool run all over their lovely faces. Bobbi herself appears in the sensational first scene - on an exposed L.A. rooftop in broad daylight she blows/gets her face fucked by dark-dicked studs Nat Turnher and Karlo Karrera, resulting in copious streams of viscous gag slobber. Adorable blonde Jessie Andrews gags on Mr. Pete in a mouth-watering warehouse blow job. The playful blonde applies her hands and mouth to Pete's peter, and she manipulates the resulting mess in her sticky fingers. Adorable, irrepressible American Latina Kristina Rose deep-throats Tommy Pistol; she's face-ravaged all over the kitchen and winds up with her make-up trashed. Girly blonde Chastity Lynn's face fucking leaves her eye make-up cascading down her cute countenance, and she slurps up a lake of her leavings from the hardwood floor. In the bathroom, Proxy Paige, now with dark hair, deep-throats Pete, getting her face frosted with his sperm and her drool. A wicked throat fuck renders tattooed Juelz Ventura as caked in semen and spit as a bordello spittoon. Nasty brunette Katie St. Ives does the deep-throat dance, uses hands and feet to get Tommy Pistol off, and smears a glass window with her salivary surplus. Visiting an amateur phlebotomist, sexy Ashlynn Leigh tongues his ball sack and hairy asshole until he splatters her drool-soaked face with jizz. Lovely but filthy Dana DeArmond wallows in face-drenching fellatio fun. This is porn for a coarse, unshockable generation - if a blow job ain't messy, it don't mean &quot;Spit!&quot;\r\n\r\nScreenshots:\r\n~~~~~~~~~~~~ \nhttp://www.picturescream.com/x/clean/GBYd\r\n \nhttp://www.picturescream.com/x/clean/GBYI\r\n \nhttp://www.picturescream.com/x/clean/GBYt\r\n \nhttp://www.picturescream.com/x/clean/GBYy\r\n \nhttp://www.picturescream.com/x/clean/GBYz\r\n \nhttp://www.picturescream.com/x/clean/GBYL\r\n \nhttp://www.picturescream.com/x/clean/GBYg\r\n\r\n\r\nVideos Info:\r\n~~~~~~~~~~~~\r\nSize: 4.279 GB\r\nResolution: 854x480","torrent":{"xt":"urn:btih:2e28a9ca6f2d8c44b089853a14bbc39ff2d662e7","amp;dn":"Bobbi+Starr%27s+SPIT+%28Split+Scenes%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e28a9ca6f2d8c44b089853a14bbc39ff2d662e7","infoHashBuffer":{"type":"Buffer","data":[46,40,169,202,111,45,140,68,176,137,133,58,20,187,195,159,242,214,98,231]},"announce":[],"urlList":[]}}