{"title":"RPG Tycoon version 0.11.0.2 repack Mr DJ","uid":12925175,"size":121881235,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2f67e47a5c82064ad6eccf1394c404a08f8a6253&amp;dn=RPG+Tycoon+version+0.11.0.2+repack+Mr+DJ&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rock840","files":2,"time":1449459444,"description":"Title: RPG Tycoon\r\n Version: \r\n Genre: Adventure, Indie, RPG, Simulation, Strategy, Early Access\r\n Developer: Skatanic Studios \r\n Publisher: GSProductions Ltd. \r\n Release Date: 5 Aug, 2014\r\n Language: English \r\n\r\nRPG Tycoon is a simulation game that puts you in control of a newly established RPG kingdom. Start small, with just a simple space to begin with, convince heroes to work for you then build, expand and continue to grow your kingdom as your Heroes help surrounding settlements and rid the world of the evil that it contains. It is your challenge to use all of the resources available to you to attract adventurers into your kingdom and grow its fame in order to become the greatest kingdom in the land! \r\n\r\n Inspired by some of the classic tycoon games many of us grew up playing, RPG Tycoon aims to create a familiar yet original experience for players of all ages. Giving you the freedom to develop your kingdom how you please... You can focus on questing, aiming to hire as many heroes as you can, levelling them and training them to be the best heroes in the land by sending them on quests, forcing them to complete bounties and slay villains or you can build and grow, turning your kingdom into a tourist empire with shops and facilities milking every last bit of gold from the adventurers you're attracting... Or you can settle somewhere in between. It's up to you, it's your kingdom. \r\n\r\n Current features: \r\n Start small and slowly expand your kingdom size with gold \r\n Hire heroes and send them on quests to earn gold and followers \r\n Gain followers and level up your Kingdom \r\n Unlock new buildings, features and abilities with each level \r\n Build buildings and decorations to grow your kingdom \r\n Attract adventurers and earn gold from your buildings \r\n Compete with other AI kingdoms in the land. \r\n Choose your play duration and difficulty \r\n Get scored on how you play at the end of each game. \r\n Custom naming of Heroes and Buildings\r\n\r\n Completion roadmap:\r\n The game is about 60% complete. Most of the core systems are in place and the game is playable to completion with an endgame and scoring. There is still more work to be down however, including but not limited to: \r\n\r\n Improved Quest System \r\n Improved Kingdom AI System \r\n Improved Adventurer AI System \r\n More Heroes \r\n More Adventurers \r\n More Shops \r\n More Facilities \r\n More Research Options \r\n More Epic Quests \r\n More Quest Types \r\n More Easter Eggs \r\n Improved Building Management \r\n Improve Weapons &amp; Class Management \r\n Water Tiles / Buildings\r\n\r\n Since launch on early access in August, 2014 RPG Tycoon has grown exponentially (with 5 major updates so far) by using feedback from players to fix bugs, add new systems and improve existing ones. So why stop? There's still plenty more features to come to the game and each update hopes to continue using the great support and feedback from the community to finish developing this game on becoming another &quot;classic&quot; tycoon to add to the list.\r\n\r\n**INSTALL INSTRUCTIONS:\r\n\r\nOpen RPG Tycoon version 0.11.0.2.exe , wait for a bit for the self extractor to open, specify the directory where u want to extract the game folder, open the extracted folder and play.....\r\n OR\r\nExtract it yourself using 'WinRAR'\r\n\r\n Always open the game using run as administrator\r\n\r\nCheck my FB page for more :\r\nMr DJ repacks","torrent":{"xt":"urn:btih:2f67e47a5c82064ad6eccf1394c404a08f8a6253","amp;dn":"RPG+Tycoon+version+0.11.0.2+repack+Mr+DJ","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f67e47a5c82064ad6eccf1394c404a08f8a6253","infoHashBuffer":{"type":"Buffer","data":[47,103,228,122,92,130,6,74,214,236,207,19,148,196,4,160,143,138,98,83]},"announce":[],"urlList":[]}}