{"title":"Rigmar Radio Karaoke Collection 10250","uid":12952463,"size":1421994300,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3188e0e5dfded414f72fb5a4a4e4dd1cc3b6e918&amp;dn=Rigmar+Radio+Karaoke+Collection+10250&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rigmar_radio","files":500,"time":1449746264,"description":"A HUGE THANK YOU goes out to all the people who seed after downloading this series.  Please stop seeding however when you download the next part as we need your upload speed for that swarm while you download.\r\n\r\nYou also of course get a much faster download by only running that one active torrent.\r\n\r\nLarger sized torrents are easier to keep active, and it has been suggested to me that I make a 100 Gigabyte torrent with many thousands of songs in it which will force those who hit and run (Yes you know who you are) to seed to the swarm for longer as they download.\r\n\r\nOR are you happy with the 250 songs a go size which averages out at 1.4GB at the moment?  You can contact me at    or on KAT PM me.\r\n\r\nUn enorme agradecimiento va a todos las personas que siembran después de descargar esta serie. Por favor, dejen de sembrar sin embargo cuando se descarga la siguiente parte, ya que necesitamos la velocidad de subida para ese enjambre mientras descargas.\r\n\r\nTambién, por supuesto, obtener una descarga mucho más rápido sólo por correr que un torrente activo.\r\n\r\nTorrentes de mayor tamaño son más fáciles de mantenerse activo, y se ha sugerido a mí que hago un torrente 100 Gigabyte con muchos miles de canciones en que lo que obligará a los que Hit and Run (Sí sabes quién eres) a las semillas a la pulular por más tiempo, ya que descarga.\r\n\r\nO ¿estás contento con las 250 canciones de un tamaño que promedia en 1,4 GB en el momento ir? Puedes contactar conmigo en    o en KAT PM mí.\r\n\r\nUn grand merci va à toutes les personnes qui postérité après le téléchargement de cette série. S'il vous plaît arrêter l'ensemencement mais lorsque vous téléchargez la prochaine partie que nous avons besoin de votre vitesse de téléchargement pour cet essaim pendant que vous téléchargez.\r\n\r\nVous aussi, bien sûr obtenir un téléchargement beaucoup plus rapide que par suite, l'un torrent actif.\r\n\r\nTorrents de plus grande taille sont plus faciles à rester actif, et il a été suggéré pour moi que je fais un torrent de 100 Gigabyte avec plusieurs milliers de chansons dans ce qui va forcer ceux qui Hit and Run (Oui, vous savez qui vous êtes) pour ensemencer la essaimer plus longtemps car ils télécharger.\r\n\r\nOu êtes-vous heureux avec les 250 chansons d'une taille de go ce qui équivaut en moyenne à 1,4 Go pour le moment? Vous pouvez me contacter à    ou KAT PM me","torrent":{"xt":"urn:btih:3188e0e5dfded414f72fb5a4a4e4dd1cc3b6e918","amp;dn":"Rigmar+Radio+Karaoke+Collection+10250","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3188e0e5dfded414f72fb5a4a4e4dd1cc3b6e918","infoHashBuffer":{"type":"Buffer","data":[49,136,224,229,223,222,212,20,247,47,181,164,164,228,221,28,195,182,233,24]},"announce":[],"urlList":[]}}