{"title":"Ukrainian Ninja","uid":12786749,"size":2297524600,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:31bd6af247dc8090b619be545b174c42f5225c24&amp;dn=Ukrainian+Ninja&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dauphong","files":1,"time":1447873318,"description":"About This Game\r\nUkrainian Ninja is a multiplayer platformer game for Windows. The Ninja shoots and slashes, using weapons sold by the trader to clear each world. Jump, scale and fight like a ninja as you battle it out with multiple enemies and bosses. The Trader has weapons to help you such as miniguns, rocket launchers, assault rifles, and even the classic ninja star. Each World ends with a special Boss fight as a final hurdle, and then there are bonus rounds at the end.\r\n\r\n- 8 Worlds to liberate\r\n- 24 challenge bonus rounds\r\n- Coop / Multiplayer Support (up to 16 players if wanted)\r\n- Dedicated Server Availability\r\n- Gamepad support\r\n\r\nThis is our 1st game as a team, and we hope you enjoy. We have taken all complaints and improved the game with them. If you have any issues or complaints, PM one of us and we see what we can do. :)\r\n\r\nABOUT OUR TEAM\r\n\r\nWe are a group of friends that decided to make a game together, we have been modding for years before that for other games. We all come from pretty much the same game, and joined up to make this game, and support the Ukraine. We decided the name of the game because ninja's are cool, and we had a couple Ukraine's in the group (At the time, they have now since been busy with their lives over the time of development, and our team has shrunk.) However we press on, and have completed our 1st game. We are a team of 4 main members, that are working our best to provied the best entertainment for price. We hope you enjoy our game, and any questions can ask us anytime, we are really friendly :)","torrent":{"xt":"urn:btih:31bd6af247dc8090b619be545b174c42f5225c24","amp;dn":"Ukrainian+Ninja","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31bd6af247dc8090b619be545b174c42f5225c24","infoHashBuffer":{"type":"Buffer","data":[49,189,106,242,71,220,128,144,182,25,190,84,91,23,76,66,245,34,92,36]},"announce":[],"urlList":[]}}