{"title":"Seeing Like a Rover (2015).pdf Gooner","uid":12710842,"size":5464613,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35890f714103a85ac976e150fa4bfb8b957e9803&amp;dn=Seeing+Like+a+Rover+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1446892511,"description":"Seeing Like a Rover - How Robots, Teams and Images Craft Knowledge of Mars (2015).pdf Gooner\r\n\r\nPublisher: University Of Chicago Press (April 22, 2015)\r\nLanguage: English\r\nISBN-10: 022615596X\r\nISBN-13: 978-0226155968\r\n\r\nIn the years since the Mars Exploration Rover Spirit and Opportunity first began transmitting images from the surface of Mars, we have become familiar with the harsh, rocky, rusty-red Martian landscape. But those images are much less straightforward than they may seem to a layperson: each one is the result of a complicated set of decisions and processes involving the large team behind the Rovers.\r\n\r\nWith Seeing Like a Rover, Janet Vertesi takes us behind the scenes to reveal the work that goes into creating our knowledge of Mars. Every photograph that the Rovers take, she shows, must be processed, manipulated, and interpreted—and all that comes after team members negotiate with each other about what they should even be taking photographs of in the first place. Vertesi’s account of the inspiringly successful Rover project reveals science in action, a world where digital processing uncovers scientific truths, where images are used to craft consensus, and where team members develop an uncanny intimacy with the sensory apparatus of a robot that is millions of miles away. Ultimately, Vertesi shows, every image taken by the Mars Rovers is not merely a picture of Mars—it’s a portrait of the whole Rover team, as well","torrent":{"xt":"urn:btih:35890f714103a85ac976e150fa4bfb8b957e9803","amp;dn":"Seeing+Like+a+Rover+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35890f714103a85ac976e150fa4bfb8b957e9803","infoHashBuffer":{"type":"Buffer","data":[53,137,15,113,65,3,168,90,201,118,225,80,250,75,251,139,149,126,152,3]},"announce":[],"urlList":[]}}