{"title":"Il Vendicatore Tossico (1984), [Divx - Ita Mp3] TNT Village","uid":12771689,"size":732686336,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:37e4674f31b703b35d8f6522f172882888211808&amp;dn=Il+Vendicatore+Tossico+%281984%29%2C+%5BDivx+-+Ita+Mp3%5D+TNT+Village&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ebasso","files":1,"time":1447685985,"description":".: Release Originale:.\r\n \nhttp://forum.tntvillage.scambioetico.org/index.php?showtopic=93337\r\n\r\n.: Copertina :.\r\n \nhttp://i.imgur.com/CjufIA8.jpg\r\n\r\n.: Trama :.\r\n\r\nl giovane Melvin Junko, imbranato sguattero della palestra di Tromaville, è il tipico nerd dall'aspetto poco piacevole, insicuro e impacciato, costantemente deriso e maltrattato, vittima della crudeltà dei teppisti che infestano la ridente cittadina. Finendo per errore in un bidone di rifiuti tossici, Melvin si trasformerà in Toxic Avenger, il Vendicatore Tossico: un energumeno tanto spaventoso e deforme, quanto votato al bene, che da subito si prodigherà nel ripulire Tromaville dalla criminalità, ergendosi a protettore dei cittadini e a paladino della giustizia. Diventerà presto un eroe e troverà persino l'amore in una ragazza cieca; ma l'inevitabile scontro con la corruzione di chi a Tromaville l'ha sempre fatta da padrone non tarderà ad arrivare. Per eliminare il Vendicatore Tossico e salvaguardare così i propri sporchi profitti, l'obeso sindaco Belgoody, coadiuvato da un capo delle forze di polizia con preoccupanti simpatie naziste, non esiterà a mettere addirittura l'esercito contro il beniamino di Tromaville.\r\nDiretto a quattro mani da Lloyd Kaufman e dal socio in affari Michael Herz, The Toxic Avenger rappresenta l'indimenticato atto di fondazione di Tromaville, la pellicola che ha lanciato su suolo americano la Troma (la casa di produzione indipendente ormai storica), che dopo un iniziale periodo all’insegna della sexy comedy, con il film in questione si specializza definitivamente nella produzione e distribuzione di splatter demenziali.\r\nUna pellicola all’insegna del politicamente scorretto, quando ancora non si parlava in questi termini, caratterizzata dalla libera e giocosa rappresentazione del sesso (anche se, come in tutti i film Troma, non si va oltre la visione di qualche tetta), della violenza (senza alcun limite di sorta: su bambini anziani o animali), dell’abuso di droghe, alcol e scurrilità; il tutto abilmente orchestrato in un delirante quadro di sana irriverenza, satira pungente e umorismo demenziale. Kaufman realizza il suo capolavoro: una favola nera, ecologista e, perchè no, anticapitalista, come veicolo per affermare in modo radicale la propria indipendenza. Il manifesto di un modo di intendere, ma soprattuto fare cinema diverso da quello hollywoodiano, quando non esplicitamente anti-hollywoodiano. Una produzione all'insegna del low budget, quindi all'insegna della più totale libertà creativa, in grado di dar spazio ad una feroce critica ai dettami dell'establishment, ad una sagace parodia dell'American way of life, allo sbeffeggiamento incondizionato, al tipico comportamento di chi non deve rendere conto di niente a nessuno. The Toxic Avenger rappresenta la fondazione e insieme la summa della cifra stilistica Troma, un concentrato di elementi e personaggi caratteristici, destinati a tornare nelle future pellicole targate Troma. Una sorta di film-manifesto dunque, diventato in breve tempo un oggetto di culto, che ha conferito alla casa di produzione di Herz e Kaufman un ruolo di rilievo nel panorama indipendente americano. Il &quot;Troma-style&quot; ha fatto proseliti in tutto il mondo ed il volto di Toxie è diventato il logo ufficiale della Troma, emblema di un cinema indipendente e irriverente, a volte decisamente trash a volte irresistibile, in ogni caso mai ruffianamente commerciale.\r\n\r\n.: Scheda Tecnica DivX :.\r\n\r\nDimensione:698 MB\r\nDurata: 1:27:36\r\nVideo Codec: Divx 5.0\r\nVideo Bitrate:979 Kb/s\r\nRisoluzione: 384x288 (1.33:1) [=4:3]\r\nFPS (Frames/sec):25.000\r\nQF (Frame quality): 0.354 bits/pixel\r\n\r\nAudio Codec: 0x0055(MP3) ID'd as MPEG-1 Layer 3\r\nAudio Bitrate:128 kb/s (64/ch, stereo) CBR\r\nFreq Audio:44100 Hz","torrent":{"xt":"urn:btih:37e4674f31b703b35d8f6522f172882888211808","amp;dn":"Il+Vendicatore+Tossico+%281984%29%2C+%5BDivx+-+Ita+Mp3%5D+TNT+Village","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37e4674f31b703b35d8f6522f172882888211808","infoHashBuffer":{"type":"Buffer","data":[55,228,103,79,49,183,3,179,93,143,101,34,241,114,136,40,136,33,24,8]},"announce":[],"urlList":[]}}