{"title":"High School Story v3.6.0 and mod","uid":13682341,"size":147227037,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:3a0ab4903f16436205563f072c5c15dcb26b32ef&amp;dn=High+School+Story+v3.6.0+and+mod&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tiropitaki","files":2,"time":1456491420,"description":"Live high school your way!\r\n\r\n- THROW PARTIES to unlock over 30 characters!\r\n- DATE your crush and play matchmaker for everyone at your school!\r\n- BATTLE a rival high school in an evolving story, including a showdown at the Homecoming game, a science fair, a prank war, and more!\r\n- PUT YOUR FRIENDS in the game and join them on adventures, dates, and parties!\r\n- MAKE NEW FRIENDS and play their stories!\r\n- BUILD your dream school and decorate it with everything from a half-pipe to a box of puppies!\r\n- CUSTOMIZE your look and choose your clique!\r\n- LEARN new vocabulary in fun mini-games!\r\n- ENJOY tons of new content every week, including more characters, more stories, and more romance!\r\n\r\nTo our players: Thank you for your passion. Pixelberry is a firm believer that games can make a difference. And you’ve proven they can.\r\n\r\nWhen we partnered with non-profits, like The Cybersmile Foundation, a cyberbullying non-profit, and the National Eating Disorders Association (NEDA) you responded with great enthusiasm. Together, we’ve done some amazing things.\r\n* Over 4 million players have learned more about cyberbullying.\r\n* Over 30,000 players have visited NEDA's sites to learn more about eating disorders.\r\n* And thousands of players have reached out to Cybersmile, often for help with bullying.\r\n\r\nThank you! We really, sincerely appreciate your enthusiasm and support.\r\n\r\n- The Pixelberry Team\r\n\r\nWhat's new:\r\nSpring is here! This month, discover nature with new Outdoor and Equestrian classmate types! Get to know the girl behind the mascot when you meet All-Star Ellie! And stay tuned for all-new quests!\r\nThen throw on new outfits, like &quot;Coming Up Roses&quot; for a comfy look, or ramp up your style with the Weekly Goals Exclusive outfit &quot;Ready to Rumble&quot;!\r\nWe hope you love this new spring update! If you do, let us know with a 5-star review. Thank you for playing!\r\nJessica\r\nLevel 8 Wallflower and Writer\r\n\r\nRequired Android O/S : 4.0+","torrent":{"xt":"urn:btih:3a0ab4903f16436205563f072c5c15dcb26b32ef","amp;dn":"High+School+Story+v3.6.0+and+mod","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a0ab4903f16436205563f072c5c15dcb26b32ef","infoHashBuffer":{"type":"Buffer","data":[58,10,180,144,63,22,67,98,5,86,63,7,44,92,21,220,178,107,50,239]},"announce":[],"urlList":[]}}