{"title":"Rigmar Radio Karaoke Collection 10750","uid":12958539,"size":1424712324,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:3b2055ccaec77acf9caa7aea32f8479fcc8ea5ba&amp;dn=Rigmar+Radio+Karaoke+Collection+10750&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rigmar_radio","files":500,"time":1449817687,"description":"I had attempted to make a larger 500 song torrent but could not upload it to the Pirate Bay, kept getting a code wrong error.   So we will leave the size as is with just 250 songs.\r\n\r\nCDG+MP3 KARAOKE painfully re tagged and renamed following industry conventions for Music Files to give good search results when selecting songs from a PC or MAC.\r\n\r\nIf you can not be bothered downloading this at decent speeds, please move on as BAD PEERS affect everyone in the swarm and no seed is going to wait for you over the weeks or even months it may take you to download the over 100,000 files and the 300 Gigabytes which make up this collection..   BAD DOWNLOAD SPEEDS are often YOUR FAULT.  Please lean how to torrent if this sounds like your problem.\r\n\r\nYo había tratado de hacer un mayor torrente de 500 canciones, pero no pude subirlo a The Pirate Bay, seguí recibiendo un error de mal código. Así que vamos a dejar el tamaño que es con sólo 250 canciones.\r\n\r\nCDG + MP3 KARAOKE dolorosamente re etiquetado y rebautizado después de convenciones de la industria para los archivos de música para dar buenos resultados de la búsqueda al seleccionar las canciones desde un PC o MAC.\r\n\r\nSi usted no puede ser molestado descargan a una velocidad decente, por favor, seguir adelante como COMPAÑEROS MALOS afectan a todos en el enjambre y sin semilla va a esperar a que durante las semanas o incluso meses puede tomar usted para descargar los más de 100.000 archivos y la 300 Gigabytes que componen esta colección .. velocidades de descarga MALOS suelen ser tu culpa. Por favor, apoye la forma de torrent si esto suena como su problema.\r\n\r\nJe l'avais tenté de faire une plus grande chanson 500 torrent mais n'a pas pu le télécharger sur le Pirate Bay, continué à obtenir une fausse erreur de code. Donc, nous allons laisser la taille est que, avec seulement 250 chansons.\r\n\r\nCDG + MP3 KARAOKE douloureusement re étiqueté et rebaptisé suivant les conventions de l'industrie pour les fichiers de musique pour donner de bons résultats de recherche lors de la sélection des chansons à partir d'un PC ou MAC.\r\n\r\nSi vous ne pouvez pas être dérangé téléchargez ce à des vitesses décentes, s'il vous plaît passer comme des pairs BAD affectent tout le monde dans l'essaim et aucune semence va vous attendre au cours des semaines ou même des mois il peut vous prendre pour télécharger les plus de 100.000 fichiers et de la 300 gigaoctets qui composent cette collection .. BAD vitesses de téléchargement sont souvent de votre faute. S'il vous plaît se pencher comment torrent si cela ressemble à votre problème","torrent":{"xt":"urn:btih:3b2055ccaec77acf9caa7aea32f8479fcc8ea5ba","amp;dn":"Rigmar+Radio+Karaoke+Collection+10750","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b2055ccaec77acf9caa7aea32f8479fcc8ea5ba","infoHashBuffer":{"type":"Buffer","data":[59,32,85,204,174,199,122,207,156,170,122,234,50,248,71,159,204,142,165,186]},"announce":[],"urlList":[]}}