{"title":"Hogtied--HT-39062 Lorelei Lee and The Pope Hi HD","uid":12700507,"size":2328403930,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3b344a9f32b667136a0451f6d5015f339b797481&amp;dn=Hogtied--HT-39062+Lorelei+Lee+and+The+Pope+Hi+HD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"merzedes","files":2,"time":1446767919,"description":"Lorelei Lee Submits in Brutal Bondage with Grueling Torment!!!\r\n\r\nNov 5, 2015 - Performers: Lorelei Lee  and  The Pope \r\n \r\n\r\nHi and HD MP4.\r\n\r\n\r\nLorelei is back and holy shit does she look fucking amazing. Her flowing blonde hair, her natural body with a great ass and amazing tits inspire me to do things to her; very bad things. We begin with her standing with her legs spread. I want to be close to her so I can hear her scream. I want to feel her push that glorious ass back when my hand wraps around her throat. \r\n\r\nNext she is in a very compact predicament tie on a box. Her body contorted just enough to cause a little added stress to her muscles, yet display all of the good parts at once. Her feet are destroyed with a full assault from bands to canes and I don't stop until I have to. \r\n\r\nNext she is put in a side suspension with one of her legs pulled high to ensure I get full access to her pussy, or as I like to call it, the honey hole. Her milky white skin is quickly turned a bright red from the cat of nine assaulting her flesh. Her pussy is then stuffed full with a big dildo and she is fucked and made to cum with little concern for her liking it or not.\r\n\r\nFor the finale Lorelei is on her back and spread as wide as I can get her. Her nipples get brutalized with clamps and added weights. A butt plug is shoved in her tight ass and then her pussy fucked again. Every orgasm she has makes her toes curl which pulls on her nipples and yet she begs to have another orgasm.\r\n\r\nScreens \nhttp://www.hogtied.com/site/shoot.jsp?shootId=39062\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n19 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\r\n\r\nJust keep on leaving us the nice comments below and we are happy :)\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:3b344a9f32b667136a0451f6d5015f339b797481","amp;dn":"Hogtied--HT-39062+Lorelei+Lee+and+The+Pope+Hi+HD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b344a9f32b667136a0451f6d5015f339b797481","infoHashBuffer":{"type":"Buffer","data":[59,52,74,159,50,182,103,19,106,4,81,246,213,1,95,51,155,121,116,129]},"announce":[],"urlList":[]}}