{"title":"Four.Corners.Bringing.The.War.Home.PTSD.288p.LDTV.WEBRIP.[MPup]","uid":12978470,"size":161430335,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3d34dc430d35cdcccf43819c1bc187242eac35e7&amp;dn=Four.Corners.Bringing.The.War.Home.PTSD.288p.LDTV.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":1,"time":1450010780,"description":"Four.Corners.2015.03.09.Bringing.The.War.Home.PTSD.288p.LDTV.WEBRIP.[MPup]\r\nLow-Definition Television (LDTV) ABC iview WEBRIP: 640x360\r\n\r\nFormat: MPEG-4\r\nSize: 512x288 (with vertical black bars)\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 44.1 KHz\r\n\r\n\r\nAs Australia prepares to send more troops to the Middle East, there's a simple question. Are we doing enough to look after the people who have already served their country?\r\n\r\nForty-one soldiers died in Afghanistan. Hundreds more were physically injured. But thousands carry invisible wounds.\r\n\r\n[img]http://extraimago.com/images/2015/12/13/a76e6a0c7bbea1f7378818a5b1de75f3.jpg[/img]\r\n\r\nPTSD, is a commonly used term, but what does it really mean? This week Four Corners reporter Quentin McDermott tracks former soldiers locked in a life and death battle with a ruthless but silent foe. For the first time, cameras are allowed inside gruelling therapy sessions as men, who gave so much for their country, fight a new enemy and try to deal with their illness.\r\n\r\nLee is not an old man but he has lived a dozen lifetimes in the war in Afghanistan, culminating in a horrific experience riding inside a vehicle hit by an explosive device:\r\n\r\n&quot;My first thought was that, you know, like, someone's been hit. You could hear people screaming at the driver and I turned and it seemed obvious to me that the driver was dead. After the explosion the guys are yelling at me, yelling out to me 'cause they thought I was dead.&quot;\r\n\r\nExperiences like this sent Lee into a terrible downward spiral, a classic case of PTSD. As one medical expert explains:\r\n\r\n&quot;The system that turns into PTSD is the system you need to do your job, because it is the system that allows you to be prepared for danger... now for some reason, and we don't know why, the system gets locked, locked on, and it doesn't shut down when the danger goes away. We want to shut it down. It doesn't need to be turned on.&quot;\r\n\r\nThe result of this system malfunction might vary, but in Lee's case it meant depression, anger, relationship breakdown and ultimately homelessness.\r\n\r\nLee must now run the gauntlet of intense therapy to try and cure his PTSD. The sessions involve him reliving his war experiences in intricate detail.\r\n\r\nLee is not alone in his trauma. Across Australia it's estimated hundreds, perhaps thousands, of veterans are dealing with some form of mental illness, brought on by their service. Lee is getting help. Many are being left to fend for themselves. Reporter Quentin McDermott hears how the Defence Force often doesn't diagnose their illness. He hears how the armed services, in which they served so proudly, do not always follow through with help once soldiers have left the ranks, and how the bureaucratic processes of the Department of Veterans' Affairs can drive some to despair.\r\n\r\n&quot;There is no idea how many are suffering. And that's going to continue until the Army realises or accepts the fact that this is real, this is what happens. This is just the tip of the iceberg.&quot; - Father of a veteran who took his life","torrent":{"xt":"urn:btih:3d34dc430d35cdcccf43819c1bc187242eac35e7","amp;dn":"Four.Corners.Bringing.The.War.Home.PTSD.288p.LDTV.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d34dc430d35cdcccf43819c1bc187242eac35e7","infoHashBuffer":{"type":"Buffer","data":[61,52,220,67,13,53,205,204,207,67,129,156,27,193,135,36,46,172,53,231]},"announce":[],"urlList":[]}}