{"title":"Corgi Warlock","uid":12922112,"size":102266968,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:42796423d470b13d73ef7dbaa58521678a553a31&amp;dn=Corgi+Warlock&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dauphong","files":1,"time":1449427211,"description":"If that sentence isn't enough for you to buy this game, I don't know what is. But if not… read on.\r\n\r\nCORGI WARLOCK – Maia, the great Corgi Warlock, sets out on a quest to defeat the EVIL BUNNY KING and his army of undead, strange, and pointy-object wielding minions. Based on a true story*, follow the exploits of Maia as she battles nefarious creatures of the BUNNY ARMY with her magic. Just a couple of the dangerous foes Maia will face include Narwhals throwing their horns (Warning: Narwhal horns are quite stabby.), Sheep with Torches (Warning: Sheep are flammable. Don't try this at home.), Salamander Rogues (Warning: All Salamanders are rogues.), and 67 other adorable yet deadly enemies.\r\n\r\nIf Maia can't do it alone, she can team up with her pals The Prophet Pig-J (Origin: The Sties of the Undershire) , The Magic Pug (Origin: Unknown), and the Fish Mage (Origin: The Ocean). With their powers combined not even the dreaded Bunny King himself will stand in their path... Or so they hope.\r\n\r\nCORGI WARLOCK also features a 1-4 player vs. Battle Mode, for when you need to determine who does the dishes or if a Pug really is better than a Corgi.\r\n\r\nAbout the creator:\r\nXander's Corgi Arcade is a one man shop, started by a former PIXAR, Dreamworks, and Sony animator, who decided to take a break and work on his own games for a while. His super amazing corgi, Maia, was the inspiration for it","torrent":{"xt":"urn:btih:42796423d470b13d73ef7dbaa58521678a553a31","amp;dn":"Corgi+Warlock","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42796423d470b13d73ef7dbaa58521678a553a31","infoHashBuffer":{"type":"Buffer","data":[66,121,100,35,212,112,177,61,115,239,125,186,165,133,33,103,138,85,58,49]},"announce":[],"urlList":[]}}