{"title":"The Bible Series 2 - The Story of David","uid":12780764,"size":2853417452,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4518cae16367e0bed89461746065d5bc651de643&amp;dn=The+Bible+Series+2+-+The+Story+of+David&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":9,"time":1447789347,"description":"The Bible Series - The Story of David\r\n\r\nDescription\r\n\r\n\r\nUntold millions have sought solace and comfort from the Psalms through the ages. Of course there's probably nothing quite so comforting as being plucked from obscurity to lead your people, not to mention smiting a giant, something the Psalms' supposed author, David, experienced. This 1976 television movie following David's life from his young shepherding years through his death is highlighted by a less glossy sheen (a lot less glossy sheen, more about which later) than most Hollywood Bible epics, while it also suffers from that same &quot;television-itis,&quot; a small scale feel that hinders its larger ambitions. Whether you as an individual viewer derive comfort or annoyance from The Story of David is probably therefore predicated on how you react to sometimes laughable production values, even as they surround a fair degree of intelligent writing and characterization.\r\n\r\nOne of the more famously laughable moments in Hollywood's Biblical oeuvre is Victor Mature's hilarious &quot;fight&quot; with the stuffed lion in Samson and Delilah. Well there's a runner up in the Israel and Spain filmed Story of David. In the opening sequence, a lion is about to prey on one of David's beloved sheep (a black sheep, no less). David hauls out his trusty slingshot and hurls a rock toward the beast, seen only in stock footage, of course. We hear the squeal of the animal, and then it cuts to a laugh out loud &quot;dead&quot; lion made of plaster of paris or somesuch material, looking absolutely nothing like the animal we've just seen. It's moments like these, sprinkled throughout David's three hour running time, that may make some viewers approach the telefilm as high camp, rather than a heartfelt exploration of the character of one of history's great icons","torrent":{"xt":"urn:btih:4518cae16367e0bed89461746065d5bc651de643","amp;dn":"The+Bible+Series+2+-+The+Story+of+David","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4518cae16367e0bed89461746065d5bc651de643","infoHashBuffer":{"type":"Buffer","data":[69,24,202,225,99,103,224,190,216,148,97,116,96,101,213,188,101,29,230,67]},"announce":[],"urlList":[]}}