{"title":"The.True.Story.s05e02.Platoon.360p.LDTV.WEBRIP.[MPup]","uid":12958525,"size":226455000,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:48cb4b52277b1955cc21c2b07d619da0db395e3e&amp;dn=The.True.Story.s05e02.Platoon.360p.LDTV.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":1,"time":1449816382,"description":"The.True.Story.s05e02.Platoon.360p.LDTV.WEBRIP.[MPup]\r\nLow-Definition Television (LDTV) ABC iview WEBRIP: 640x360\r\n[b]AKA The Real Story 2008[/b]\r\n\r\n[i]The True Story AU s05e02 Platoon 360p LDTV WEBRIP [MPup] AKA The Real Story US [2008][/i]\r\n\r\nFormat: MPEG-4\r\nSize: 640x360\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 44.1 KHz\r\n\r\nThe True Story looks at the real lives and true stories behind Hollywood blockbusters and this episode examines Oliver Stone’s Oscar-winning war movie, Platoon.\r\n\r\nPlatoon hit the silver screen in 1986 on a small budget with a cast of then unknown actors but gained worldwide acclaim for its gritty portrayal of the horrors of the Vietnam War.\r\n\r\nOliver Stone wanted Platoon to be the most realistic war movie of all time and it was based on his own experiences as a solider in the conflict. But how much of it was real and how much was adapted for Hollywood fiction?\r\n\r\nPlatoon tells the story of idealistic new recruit Chris Taylor (played by Charlie Sheen) as he embarks on his first tour of duty in the deadly, booby-trapped jungles of Vietnam. The movie sees Taylor’s patriotism crumble within days of joining a platoon of demoralized and battle weary soldiers as they fight a losing battle in one of the most controversial conflicts of the 20th Century.\r\n\r\nInterviewing the movie’s legendary writer and director, Oliver Stone, we discover the true story behind Platoon, uncovering the real life events behind the movie and revealing the identities of the soldiers Stone fought alongside, who he would later immortalize on the big screen. As well as also hearing from Vietnam veteran and former marine, Dale Dye, who Oliver Stone drafted in to be the film’s military adviser and learn just what the young actors were put through during a gruelling two week boot camp before filming began.\r\n\r\nHistorian Fabian Hilfrich also heads to the Vietnamese jungle where Stone was posted in 1967 to discover the real conditions the troops faced, the deadly booby traps that lay hidden all around and investigates the Viet Cong’s Deadly network of underground tunnels that feature prominently in one of the movies tensest scenes.\r\n\r\nWe also dissect Platoon’s climatic battle scene where US Troops bomb their own base in a desperate attempt to fend off an ambush. It was textbook Hollywood jeopardy, but it’s based on an actual event. We reunite Stone’s comrades who served alongside him that fearsome night, hearing from the man who ordered that napalm attack for real, and revealing exclusive recordings of the actual airstrike that was so famously mirrored in the movie","torrent":{"xt":"urn:btih:48cb4b52277b1955cc21c2b07d619da0db395e3e","amp;dn":"The.True.Story.s05e02.Platoon.360p.LDTV.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48cb4b52277b1955cc21c2b07d619da0db395e3e","infoHashBuffer":{"type":"Buffer","data":[72,203,75,82,39,123,25,85,204,33,194,176,125,97,157,160,219,57,94,62]},"announce":[],"urlList":[]}}