{"title":"Nubiles-Casting - Jaye Summers, Jessa Rhodes (Jessa Rhodes Cast","uid":12720738,"size":265067131,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:4a099c4c674589dc17dc676177cc5d1c740abcce&amp;dn=Nubiles-Casting+-+Jaye+Summers%2C+Jessa+Rhodes+%28Jessa+Rhodes+Cast+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxxlavalxxx","files":2,"time":1446993874,"description":"Sassy blonde Jessa Rhodes is ready to try her hand at interviewing for Nubiles with hottie Jaye Summers. The brunette coed is a bit shy at first, but Jessa soon draws her out of her shell and gets her to show off her small boobs and even her juicy landing strip pussy once her thong comes off. Jaye's many piercings from her nipples to her clit get Jessa totally turned on!When Jessa brings Ryan Driller onto the scene to move into the passion portion of the interview, Jaye prepares to do whatever it takes to prove that she's Nubiles material! From lovingly sucking on Ryan's cock both on her own and in tandem with the very horny Jessa to having her creamy fuck hole pounded while eating out Jessa's tender twat, Jaye proves that she is a sex fiend!Soon Jaye's interview turns into a wild threesome as Jaye and Jessa show Ryan all of their hottest moves while demanding the ultimate pleasure from him. The trio doesn't stop for anything until Jaye's final test when Ryan is about to cum. With a big smile, Jaye closes her eyes and moans happily when Ryan covers her face with his cum in a scorching facial that leaves her totally satisfied.\r\nTags: Brunette, Blonde, Long hair, Hardcore, Lesbian, High Heels, Petite, Girl-Girl-Boy, Blowjob, Facial, Casting\r\n \nhttp://imgdone.com/viewer.php?file=70341035217131364528.jpg\r\n \nhttp://imgdone.com/viewer.php?file=85114525723414405968.jpg","torrent":{"xt":"urn:btih:4a099c4c674589dc17dc676177cc5d1c740abcce","amp;dn":"Nubiles-Casting+-+Jaye+Summers%2C+Jessa+Rhodes+%28Jessa+Rhodes+Cast+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a099c4c674589dc17dc676177cc5d1c740abcce","infoHashBuffer":{"type":"Buffer","data":[74,9,156,76,103,69,137,220,23,220,103,97,119,204,93,28,116,10,188,206]},"announce":[],"urlList":[]}}