{"title":"EVERYTHING IS TERRIBLE! - DOGGIE WOGGIEZ! POOCHIE WOOCHIEZ!","uid":12675048,"size":3958664398,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4aa0df382108b291a26b6f4179db810421fa80cd&amp;dn=EVERYTHING+IS+TERRIBLE%21+-+DOGGIE+WOGGIEZ%21+POOCHIE+WOOCHIEZ%21&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":45,"time":1446496771,"description":"Surrender yourself to the Earth. Return what was loaned to you. Give up your pleasure, your pain, your friends, your lovers, your life, your past, your future... your dog! Everything Is Terrible!- the found-footage-collective-cult is back with an all new movie that FINALLY asks the question your mom and dad are too afraid to ask: &quot;Why not remake Alejandro Jodorowsky's 1973 classic The Holy Mountain' out of dog movies? Well, open your eyes, puppies! Its the third installment in EIT!'s mission to melt your mind! &quot;DoggieWoggiez! PoochieWoochiez!&quot; We have assembled a group of canines from the four corners of the Earth to represent all the dogs in Dogdom, and together they ascend the Holy Mountain to displace the immortal gods who secretly rule the universe! All your favorite dogs are together at last! Dumb dogs! Cool dogs! Sexy dogs! Ghost dogs! Mutant dogs! Pizza Dogs! Cyber dogs! Dogs that sing! Dogs that dance! Dogs that fuck! And dogs that will teach you what it means to be human again... for the first time. So throw your cat out the window, align your chakras, and dive through your dog's third eye as you receive your true essence, your new leash on life! Ruff! \r\n&quot;i used to think that everything was terrible, then I found 'Everything is Terrible!' Now I think everything is terrible EXCEPT 'Everything is Terrible!'&quot; - STEVE AGEE \r\n&quot;Everything is Terrible is definite proof that we as a species are devolving into mindless, media junkies -and I fucking love every single second of it.&quot; -ROB SCHRAB \r\n'The strangest, most mind-bending and disturbing footage imaginable.&quot; -AV CLUB \r\n`Better than accidentally smoking angel dust!&quot; -RICHARD METZGER, DANGEROUS MINDS.NET \r\n&quot;Terribly funny!' -WIRED","torrent":{"xt":"urn:btih:4aa0df382108b291a26b6f4179db810421fa80cd","amp;dn":"EVERYTHING+IS+TERRIBLE%21+-+DOGGIE+WOGGIEZ%21+POOCHIE+WOOCHIEZ%21","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aa0df382108b291a26b6f4179db810421fa80cd","infoHashBuffer":{"type":"Buffer","data":[74,160,223,56,33,8,178,145,162,107,111,65,121,219,129,4,33,250,128,205]},"announce":[],"urlList":[]}}