{"title":"HISTORY OF POP AND ROCK MUSIC - part 593","uid":12714312,"size":250087356,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:4aafa6908f81fa65ed289c250f94932d9abfda8b&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+593&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pupovaczlatko","files":7,"time":1446914160,"description":"\n                             PART  593\r\n\r\n\r\n\r\n\r\n             TRINI LOPEZ  -   America   (1962)\r\n             JOHNNY B. GREAT - If I Had A Hammer   (1964) \r\n\r\n\r\n\r\n\r\n                 Trinidad &quot;Trini&quot; Lopez III (born May 15, 1937) is an American singer, guitarist, and actor. He was born in Dallas, Texas, and grew up on Ashland Street in the Little Mexico neighborhood. His debut live album, Trini Lopez , was released in 1963. The album included a version of &quot;If I Had a Hammer&quot;, which reached number one in 36 countries (no. 3 in the United States), and was a radio favorite for many years. It sold over one million copies, and was awarded a gold disc. He also performed his own version of the traditional Mexican song &quot;La Bamba&quot; on the album; his recording of the tune was later reissued as a single in 1966. Another live album from PJ's was recorded later that same year under the title By Popular Demand More Trini Lopez at PJ's (R/RS 6103) which contains the song &quot;Green Green&quot; which was written by Randy Sparks and Barry McGuire and originally recorded by the New Christy Minstrels earlier that year for their Columbia album Ramblin.\r\n\r\n\r\n                &quot;If I Had a Hammer (The Hammer Song)&quot; is a song written by Pete Seeger and Lee Hays. It was written in 1949 in support of the progressive movement, and was first recorded by The Weavers, a folk music quartet composed of Seeger, Hays, Ronnie Gilbert and Fred Hellerman. It was a number 10 hit for Peter, Paul and Mary in 1962 and then went to number three a year later when recorded by Trini Lopez.\r\nJohnny Cash released the song on his album Any Old Wind That Blows in 1972. Also released as a single, the song hit number 29 on the US country chart. Sam Cooke recorded it on his 1964 live album Sam Cooke at the Copa and RCA Victor released it as a 45 single, in September, 1966. Aretha Franklin recorded the song on her Yeah! album","torrent":{"xt":"urn:btih:4aafa6908f81fa65ed289c250f94932d9abfda8b","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+593","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4aafa6908f81fa65ed289c250f94932d9abfda8b","infoHashBuffer":{"type":"Buffer","data":[74,175,166,144,143,129,250,101,237,40,156,37,15,148,147,45,154,191,218,139]},"announce":[],"urlList":[]}}