{"title":"Star.Wars.Droid.Tales.S01E05.HDTV.Subtitulado.Esp.SC.avi","uid":12684902,"size":165726620,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4f846f133937d88c88605c5b821b153fe781fb01&amp;dn=Star.Wars.Droid.Tales.S01E05.HDTV.Subtitulado.Esp.SC.avi&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"psmv","files":1,"time":1446588132,"description":"1x05 - Gambit on Geonosis\r\n\r\nLego Star Wars: Droid Tales is a five-part LEGO Star Wars mini-series that aired on Disney XD. The series tells the story of the six current live-action Star Wars films, from Star Wars: Episode I The Phantom Menace through Star Wars: Episode VI Return of the Jedi, from the perspectives of C-3PO and R2-D2.\r\n\r\nLego Star Wars: Droid Tales began shortly after the Battle of Endor. C-3PO and R2-D2 tell those assembled around them about the story that led them both to the battle. According to The Hollywood Reporter, &quot;an accidental kidnapping leads to a new adventure that progresses to the re-telling of the saga in the chronological order, starting from The Phantom Menace to Return of the Jedi.&quot;\r\n\r\nEsta serie será una oportunidad de recorrer la saga completa y el orden de sus episodios, pero con la historia vista a través de los ojos de los dos personajes que han estado ahí todo el tiempo: C-3PO y R2-D2.\r\n\r\nDespués de la celebración de la victoria en la aldea Ewok en Endor, vista en el cierre de El Regreso del Jedi, C-3PO y R2-D2 se han reunido para agasajar a Luke, Leia, Han, Chewbacca y los otros rebeldes con los cuentos de sus aventuras que llevaron a los acontecimientos de Star Wars: Episodio I - La Amenaza Fantasma.\r\n\r\nUn secuestro accidental se produce mientras los androides están recordando y de pronto los espectadores serán llevados en una nueva aventura que conduce a encuentros con caras conocidas y lugares que incitan a la renarración de toda la saga.\r\n\r\nLa serie ofrece todo el humor juguetón que los espectadores esperan de LEGO Star Wars","torrent":{"xt":"urn:btih:4f846f133937d88c88605c5b821b153fe781fb01","amp;dn":"Star.Wars.Droid.Tales.S01E05.HDTV.Subtitulado.Esp.SC.avi","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f846f133937d88c88605c5b821b153fe781fb01","infoHashBuffer":{"type":"Buffer","data":[79,132,111,19,57,55,216,140,136,96,92,91,130,27,21,63,231,129,251,1]},"announce":[],"urlList":[]}}