{"title":"Like Family by Paolo Giordano","uid":12910118,"size":1263359,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4fc48d45b644878e92fa76d2abef5ac9aac758c6&amp;dn=Like+Family+by+Paolo+Giordano&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TopShelfBook","files":4,"time":1449288194,"description":"Like Family by Paolo Giordano\r\n\r\n\r\nFrom the author of the international bestseller The Solitude of Prime Numbers, an exquisite portrait of marriage, adulthood, and the meaning of family\r\n \r\nPaolo Giordano’s prizewinning debut novel, The Solitude of Prime Numbers, catapulted the young Italian author into the literary spotlight. His new novel features his trademark character-driven narrative and intimate domestic setting that first made him an international sensation.\r\n \r\nWhen Mrs. A. first enters the narrator’s home, his wife, Nora, is experiencing a difficult pregnancy. First as their maid and nanny, then their confidante, this older woman begins to help her employers negotiate married life, quickly becoming the glue in their small household. She is the steady, maternal influence for both husband and wife, and their son, Emanuele, whom she protects from his parents’ expectations and disappointments. But the family’s delicate fabric comes undone when Mrs. A. is diagnosed with cancer. Moving seamlessly between the past and present, Giordano highlights with remarkable precision the joy of youth and the fleeting nature of time. An elegiac, heartrending, and deeply personal portrait of marriage and the people we choose to call family, this is a jewel of a novel—short, intense, and unforgettable.  \r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:4fc48d45b644878e92fa76d2abef5ac9aac758c6","amp;dn":"Like+Family+by+Paolo+Giordano","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fc48d45b644878e92fa76d2abef5ac9aac758c6","infoHashBuffer":{"type":"Buffer","data":[79,196,141,69,182,68,135,142,146,250,118,210,171,239,90,201,170,199,88,198]},"announce":[],"urlList":[]}}