{"title":"Air Explorer Pro 1.4.1 + Crack","uid":12950529,"size":4154494,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4ff4fc093489b52886c3525a68981d2c5f2681c2&amp;dn=Air+Explorer+Pro+1.4.1+%2B+Crack&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubberboy37","files":1,"time":1449720493,"description":"Air Explorer supports the best cloud servers:\r\n\r\n- OneDrive\r\n- Google Drive\r\n- 4Shared\r\n- Box\r\n- Dropbox\r\n- Mega\r\n- Copy\r\n\r\nThere are a lot of people who like to backup their most valuable documents on cloud servers, protected by a custom username and password. However, when you want to move or copy a file from one account to the other, you need to first login to the first account, download the file to your PC, then login to the second one and upload it. You can simplify this task by using Air Explorer, an app that allows you to brose through the data you store on several cloud servers with ease.\r\n\r\n\r\nStraightforward looks and neathy organized tabs. Air Explorer comes with a user-friendly GUI (Graphical User Interface) that makes it easy even for beginners to enter their credentials and connect their online account to this app.\r\n\r\n\r\nIn addition to exploring the files you store on your cloud servers, you can also search for a certasin file throughout all your connecrted accounts within a dedicated tab, while another one allows you to synchronize two accounts.\r\n\r\n\r\nBrowse data stored on Dropbox, Mega, OneDrive, Google Drive and others in order to enjoy the functions of Air Explorer, you first need to connect the servers you regularly use to the app. More precisely, you can specify the username and password for one or several accounts, then download or upload files without any hassle.\r\n\r\nAir Explorer supports a wide range of services, such as Dropbox, Box, Google Drive, OneDrive, Mega, Mediafire, WebDAV and Yandex, and the login process is as straightforward as possible: enter the username and password, and you are done.\r\n\r\n\r\nMove files between accounts or encrypt all uploads. Due to Air Explorer, you can easily copy or move documents from one account to the one, with only a few mouse clicks. You can browse data in a two panel mode, so you can easily select one or more files that you want to transfer.\r\n\r\n\r\nMoroever: Air Explorer can also help you protect the security of your daTA BY ENCRYPTING ALL THE FILES YOU UPLOAD TO THE CLOUD. iT GOES WITHOUT SAYING THAT YOU NEED TO REMEMBER THE PASSWORD YOU USE, OTHERWISE YIOU WILL NOT BE ABLE to access the files afterwards.\r\n\r\n\r\nAll in all, the application is a nifty app that can help you save a lot of time when it comes to brosing files you store in cloud accounts, as well as transfer them or sync local folders to online ones.\r\n\r\n\r\nWhats new:\r\n\r\n- Fioxed issue Adrive accounts\r\n- Fixed issue with total speeds\r\n- Updated Japanese translation","torrent":{"xt":"urn:btih:4ff4fc093489b52886c3525a68981d2c5f2681c2","amp;dn":"Air+Explorer+Pro+1.4.1+%2B+Crack","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ff4fc093489b52886c3525a68981d2c5f2681c2","infoHashBuffer":{"type":"Buffer","data":[79,244,252,9,52,137,181,40,134,195,82,90,104,152,29,44,95,38,129,194]},"announce":[],"urlList":[]}}