{"title":"WKRP in Cincinnati","uid":13680377,"size":15277613920,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:516ba2bfd41166ad0f87af438ea689ba22647928&amp;dn=WKRP+in+Cincinnati&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"7436746","files":93,"time":1456456032,"description":"http://www.imdb.com/title/tt0077097/\r\n\r\nThe staff of a struggling radio station have a chance at success after the new programming director changes the format to rock music.\r\n \nhttp://www.wikiwand.com/en/WKRP_in_Cincinnati\r\n\r\nWKRP in Cincinnati is an American sitcom that featured the misadventures of the staff of a struggling fictional radio station in Cincinnati, Ohio. The show was created by Hugh Wilson and was based upon his experiences working in advertising sales at Top 40 radio station WQXI (AM) in Atlanta. Many of the characters and even some of the stories (including season 1 episode 7, &quot;Turkeys Away&quot;) are based on people and events at WQXI.[1]\r\n\r\nThe ensemble cast consists of Gary Sandy, Howard Hesseman, Gordon Jump, Loni Anderson, Tim Reid, Jan Smithers, Richard Sanders and Frank Bonner.[2]\r\n\r\nLike many other MTM productions, the humor came more from running gags based on the known predilections and quirks of each character, rather than from outlandish plots or racy situations,[citation needed] since the show has a realistic setting. The characters also developed somewhat over the course of the series.\r\n\r\nThe series won a Humanitas Prize and received 10 Emmy Award nominations, including three for Outstanding Comedy Series. Andy Ackerman won an Emmy Award for Videotape Editing in season 3.\r\n\r\nWKRP premiered September 18, 1978 on the CBS television network, and aired for four seasons and 88 episodes through April 21, 1982. During the third and fourth seasons, CBS repeatedly moved the show around its schedule, contributing to lower ratings and its eventual cancellation.\r\n\r\nWhen WKRP went into syndication, it became an unexpected success, despite not reaching the desired number of 100 episodes for daily stripping.[3] (90 half-hour episodes were available for syndication, due to two of the first-run 88 episodes being an hour long.) For the next decade, it was one of the most popular sitcoms in syndication, outperforming many programs which had been more successful in prime time, including all the other MTM Enterprises sitcoms.\r\n\r\nJump, Sanders, and Bonner reprised their roles, appearing as regular characters in a spin-off/sequel series, The New WKRP in Cincinnati, which ran from 1991 to 1993 in syndication. Hesseman, Reid and Anderson also reprised their roles on this show as guest stars.\r\n\r\nPremise\r\nThe station's new program director Andy Travis tries to turn around struggling full-service radio station WKRP by switching its format from 1950s and '60s easy listening music to Rock and Roll, despite the well-meaning efforts of the mostly incompetent staff: bumbling station manager Arthur Carlson, greasy sales manager Herb Tarlek, and clueless news director Les Nessman. Rounding out the cast are super receptionist Jennifer Marlowe, enthusiastic junior employee Bailey Quarters, and spaced-out veteran disc jockey Dr. Johnny Fever. To help bolster ratings, Travis hires a new disc jockey from New Orleans, Venus Flytrap. Lurking in the background and making an occasional appearance is ruthless business tycoon Mrs. Carlson, the station's owner and the mother of Arthur Carlson","torrent":{"xt":"urn:btih:516ba2bfd41166ad0f87af438ea689ba22647928","amp;dn":"WKRP+in+Cincinnati","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"516ba2bfd41166ad0f87af438ea689ba22647928","infoHashBuffer":{"type":"Buffer","data":[81,107,162,191,212,17,102,173,15,135,175,67,142,166,137,186,34,100,121,40]},"announce":[],"urlList":[]}}