{"title":"Four.Corners.Being.Me.Transgender.Stories.288p.WEBRIP.[MPup]","uid":12978484,"size":160139134,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:51af521548fdc51ea0eb7a1a1f458dd0a52d68ab&amp;dn=Four.Corners.Being.Me.Transgender.Stories.288p.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"makinapufterpup","files":1,"time":1450011493,"description":"Four.Corners.2014.11.17.Being.Me.Transgender.Stories.288p.LDTV.WEBRIP.[MPup]\r\nLow-Definition Television (LDTV) ABC iview WEBRIP: 640x360\r\n\r\nFormat: MPEG-4\r\nSize: 512x288 (with vertical black bars)\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 44.1 KHz\r\n\r\nThere are any number of self help books that will tell you how to find yourself.\r\n\r\nBut what if truly being yourself involved changing your gender? Would you have the courage to do it?\r\n\r\n[img]http://extraimago.com/images/2015/12/13/39ed02c169f1b5849c803f6bf7567fb8.jpg[/img]\r\n\r\nEleven-year-old Isabelle does. To the world she looked like a young boy. But she knew that she was really a girl, and a year ago she told her parents the way she felt.\r\n\r\nThis week Four Corners reporter Janine Cohen tells Isabelle's story and the story of the family, the doctor and ultimately the community that backed her decision to truly be herself.\r\n\r\nAlong the way we meet other people who've confronted the same feelings and discover that a growing and significant number of children are finding themselves in the same situation. Some find support from their parents and doctors. Others discover fear, prejudice and a legal system that doesn't make it easy for them to be themselves.\r\n\r\nFor Isabelle, the decision to tell her story was not made lightly. She and her parents tell Four Corners that they are willing to speak about their experience so that others won't feel alone and other transgender children can be helped and protected.\r\n\r\nDoctors tell the program that trying to repress the feeling that you are trapped in the wrong body simply does not work. Instead, it can lead to self harm and even suicide.\r\n\r\nPaediatricians also make it clear that timing is important. They explain that if children want to make a physical change, then treatment should begin at puberty. In that way, hormone treatments can be prescribed with far better results.\r\n\r\nA senior judge tells Four Corners she is keen to see the law relating to transgender treatment tested sooner rather than later.\r\n\r\nMeanwhile, doctors and families warn the current legal situation is putting some children at risk.\r\n\r\nIsabelle's story is remarkable and inevitably raises many questions for families, doctors and society in general. Ultimately though, it's a journey that shows courage and honesty is essential to triumph over ignorance. It's a story that is not to be missed","torrent":{"xt":"urn:btih:51af521548fdc51ea0eb7a1a1f458dd0a52d68ab","amp;dn":"Four.Corners.Being.Me.Transgender.Stories.288p.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51af521548fdc51ea0eb7a1a1f458dd0a52d68ab","infoHashBuffer":{"type":"Buffer","data":[81,175,82,21,72,253,197,30,160,235,122,26,31,69,141,208,165,45,104,171]},"announce":[],"urlList":[]}}