{"title":"GTA 5 For PC (Grand Theft Auto V)","uid":12641177,"size":58021117952,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5454205d94143e5382e3e8f1c3c70f321a42a0cf&amp;dn=GTA+5+For+PC+%28Grand+Theft+Auto+V%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Dudester786","files":1,"time":1445995136,"description":"This a GTA 5 For Pc with instructions in disk 1!\r\n\r\nThis is a Multi Hybrid File so all you have to do is Mount the Whole file once and once mounted in the ISO You will see 6 Folders named Disk 1 to Disk 6 the setup file is inside Disk 1 There is also a Product key In the Text file names GTA 5 Product Key. Don't copy and paste the key you must type the key in by hand. Obviously GTA 5 Being a very high in demand game which is very popular you must have Very good specs so basic Laptops aren't Suitable as it will LAG A LOT. Unfortunately the game didn't work for me because my Specs are not the best or made for Gaming I only had 4GB of Ram Intel Pentium with Intel HD Graphics! You will probably have better specs than me there is a compatibility report inside so it will tell you what specs are required to run this game. This is a 54GB File which is Respectively Large after the Install it will be 65GB bare in mind The Download is 54GB and the Install is 65GB 119G altogether so I would recommend backing up the Download to an External drive or Online storage so that you don't waste Space on your pc there is no crack for this if you have any cracks please by all means Use them but please Do not redistribute this Torrent ANYWHERE if you do you will be Reported. Please seed as long as possible I understand its a big file but please try. Steps are Download this torrent and Mount the ISO File there is so Rar or Compressed ZIP this is for your assurance as people do upload files but are locked with passwords. So just double click to mount! If you are on Windows 7 then use a virtual Disk Image Mounter such as Slysoft Virtual Clone Drive. Just right click on the ISO and press Mount then open Disk 1 Folder and select Setup.\r\n\r\nThis is not Modified in anyway I did pay £40 for this in British Pounds so its $61 in America and 55 Euros!","torrent":{"xt":"urn:btih:5454205d94143e5382e3e8f1c3c70f321a42a0cf","amp;dn":"GTA+5+For+PC+%28Grand+Theft+Auto+V%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5454205d94143e5382e3e8f1c3c70f321a42a0cf","infoHashBuffer":{"type":"Buffer","data":[84,84,32,93,148,20,62,83,130,227,232,241,195,199,15,50,26,66,160,207]},"announce":[],"urlList":[]}}