{"title":"The Pirate Party UK 2015 Manifesto","uid":12786197,"size":2208202,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:55d5aed70b3c43355707afaae548d1823d85e162&amp;dn=The+Pirate+Party+UK+2015+Manifesto&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Spud17","files":5,"time":1447869349,"description":"Election time may have passed, but it's still worth reading The Pirate Party UK's 2015 manifesto for a rundown of policy. While this is available from their site, I thought I'd upload it for those outside the UK who find it difficult or impossible to access political party websites. \r\n\r\nfrom the website:\r\n\r\nPrinciples\r\n\r\nThe Pirate Party in the UK adopted a set of seven principles on which its policies are based or can be applied to any given position.  All the policies and ideas you see here, as well as the stances we take in our advocacy and local and national campaigning, come from those seven principles.\r\n \nhttps://www.pirateparty.org.uk/policy/our-principles/home\r\n\r\nOn Policy\r\n\r\nDemocracy is in crisis in the United Kingdom. Whether it is online or on the doorstep, people are telling us that they feel alienated, ignored, that they have given up voting as it changes nothing.\r\n\r\nIt's this sense of powerlessness over the forces that shape our lives and the space around us that is so worrying in the UK today. Creeping privatisation means all aspects of our society are being divided up and parcelled out. It can be impossible to find out who is responsible for the most basic aspects of our environment, public spaces and services, let alone get anyone to do anything about it.\r\n\r\nWe are constantly under surveillance, whether it is by Europe's biggest army of CCTV cameras or by companies like ATOS checking up on us. In a country of physical barriers, many find the online world a place to reclaim some freedom. But here too we are increasingly to be watched and restricted, while government and courts gather powers to disconnect us, block websites and monitor what we say and do.\r\n\r\nAt the heart of Pirate Party politics is the right for everyone to share knowledge and take an equal part in society. That is the way to take control over the world around us. That is what we are setting out here.\r\n\r\nThis document is the result of the input and debate of thousands of people. It's the UK's first crowd-sourced manifesto. We've always believed in a politics that is done with people not to people, this is what we have delivered here. The process has been exciting not just because it has been unique in British politics, but also because it has resulted in a manifesto that really does offer a chance to break the cycle of alienation and powerlessness.\r\n\r\nThe result is a broad range of principles, that our candidates will be proud to stand on.\r\n\r\nTable of contents:\r\n\r\n\r\n1 - NHS and Health\r\n2 - Welfare &amp; Work\r\n3 - Economy \r\n4 - Education and Innovation\r\n5 - Society\r\n6 - Environment &amp; Energy\r\n7 - Justice\r\n8 - Digital Rights &amp; Surveillance\r\n9 - Rebuilding Trust in Democracy\r\n10 - Transport \r\n11 - Culture\r\n12 - Future Challenges\r\n\r\nOfficial website for the Pirate Party UK: https://www.pirateparty.org.uk/\r\n\r\nPlease seed and share with others :)","torrent":{"xt":"urn:btih:55d5aed70b3c43355707afaae548d1823d85e162","amp;dn":"The+Pirate+Party+UK+2015+Manifesto","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55d5aed70b3c43355707afaae548d1823d85e162","infoHashBuffer":{"type":"Buffer","data":[85,213,174,215,11,60,67,53,87,7,175,170,229,72,209,130,61,133,225,98]},"announce":[],"urlList":[]}}