{"title":"From Bin Laden to  - Maria A.Ressa","uid":12916925,"size":6848014,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a0c6e37911745ceeefeff4a34328d54a8614e5e&amp;dn=From+Bin+Laden+to++-+Maria+A.Ressa&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1449359181,"description":"Maria A Ressa has been interviewed by The Wall Street Journal (High-Profile Journalist Reshapes Her Role in Terrorism Fight) and Channel NewsAsia (Terrorism Goes Online)The two most wanted terrorists in Southeast Asia — a Malaysian and a Singaporean — are on the run in the Philippines, but they manage to keep their friends and family updated onFilipinos connect with al-Qaeda-linked groups in Somalia and Yemen. The black flag — embedded in al-Qaeda lore — pops up on websites andpages from around the world, including the Philippines, Indonesia, the Middle East, Afghanistan, Australia, and North Africa. The black flag is believed to herald an apocalypse that brings Islam's triumph. These are a few of the signs that define terrorism's new battleground: the Internet and social media.In this groundbreaking work of investigative journalism, Maria Ressa traces the spread of terrorism from the training camps of Afghanistan to Southeast Asia and the Philippines. Through research done at the International Center for Political Violence &amp; Terrorism Research in Singapore and sociograms created by the CORE Lab at the Naval Postgraduate School, the book examines the social networks which spread the virulent ideology that powered terrorist attacks in the past 10 years.Many of the stories here have never been told before, including details about the 10 days during which Ressa led the crisis team in the Ces Drilon kidnapping case by the Abu Sayyaf in 2008. The book forms the powerful narrative that glues together the social networks — both physical and virtual — which spread the jihadi virus from bin Laden to","torrent":{"xt":"urn:btih:5a0c6e37911745ceeefeff4a34328d54a8614e5e","amp;dn":"From+Bin+Laden+to++-+Maria+A.Ressa","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a0c6e37911745ceeefeff4a34328d54a8614e5e","infoHashBuffer":{"type":"Buffer","data":[90,12,110,55,145,23,69,206,238,254,255,74,52,50,141,84,168,97,78,94]},"announce":[],"urlList":[]}}