{"title":"Bopup.IM.Client.SDK.1.2Chat.Messenger.Library.CPP.VB","uid":12670552,"size":2246841,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5a4a99688d47a334d9f6cc8c5ad076e9f4cbd209&amp;dn=Bopup.IM.Client.SDK.1.2Chat.Messenger.Library.CPP.VB&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"boffon","files":5,"time":1446443022,"description":"Bopup IM Client SDK version 1.2\r\n========================================================================\r\n\r\n\r\nOverview\r\n------------------------------------------------------------------------\r\n\r\nBopup IM Client Software Development Kit (SDK) is a toolkit for Windows \r\nplatform that provides documentation, samples and COM components for \r\nbuilding powerful instant messaging functionality into existing \r\napplications, creating and developing a chat messenger software based \r\na client/server architecture. Applications built on this SDK interact \r\nand communicate with Bopup Communication Server (IM server software) \r\nthat must be installed as a server-side part of the instant messaging \r\nsystem. \r\n\r\nBopup IM Client SDK provides functions for connecting and establishing \r\nIM session with the communication server, sending/receiving personal \r\nand group instant messages, exchange files/directories, receiving urgent \r\nand high-priority tasks from the server, managing user's contacts, \r\nreceiving presence status updates within the Contact List. This SDK \r\nsupports various authentication methods to autorize users on the IM \r\nserver: Simple, Windows Authentication (SSPI) and using Private login \r\nand password credentials entered by a end-user. \r\n\r\nUsing SDK components it is possible to implement instant messaging \r\nclient applications using various programming languages and platforms \r\nincluding C/C++ and Microsoft VB.NET/C# frameworks. SDK library also \r\nprovides an interface for VBA (Visual Basic for Applications) \r\nenvironment support that is available as built-in development platform \r\nin Microsoft Office software and allows to create macros for a range of \r\nOffice applications such as Excel, Word, Outlook, Access, PowerPoint \r\nand others. \r\n\r\nProvided functionality and supported features:\r\n\r\n* Secure and Private Communication\r\nAll transmitted messages are encrypted with strong encryption algorithms \r\nbased on the Diffie-Hellman key exchange and CAST-128 algorithms. That \r\nis the first and primary way to make corporate and business IM safe and \r\nsecure. \r\n\r\n* Authentication Modes \r\nVarious modes to authenticate and authorize users with the IM server are \r\nsupported. Choose the best way for your corporate and business \r\ninfrastructure from the available authentication modes: Simple, Windows \r\nAuthentication (SSPI) and Private login/password. \r\n\r\n* Messaging Groups \r\nThe centralized management of user groups makes it possible to organize \r\na flexible IM structure with a list of assigned groups and send / \r\nreceive-only permissions set for each user. \r\n\r\n* User Presence Status \r\nSee the current status of each user in your Contact List, i.e. Online, \r\nAway, Offline (Not available). Manage your own status. \r\n\r\n* Contact List access \r\nOrganize your personal Contact List and access it from any workplace and \r\nlocation. \r\n\r\n* Offline and Urgent Messaging \r\nDeliver important information to users even if they are currently \r\nunavailable and receive such messages. Offline messages are stored on \r\nthe IM server and automatically delivered to the recipient when he goes \r\nonline. \r\n\r\n* Centralized Notification \r\nReceive notifications and urgent messages from the IM server and stay \r\nupdated on any events and information. These messages are automatically \r\nsent by the server on the scheduled time and at the specified intervals. \r\n\r\n* Offline Messaging and File Transfer\r\nDeliver important information to users even if they are currently \r\nunavailable and receive such messages and files. Offline messages and \r\ntransfers are stored on the IM server and automatically delivered to the \r\nrecipient when he goes online. \r\n\r\n* Message Logging &amp; Archiving \r\nBrowse, search and view the entire message archives on the IM server. \r\nPrint information for any period and for any person. \r\n\r\n\r\n\r\nRequirements and Restrictions\r\n------------------------------------------------------------------------\r\n\r\nThis SDK requires Bopup Communication Server installed and used as an IM \r\nserver to provide instant messaging features and functions. Applications \r\nbuilt using this toolkit depend on 45-day trial of the communication \r\nserver during which only 10 concurrent connections are supported.\r\n\r\nFor more information about Bopup Communication Server please visit \r\nproduct page at http://www.bopup.com/products/server/\r\n\r\n\r\n\r\n========================================================================\r\nCopyright (C) 2000-2015 B Labs. All rights reserved. \nhttp://www.bopup.com/","torrent":{"xt":"urn:btih:5a4a99688d47a334d9f6cc8c5ad076e9f4cbd209","amp;dn":"Bopup.IM.Client.SDK.1.2Chat.Messenger.Library.CPP.VB","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a4a99688d47a334d9f6cc8c5ad076e9f4cbd209","infoHashBuffer":{"type":"Buffer","data":[90,74,153,104,141,71,163,52,217,246,204,140,90,208,118,233,244,203,210,9]},"announce":[],"urlList":[]}}