{"title":"Shes In Control 2015 WEB-DL Split Scenes","uid":12945526,"size":1847977084,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:5cc050012c0138ca1e3d876398af74309faa6896&amp;dn=Shes+In+Control+2015+WEB-DL+Split+Scenes&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EndYou","files":5,"time":1449672948,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/album/q6\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nReleased: 2015\r\nCountry: USA\r\nStudio: Teamskeet\r\nGenre: CFNM (Clothed Female Naked Male)\r\nDuration: 1:32:19\r\n\r\nAlexa Grace, Ava Taylor, Brooklyn Rose, Keisha Grey, Marsha May\r\n\r\nAva Taylor - When her boss said no to a week off, Ava used her charms to get what she wanted. She took off his pants and blew him and before he knew it he was piping Ava on his desk! He was butt naked while Ava slid her panties to the side and let him have it! He sprayed his cum all over her ass and then kicked her out before his wife got back! Keisha Grey - Keisha asks her step-brother if there's a hole in her jeans. He says yes and rips her jeans open, exposing her perfect ass and pussy! He promises to replace them but he wants her pussy in return! After sucking him off, she bends over and her jeans rip even more! Her step-bro can not take anymore and rams Keisha from behind! Brooklyn Rose - Tony and Brooklyn meet at a party and decide to get it on in the bathroom. Tony whips out his monster dick, cueing her to use those dick sucking lips of hers to get his dick all wet! They move into another room where Brooklyn bends her phat ass over for Tony's huge pipe to pound into her tight pussy and jizz onto her beautiful ass! Alexa Grace - While out on the balcony, Alexa and her boyfriend get all worked up. She gets bent over the railing and her tight snatch is hammered by her boyfriends meaty dick! They go to the bedroom, and while still dressed for dinner, she gets drilled until she's moaning with delight! Her twat is drenched with his ball sauce - and then it's dinner time! Marsha May - Bruno wants to secretly film Marsha in her yoga pants. She catches him and decides to teach him a lesson. After making him strip naked and making fun of his cock and balls she gives him a chance to prove his manhood. She sucks him off until Bruno can take no more, and rips her new yoga pants to get at her wet snatch!\r\n\r\nQuality: WEB-DL\r\nFormat: MP4\r\nVideo: MPEG4 Video (H264) 960x540 29.97fps 2499kbps\r\nAudio: AAC 48000Hz stereo 171kbps","torrent":{"xt":"urn:btih:5cc050012c0138ca1e3d876398af74309faa6896","amp;dn":"Shes+In+Control+2015+WEB-DL+Split+Scenes","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cc050012c0138ca1e3d876398af74309faa6896","infoHashBuffer":{"type":"Buffer","data":[92,192,80,1,44,1,56,202,30,61,135,99,152,175,116,48,159,170,104,150]},"announce":[],"urlList":[]}}