{"title":"Marlon Brando - Fan Tan","uid":12668874,"size":238613204,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:61d8f63673981f9b6836e23e89a614528ceeebc9&amp;dn=Marlon+Brando+-+Fan+Tan&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gabo2","files":7,"time":1446410259,"description":"One of the newest crazes in genre fiction seems to be the posthumous publishing of unedited manuscripts that are serendipitously found lying about after a person dies. Fan-Tan is actually the work of two dead authors: Marlon Brando, who came up with the story in 1979 with the original intention of it being a film, and director Donald Cammell, who wrote most of the actual manuscript. Indeed, the book reads like a 1940s B-movie (but for the graphic sex and language), with such stock characters as the Great White Hunter (translated from the African jungle to the China Sea), the beautiful yet deadly Eurasian femme fatale, and a bevy of murderous Chinese pirates. The stereotypes abound to the extent that one easily expects a platitude-spouting Charlie Chan to appear at any time. In 1927, Anatole &quot;Annie&quot; Doultry is serving six months in a Hong Kong prison on an arms-smuggling charge when he saves the life of a Chinese prisoner. This earns him the gratitude of the man's employer, pirate queen Madame Lai Choi San, who offers Annie a share in the spoils if he'll assist her in a spectacular heist she has planned. The novelty of Brando's name should give this predictable pirate yarn a robust, but brief, popularity","torrent":{"xt":"urn:btih:61d8f63673981f9b6836e23e89a614528ceeebc9","amp;dn":"Marlon+Brando+-+Fan+Tan","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61d8f63673981f9b6836e23e89a614528ceeebc9","infoHashBuffer":{"type":"Buffer","data":[97,216,246,54,115,152,31,155,104,54,226,62,137,166,20,82,140,238,235,201]},"announce":[],"urlList":[]}}