{"title":"Lauren Weisberger - La vendetta veste Prada [Pdf - Ita]","uid":12872054,"size":1532634,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:64eafe1bf0b5e07a0555f0644dc36dbcc007ce13&amp;dn=Lauren+Weisberger+-+La+vendetta+veste+Prada+%5BPdf+-+Ita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vitolanz","files":1,"time":1448895374,"description":"Lauren Weisberger - La vendetta veste Prada [Pdf - Ita][TNTVillage]\r\n--------------------------------------------------------------------------------\r\n.: Dettagli :.\r\n\r\nAutore: Lauren Weisberger\r\nTitolo:  La vendetta veste Prada\r\nAnno:  2013\r\nLingua: Italiana\r\nTraduttore: Daniele V. \r\nGenere:  Contemporanea e per adulti\r\nDimensione del file: 1,46 MB\r\nFormato del file: PDF \r\n--------------------------------------------------------------------------------\r\n\r\n.: Trama :.\r\n\r\nSono passati quasi dieci anni da quando Andrea Sachs, Andy, si è licenziata dal lavoro per cui &quot;milioni di ragazze ucciderebbero&quot; come assistente di Miranda Priestly, direttrice di &quot;Runway&quot; e guru della moda internazionale. La sua vita è molto cambiata negli ultimi anni e di quel terribile periodo non le restano che qualche incubo notturno e l'incontrollabile terrore di partecipare a serate mondane in cui potrebbe incontrare lei, il Diavolo in persona. Tutto il resto, però, va a gonfie vele: la rivista di successo che ha fondato con Emily, l'antica rivale ora migliore amica e socia, e il matrimonio imminente con uno degli scapoli più ambiti della Grande Mela, Max Harrison, affascinante, romantico e soprattutto orgoglioso di avere accanto una donna indipendente e di successo. Nulla sembra poter rovinare un momento così perfetto. Ma Andy ha l'assoluta certezza che qualcosa stia per accadere, perché nessuno prima di lei aveva osato sfidare Miranda. La vendetta non si farà attendere ancora per molto.\r\n--------------------------------------------------------------------------------\r\n\r\n.: Biografia dell'autore :.\r\n\r\nLauren Weisberger (Scranton, 28 marzo 1977) è una scrittrice statunitense, divenuta celebre per il bestseller Il diavolo veste Prada (The Devil Wears Prada), del 2003, di cui è stata realizzata una trasposizione cinematografica con Meryl Streep, Emily Blunt, Anne Hathaway e Stanley Tucci.\r\nSi è laureata alla Cornell University nel 1999 e ora vive a New York, dove sono ambientate le sue opere.\r\nPrima di laurearsi, la Weisberger, proprio come la protagonista del suo bestseller, ha lavorato come assistente della direttrice di Vogue America, Anna Wintour, la cui figura nel romanzo è adombrata nel personaggio di Miranda Priestly.\r\nNel 2005 ha pubblicato il romanzo Al diavolo piace dolce (Everyone Worth Knowing).\r\nIl suo terzo romanzo, Un anello da Tiffany (Chasing Harry Winston) è stato pubblicato il 27 maggio 2008 negli Stati Uniti.\r\nIl 15 novembre 2011 è uscito in Italia il suo quarto romanzo: Il diavolo vola a Hollywood.\r\nNel novembre 2013, 10 anni dopo il successo de Il diavolo veste Prada, ne pubblica il tanto atteso sequel: La vendetta veste Prada","torrent":{"xt":"urn:btih:64eafe1bf0b5e07a0555f0644dc36dbcc007ce13","amp;dn":"Lauren+Weisberger+-+La+vendetta+veste+Prada+%5BPdf+-+Ita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"64eafe1bf0b5e07a0555f0644dc36dbcc007ce13","infoHashBuffer":{"type":"Buffer","data":[100,234,254,27,240,181,224,122,5,85,240,100,77,195,109,188,192,7,206,19]},"announce":[],"urlList":[]}}