{"title":"Rescue - Heroes in Action v1.1.7","uid":12634567,"size":286388453,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:67314784d4e812bdf4cae9e3f4297214bd715bf4&amp;dn=Rescue+-+Heroes+in+Action+v1.1.7&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":".BONE.","files":4,"time":1445905250,"description":"\nRESCUE: Heroes in Action: Rising Storm is the first expansion for the popular RESCUE: Heroes in Action. RESCUE: Heroes in Action : Rising Storm adds a new scenario, 10 missions, new emergency vehicles, 4 new and unique characters and much, much more to the main game.\r\nWhen the sound of sirens fills the streets of your city, the blue flashing lights reflect in the windows of the house fronts, the stampede of soot-blackened boots against the asphalt rings in your ears and the command &quot;Water on!&quot; is shouted out, everyone knows: It's that time again - THE FIRE DEPARTMENT IS HERE to win the fight against the flames.\r\n\r\nExperience the exciting daily activities of a big city fire department in this thrilling new simulation, redeveloped for mobile devices.\r\n\r\nHOW MANY LIVES WILL I SAVE TODAY?\r\nYouâ™ll have to ask yourself this question of questions every day as a firefighter in &quot;RESCUE: Heroes in Action.&quot; Take full control of thrilling rescue missions, build your team of ready and effective firemen and women and constantly expand your fleet of vehicles.\r\n\r\nMaybe then youâ™ll be able to answer the question of questions with &quot;EVERY SINGLE ONE.&quot; Do you have what it takes to be a &quot;Hero in Action&quot;? There's only one way to find out.\r\n\r\nFeatures:\r\nEasy-to-learn firefighting gameplay\r\nCustomize your firefighters' uniforms and vehicles with a range of country-specific colors, designs and markings\r\nA variety of realistic firefighting scenarios set in a large city, including an emergency landing by an airplane, a gas explosion, a car crash and a blaze at an oil refinery.\r\nInnovative control system for firefighters and fire trucks\r\nCaptivating blend of simulation and strategy from the makers of the bestselling PC game &quot;RESCUE: Everyday Heroes&quot;\r\nUnlock upgrades like bigger tanks, enhanced water extinguishing power, improved engine performance, greater hose range, more durable suits and increased fire extinguisher capacity, and help increase the operational efficiency of your squad.\r\nEach member of your team has their own biography.\r\n\r\n\r\nWhat's new in this version:\r\nOut now: RESCUE: Heroes in Action: Rising Storm!\r\nThe RESCUE: Heroes in Action: Rising Storm expansion can be purchased via an in-app purchase.\r\nRESCUE: Heroes in Action: Rising Storm is the first expansion for the popular RESCUE: Heroes in Action. RESCUE: Heroes in Action: Rising Storm adds a new scenario, 10 missions, new emergency vehicles, 4 new and unique characters and much, much more to the main game","torrent":{"xt":"urn:btih:67314784d4e812bdf4cae9e3f4297214bd715bf4","amp;dn":"Rescue+-+Heroes+in+Action+v1.1.7","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67314784d4e812bdf4cae9e3f4297214bd715bf4","infoHashBuffer":{"type":"Buffer","data":[103,49,71,132,212,232,18,189,244,202,233,227,244,41,114,20,189,113,91,244]},"announce":[],"urlList":[]}}