{"title":"From.Darkness.s01e04.EN.SUB.x264.WEBRIP.[MPup]","uid":12640472,"size":1059698739,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:69a10d79444fb3c3d66c65cf4aed444680a40f00&amp;dn=From.Darkness.s01e04.EN.SUB.x264.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1445982963,"description":"From.Darkness.s01e04.EN.SUB.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]4 of 4[/b]\r\n\r\nPsychological crime drama. Claire risks everything in her battle to stop the killer. When the truth emerges and tragedy strikes, will she finally be able to overcome the darkness?\r\n\r\n[img]http://extraimago.com/images/2015/10/26/89d5bc21a4b81a04c1771225c8d4d843.jpg[/img]\r\n\r\n\r\nClaire's confession about their lost child sends John reeling, and both crumble in the aftermath of a disastrous attempt to nail the prime suspect. When John is suspended from duty, Claire with her direct connection to one of the killers must put aside her guilt and fight to prevent another murder.\r\n\r\nUnder intense media pressure, DSI Lola Keir takes the reins of the investigation and orders the team to take her back to square one, with a full list of potential suspects, now including Claire's tormentor, Lucy Maxley, a former student who survived an attack by the original culprit, and whose cries for help went unheard at the time. Now, Claire must exploit Lucy's obsession with her in order to try to stop the killing, but at what personal cost?\r\n\r\nClaire's betrayal enrages Lucy, forcing Claire to lead a desperate operation to rescue her own fractured family. She emerges tougher, newly determined to end the violence by finally snaring the 1998 killer. But as Claire makes a daring breakthrough, Lucy closes in on a new and unexpected target.\r\n\r\nJohn risks professional annihilation to get to Lucy before she kills again, his feelings for Claire intensifying even as events keep them apart. As each races to catch a killer, they uncover the dark secrets at the heart of the murderers' brutality. But they may be too late to prevent another tragedy.\r\n\r\nFor Claire, the final confrontation will test her emotions beyond anything she's endured so far. As she finally confronts her own role in the crimes, will she finally put an end to the darkness or has the true horror only just begun?","torrent":{"xt":"urn:btih:69a10d79444fb3c3d66c65cf4aed444680a40f00","amp;dn":"From.Darkness.s01e04.EN.SUB.x264.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69a10d79444fb3c3d66c65cf4aed444680a40f00","infoHashBuffer":{"type":"Buffer","data":[105,161,13,121,68,79,179,195,214,108,101,207,74,237,68,70,128,164,15,0]},"announce":[],"urlList":[]}}