{"title":"Paradise City - Elizabeth Day.epub","uid":12937275,"size":728532,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a830a16269a3077f6a71be842410fa0ef727928&amp;dn=Paradise+City+-+Elizabeth+Day.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mr_mando","files":1,"time":1449597911,"description":"Paradise City - Elizabeth Day\r\n\r\n Beatrice Kizza, a woman in flight from a homeland that condemned her for daring to love, flees to London. There, she shields her sorrow from the indifference of her adopted city, and navigates a night-time world of shift-work and bedsits.\r\n\r\nHoward Pink is a self-made millionaire who has risen from Petticoat Lane to the mansions of Kensington on a tide of determination and bluster. Yet self-doubt still snaps at his heels and his life is shadowed by the terrible loss that has shaken him to his foundations.\r\n\r\nCarol Hetherington, recently widowed, is living the quiet life in Wandsworth with her cat and The Jeremy Kyle Show for company. As she tries to come to terms with the absence her husband has left on the other side of the bed, she frets over her daughter's prospects and wonders if she'll ever be happy again. \r\n\r\nEsme Reade is a young journalist learning to muck-rake and doorstep in pursuit of the elusive scoop, even as she longs to find some greater meaning and leave her imprint on the world.\r\n\r\nFour strangers, each inhabitants of the same city, where the gulf between those who have too much and those who will never have enough is impossibly vast. But when the glass that separates Howard's and Beatrice's worlds is shattered by an inexcusable act, they discover that the capital has connected them in ways they could never have imagined","torrent":{"xt":"urn:btih:6a830a16269a3077f6a71be842410fa0ef727928","amp;dn":"Paradise+City+-+Elizabeth+Day.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a830a16269a3077f6a71be842410fa0ef727928","infoHashBuffer":{"type":"Buffer","data":[106,131,10,22,38,154,48,119,246,167,27,232,66,65,15,160,239,114,121,40]},"announce":[],"urlList":[]}}