{"title":"By the Seat of My Pants - Don George","uid":12681057,"size":3828412,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6c43bfd91037485d67110a21f3f11e9639dfd2d1&amp;dn=By+the+Seat+of+My+Pants+-+Don+George&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1446560437,"description":"Lonely Planet knows that some of life's funniest experiences happen on the road. Whether they take the form of unexpected detours, unintended adventures, unidentifiable dinners or unforgettable encounters, they can give birth to our most found travel lessons, and our most memorable - and hilarious - travel stories.\r\n\r\nThese 31 globegirdling tales that run the gamut from close-encounter safaris to loss-of-face follies, hair-raising rides to culture-leaping brides, eccentric expats to mind-boggling repasts, wrong roads taken to agreements mistaken. The collection brings together some of the world's most renowned travellers and storytellers with previously unpublished writers.\r\n\r\nIncludes stories by Wickam Boyle, Tim Cahill, Joshua Clark, Sean Condon, Chistopher R.Cox, David Downie, Holly Erikson, Bill Fink, Don George, Karl Taro Greenfeld, Jeff Grenwald, Pico Iyer, Amanda Jones, Kathie Kertesz, Doug Lansky, Alexander Ludwick, Linda Watanabe McFerrin, Jan Morris, Brooke Neill, Rolf Potts, Laura Resau, Michelle Richmond, Alana Semuels, Deborah Steg, Judy Tierney, Edwin Tucker, Jeff Vize, Danny Wallace, Kelly Watton, Simon Wichester, Michelle Witton","torrent":{"xt":"urn:btih:6c43bfd91037485d67110a21f3f11e9639dfd2d1","amp;dn":"By+the+Seat+of+My+Pants+-+Don+George","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c43bfd91037485d67110a21f3f11e9639dfd2d1","infoHashBuffer":{"type":"Buffer","data":[108,67,191,217,16,55,72,93,103,17,10,33,243,241,30,150,57,223,210,209]},"announce":[],"urlList":[]}}