{"title":"Static Compensators (STATCOMs) in Power Systems [2015] [PDF]","uid":12688455,"size":27612728,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7082d37f3b89377b00cf061d2a6fe1f696ea536a&amp;dn=Static+Compensators+%28STATCOMs%29+in+Power+Systems+%5B2015%5D+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NoctDeath","files":2,"time":1446636134,"description":"Title: Static Compensators (STATCOMs) in Power Systems \r\nSeries: Power Systems \r\nAuthor: Farhad Shahnia, Sumedha Rajakaruna, Arindam Ghosh \r\nFormat: PDF \r\nHardcover: 735 pages \r\nPublisher: Springer; 2015 edition (December 2, 2014) \r\nLanguage: English \r\nISBN: 9789812872807 \r\n\r\n\r\nA static compensator (STATCOM), also known as static synchronous compensator, is a member of the flexible alternating current transmission system (FACTS) devices. It is a power-electronics based regulating device which is composed of a voltage source converter (VSC) and is shunt-connected to alternating current electricity transmission and distribution networks. The voltage source is created from a DC capacitor and the STATCOM can exchange reactive power with the network. It can also supply some active power to the network, if a DC source of power is connected across the capacitor. A STATCOM is usually installed in the electric networks with poor power factor or poor voltage regulation to improve these problems. In addition, it is used to improve the voltage stability of a network.\r\n\r\nThis book covers STATCOMs from different aspects. Different converter topologies, output filters and modulation techniques utilized within STATCOMs are reviewed. Mathematical modeling of STATCOM is presented in detail and different STATCOM control strategies and algorithms are discussed. Modified load flow calculations for a power system in the presence of STATCOMs are presented. Several applications of STATCOMs in transmission and distribution networks are discussed in different examples and optimization techniques for defining the optimal location and ratings of the STATCOMs in power systems are reviewed. Finally, the performance of the network protection scheme in the presence of STATCOMs is described. This book will be an excellent resource for postgraduate students and researchers interested in grasping the knowledge on STATCOMs","torrent":{"xt":"urn:btih:7082d37f3b89377b00cf061d2a6fe1f696ea536a","amp;dn":"Static+Compensators+%28STATCOMs%29+in+Power+Systems+%5B2015%5D+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7082d37f3b89377b00cf061d2a6fe1f696ea536a","infoHashBuffer":{"type":"Buffer","data":[112,130,211,127,59,137,55,123,0,207,6,29,42,111,225,246,150,234,83,106]},"announce":[],"urlList":[]}}