{"title":"Leaked candidate Profiles -Libertarian Party of Canada","uid":12641926,"size":1950045,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:722026d7e9f00722ba5a1d952698ceed94b53eb5&amp;dn=Leaked+candidate+Profiles+-Libertarian+Party+of+Canada&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"liberty101010","files":6,"time":1446003345,"description":"This is a leak of the documents of profiles made by the board of the Canadian Libertarian Party. Documents were made to assess Candidates stance on various issues relating to Race, Gender, Religion, feminism and party loyalty.\r\n\r\n\r\nPlease share it's important for people to know that even in &quot;fringe parties&quot; Candidates are being put into compromised situations by higher powers.\r\n\r\n---------------------Initial Statement--------------------------------\r\n\r\nHello all, some have been surprised to see me resign from the board. Quite frankly I just can't take it anymore. I joined this party because I believed we were different. I believed we were against corruption, I know see the error of my ways. I can no longer continue with our current leadership and board members at the helm. Any attempt I have made to try to ferret out the incompetence and corruption has resulted in me be accused of power grabbing or blowing things out of proportion. Rotten things happen here and no one gets in trouble. There is no accountability. So I decided to give you the list of reasons why I am leaving.\r\n1. Our CFO, voted 'no' to having Tim produce an election budget before he gave him 50% of the party's money. In fact, many board members voted 'no' to a very reasonable proposal, given the fact that we were a month into the election, Tim was not even confirmed and he could not even answer simple questions in relationship to his campaign. He didn't even come to the meeting prepared with the leaders report he was supposed to make! Is it unreasonable to ask to see what the plan is before we give 50% of the party's money?\r\n2. Though the motion passed, we got the budget that included a paid campaign manager, and $1000 pizza parties. I warned that money should be given in instalments when targets were hit because the plan was unrealistic. I warned that we would not get any value for our investment. I was right, for $30,000, paid staff members and parties, we snagged 1% of the vote.\r\n3. Prior to joining the board, I offered to table 3 events and do more, and was told there was no money each time. Yet we paid $1000 for pizza?\r\n4. Tim threw all of his productive executives under the bus by not defending them during the Lauren Southern episode. He didn't even defend the party! he just brought her back and never corrected the fact that it wasn't Dave, Rehan or Mark that created the problem, it was him. Many of our productive volunteers and staff left over this. That's not leadership.\r\n5. Cory gave Tim $200 worth of donations which he lost. We then didn't hear about it for 6 months until the donors started contacting us wondering where their membership cards were. At that time we were told that the two of them lost it because they either, didn't follow up or they knew and covered it up... either way, no one got in trouble and I was told I was power grabbing and making a big deal out of nothing. Pretty sure losing $200 and having to basically pay off anyone who called us saying they donated is a pretty big deal.\r\n6. Tim's responsibility as leader was to produce a platform. At the zero hour we were asked to vote on an incomplete document. It had titles without any text body! So that's why we basically had a few lines on our website and nothing to back it up.\r\n7. I managed to leak documents that showed Scott Berry was making secret dossiers on candidates to identify trouble makers. The documents included things like personal relationships, and financial status etc... I suppose the reason was we could use it to silence them if they went off the script? Once again, no one gets in trouble and scott is still with us today.\r\nThese are just the things I have direct first hand knowledge of. I have been told MANY more things in confidence by people who are still active and some who have resigned. Hopefully they will also come forward and let you know what goes on behind the scenes. This is why, I can no longer stand to be on the board. I will continue to work for liberty but unless there is a major overhaul of the leadership and the board I won't continue to actively support the party. I am just fed up, and covering this up any longer does not help us one bit. I kept quiet until now because I felt it would irresponsible, and potentially damaging to the membership, donors and candidates to bring these issues up during the election. I have worked behind the scenes to fix these issues but I can see that the only thing that will fix it, is exposure.\r\nI hope others will also come forward with their own experiences... but if you don't I understand. This is the path I have decided to take and I don't expect anyone else to follow. I would like everyone to know, there are still many good people involved in the board and executive but unfortunately, they are not running the show.\r\nPs. Art Lowe check out the documents","torrent":{"xt":"urn:btih:722026d7e9f00722ba5a1d952698ceed94b53eb5","amp;dn":"Leaked+candidate+Profiles+-Libertarian+Party+of+Canada","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"722026d7e9f00722ba5a1d952698ceed94b53eb5","infoHashBuffer":{"type":"Buffer","data":[114,32,38,215,233,240,7,34,186,90,29,149,38,152,206,237,148,181,62,181]},"announce":[],"urlList":[]}}