{"title":"On a Wing and a Prayer - Sarah Woods","uid":12963045,"size":6270086,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7622da1d2afdfee1a4bb073956ae3ff917cf0044&amp;dn=On+a+Wing+and+a+Prayer+-+Sarah+Woods&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1449867946,"description":"When writer and intrepid traveler Sarah Woods set about discovering the jungles of Central and South America, her quest took her into some of the most remote tangles of vine-knotted jungles on the planet. In Panama's rain-soaked Chiriquí highlands, she navigated seemingly impassable trails with a machete to reach quetzals with resplendent jewel-tone plumage.\r\n\r\nSarah sought the native wisdom of the indigenous Embera, deep in the Darien Jungle, in order to encounter the world's largest and most powerful birds of prey--the elusive harpy eagle. Using razor-sharp talons to hunt and kill sloths and monkeys with deadly precision, these mammoth, winged dinosaurs hide a lesser-known, softer side: devoting great care to raising their young for the first two years of their lives. Seldom seen in the wild, Sarah struggled to demystify the fear-riddled legends and superstitions that earned the harpy eagle its name from early explorers.\r\n\r\nHer voyage taught her much about the rich glories and mesmerizing spectacle of the natural world and also its challenges and dangers. She met the albino 'moon children' of Kuna Yala, swam in the Panama Canal, encountered left-wing guerrillas at the heart of Colombia's five-decade conflict, and witnessed Amazonian beliefs and customs surrounding shape-shifting and the jungle afterlife. Sarah survived landslides, crash landings, mammoth floods, and culture clashes in mysterious untrodden lands, learning much about aspects of herself from the incredible wildlife and tribal peoples she encountered--arguably her biggest journey","torrent":{"xt":"urn:btih:7622da1d2afdfee1a4bb073956ae3ff917cf0044","amp;dn":"On+a+Wing+and+a+Prayer+-+Sarah+Woods","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7622da1d2afdfee1a4bb073956ae3ff917cf0044","infoHashBuffer":{"type":"Buffer","data":[118,34,218,29,42,253,254,225,164,187,7,57,86,174,63,249,23,207,0,68]},"announce":[],"urlList":[]}}