{"title":"Kung Fu","uid":12708427,"size":25265785295,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:79d8d073f3cadc4a8e160c1f1519998e48859295&amp;dn=Kung+Fu&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"shink5","files":71,"time":1446865661,"description":"[img]http://www.pariscine.com/sites/default/files/affiches_series_tv/kung_fu.jpg[/img]\r\n\r\n[img]http://static.srcdn.com/slir/w620-h320-q90-c620:320/wp-content/uploads/Baz-Luhrmann-Direct-Kung-Fu-Adaptation.jpg[/img]\r\n\r\nKwai Chang Caine is a Shaolin Monk who is on the run after he killed the Chinese Emperor's nephew after that coward killed his teacher in cold blood with a gun. He flees to America both to escape retaliation and to search for his brother in order to settle down in this new land. However, in his travels in the wild west, he can not help but continually run into trouble from desperados and other ruffians as they oppress the innocent, while bounty hunters pursue the price on his head. Against this, he has his skill of Kung-fu martial arts which proves to be devastatingly effective in this gun-dominated land.\r\n\r\nDid you know?\r\nThe only reason this show went off the air was because star David Carradine quit the series. He had sustained so many injuries, he felt he could not go on. The show got high ratings all three seasons it aired.\r\n\r\nAccording to Bruce Lee's widow, Linda Lee Cadwell, Lee originated the concept and was intended to star in the series, but David Carradine was cast because the network felt the American audience was not ready for an Asian actor as the lead and Lee received no credit for his concept. (This was dramatized in Dragon: The Bruce Lee Story (1993).) But according to the producers, although Lee was consulted and was considered for the role, they created the concept and Carradine was always their first choice.\r\n\r\nThe set for the Shaolin Temple was originally a set used for the Camelot (1967) that was inexpensively and effectively converted for the Chinese setting.\r\n\r\nJohn Saxon was offered the role of Caine but turned it down.\r\n\r\nIn several episodes, a younger Kwai Chang Caine was played by Keith Carradine, David Carradine's younger brother. Their other brother Robert Carradine and their father John Carradine also appeared in episodes (as Sonny Jim and Serenity Johnson, respectively).\r\n\r\nTorrent includes Seasons 1-3 as well as extras including:\r\n* From Grasshopper to Caine-Creating Kung Fu\r\n* The Tao of Caine Production and Beyond\r\n* Introduction by David Carradine\r\n* David Carradine's Shaolin Diary-Back to the Beginning\r\n* Zen &amp; Now-A dinner with David Carradine and friends","torrent":{"xt":"urn:btih:79d8d073f3cadc4a8e160c1f1519998e48859295","amp;dn":"Kung+Fu","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79d8d073f3cadc4a8e160c1f1519998e48859295","infoHashBuffer":{"type":"Buffer","data":[121,216,208,115,243,202,220,74,142,22,12,31,21,25,153,142,72,133,146,149]},"announce":[],"urlList":[]}}