{"title":"Municipal Stormwater Management 2nd ed","uid":12927261,"size":22035750,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7cef09639f6e9873a8298ef9dbde5d590d49a6de&amp;dn=Municipal+Stormwater+Management+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1449484080,"description":"Municipal Stormwater Management 2nd ed - Thomas N. Debo, Andrew Reese (CRC, 2003).pdf\r\n\r\nISBN 1566705843\r\n\r\nDesigned to be a stand alone desktop reference for the Stormwater manager, designer, and planner, the bestselling Municipal Stormwater Management has been expanded and updated. Here is what's new in the second edition: \r\n\r\nNew material on complying with the NPDES program for Phase II and in running a stormwater quality program\r\nThe latest information on stormwater utilities\r\nMetric versions of many of the equations, charts, and design monographs \r\nThe latest information on Best Management Practices (BMPs)\r\nNew concepts in stormwater master planning\r\nAn understanding of the recent evolution in stormwater practice\r\nSite design practices to reduce stormwater impacts\r\nLots of additional information related to the development of municipal stormwater programs\r\n\r\n\r\nThe authors provide the most up-to-date information available, including water quality best management practices and stormwater master and quality management plans. They present little known but valuable tables, charts, and procedures covering both common designs and more specialized situations. Both English and Metric versions of charts and nomographs are included where available and where deemed useful for the designer.\r\n\r\nThe text presents an understanding of what works and what doesn't in real-world municipalities. Topics on planning and institutional concerns focus on programs dealing with public awareness, ordinances and regulations, and financing. Technical design topics range from the practical aspects of hydrologic procedures to the design of culverts and storm drainage systems. This stand-alone document provides all the essential information for the design and analysis of most stormwater management facilities.\r\n\r\nMunicipal Stormwater Management, Second Edition covers all aspects of municipal Stormwater management, from planning and institutional concerns to technical design considerations. It details the design applications and the institutional aspects of Stormwater management that planners and administrators face on a daily basis. The material and depth of coverage make this book the perfect text for both professional and academic use","torrent":{"xt":"urn:btih:7cef09639f6e9873a8298ef9dbde5d590d49a6de","amp;dn":"Municipal+Stormwater+Management+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7cef09639f6e9873a8298ef9dbde5d590d49a6de","infoHashBuffer":{"type":"Buffer","data":[124,239,9,99,159,110,152,115,168,41,142,249,219,222,93,89,13,73,166,222]},"announce":[],"urlList":[]}}