{"title":"Dragon.Quest.Heroes.Slime.Edition-RELOADED","uid":12916371,"size":21022087758,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7d96b33d7922f26418019806de9cef8fd6a3434e&amp;dn=Dragon.Quest.Heroes.Slime.Edition-RELOADED&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Tenguken","files":2,"time":1449351368,"description":"DRAGON QUEST HEROES Slime Edition (c) SQUARE ENIX\r\n\r\n12/2015 :..... RELEASE.DATE .. PROTECTION .......: Steam\r\n      1 :.......... DISC(S) .. GAME.TYPE ........: Action, RPG\r\n\r\nThe Digital Slime Edition for PC includes eleven additional goopy Slime\r\nWeapons and two bonus maps!\r\n\r\n\r\n* Splat O'Nine Tails\r\n* Slime-On-A-Stick\r\n* Slime Sword\r\n* Gooreat Sword\r\n* Gungenir\r\n* Gooey Gloves\r\n* Happy Map\r\n* Goomerang\r\n* Goopid's Bow\r\n* Squishing Rod\r\n* Gold-Digger's Map\r\n* Fandangoos\r\n* Goolden Axe\r\nIn DRAGON QUEST HEROES: The World Tree's Woe and the Blight Below, the\r\nprotagonists must rise up against seemingly insurmountable odds, facing off\r\nagainst swarms of enemies and gigantic monsters in an exhilarating action\r\ngame. Filled with characters and monsters designed by world-renowned artist\r\nAkira Toriyama, DRAGON QUEST HEROES: The World Tree's Woe and the Blight\r\nBelow will be available on PC in beautiful HD graphics.\r\n\r\nStory\r\nWhen a dark shockwave sweeps through the city of Arba, the monsters that\r\nonce lived peacefully alongside the people are driven into a frenzied rage.\r\nAs either the hero Luceus or the heroine Aurora, the player joins forces\r\nwith a cast of fan favorites from previous DRAGON QUEST titles, such as\r\nAlena, Bianca and Yangus, to bring the rampaging hordes of monsters to\r\ntheir senses and restore order to the kingdom.\r\n\r\nKey Features:\r\n* Overpower Hundreds of Monsters  Swing into action against seemingly\r\nimpossible odds and become the hero of the battlefield. Cleave through\r\nrelentless swarms of monsters and fight against gigantic foes in an epic\r\nclash of good versus evil.\r\n* Fight Alongside Legendary Characters  Players can embark on a journey\r\nwith some of the most beloved characters of the DRAGON QUEST series  all\r\nvoiced  to form their own party of four and stride into battle. From the\r\nsultry Maya of DRAGON QUEST IV fame to Yangus, the thief with a heart of\r\ngold from DRAGON QUEST VIII, the player's party will always be full of\r\ncharacter.\r\n* Strategy-Oriented Battles  Players can level up each character and\r\nupgrade their unique spells and abilities. Swapping between characters\r\nstrategically and unleashing the right skill at the right time will help\r\nplayers survive the toughest battles.\r\n* Collect Monster Medals to Turn the Tide  Gather monster medals from\r\ndefeated foes to bring them back to the battlefield as allies or to take\r\nadvantage of their special skills. Up to 24 monsters can fight by the\r\nplayer's side at any one time.\r\n* Legendary Trio of Creators  The title comes to life in beautiful\r\nhigh-definition graphics for PC with a host of distinctive characters and\r\nmonsters designed by world-renowned artist Akira Toriyama. Both Yuji\r\nHorii, director and creator of DRAGON QUEST, and Koichi Sugiyama, the\r\ncomposer closely tied to the series since its first installment and\r\ncreator of countless memorable musical masterpieces, are working on this\r\nfull-scale action RPG.\r\n\r\nGraphics options supported for high end PCs:\r\n\r\n* Rendering resolution\r\n* Shadow processing\r\n* Glare adjustment\r\n* Turning movie scene playback on and off\r\n* Number of characters displayed\r\n* Draw distance\r\n* Texture QualitySupport for both full-screen and windowed display modes\r\nSupport for a maximum frame rate of 60fps\r\nSupport for full HD display at a maximum resolution of 1920 x 1080\r\n\r\n1. Unrar.\r\n2. Burn or mount the image.\r\n3. Install the game.\r\n4. Copy over the cracked content from the /Crack directory on the image to\r\nyour game install directory.\r\n5. Play the game.\r\n6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:7d96b33d7922f26418019806de9cef8fd6a3434e","amp;dn":"Dragon.Quest.Heroes.Slime.Edition-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d96b33d7922f26418019806de9cef8fd6a3434e","infoHashBuffer":{"type":"Buffer","data":[125,150,179,61,121,34,242,100,24,1,152,6,222,156,239,143,214,163,67,78]},"announce":[],"urlList":[]}}