{"title":"NuruMassage - Cherie DeVille (Don't Blow My Cover)","uid":12921733,"size":243443703,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:7dd44e46a1d970e55f619f4a66f65b421a119d17&amp;dn=NuruMassage+-+Cherie+DeVille+%28Don%27t+Blow+My+Cover%29++&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"feeldabyte","files":1,"time":1449423755,"description":"Screens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/rn5yI \nhttp://imgkiss.com/image/rnHRN\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nPeople have been complaining that the Nuru Massage is apparently conducting 'illegal activity', and it is Jake Jace's duty as a police officer to get to the bottom of this. He walks into the establishment, heads straight for the back and starts snooping in the dressers to find any incriminating evidence. His investigation is interrupted turning his face around to see his stepmother Cherie Deville in a Nuru Bathrobe. He had no idea his mother was working here and demands to know what sort of setup this is. Cherie has no issues showing her son around, proving her spa is as legitimate as it gets.\r\n\r\nCherie gets straight to business, removing her sons clothes for his shower time. Jake doesn't know how to feel. This is his mother after all, well, stepmother, but to him there isn't much of a difference. Cherie removes her clothes, directing him into the shower where she would bathe his naked body. The weirdness of being in a shower with his mom is too much for Jake, but Cherie insists that if he wants to know exactly what her establishment is about, he needs to pay attention and not focus so much on her being his mom. Laying down on the nuru bed, it is hard for Jake to fight against the boner he already has, with his mom rubbing her naked body up and down his back. Her boobs slipping down towards his cock doesn't help his case at all, but his sexual urge to fuck his stepmother is undeniable. Will Jake give the Nuru Massage a positive report? We think so!\r\n\r\n\r\nSail to another one :  https://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:7dd44e46a1d970e55f619f4a66f65b421a119d17","amp;dn":"NuruMassage+-+Cherie+DeVille+%28Don%27t+Blow+My+Cover%29++","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dd44e46a1d970e55f619f4a66f65b421a119d17","infoHashBuffer":{"type":"Buffer","data":[125,212,78,70,161,217,112,229,95,97,159,74,102,246,91,66,26,17,157,23]},"announce":[],"urlList":[]}}