{"title":"The Bible Series 2 - The Bible - History Channel Series - 6 - 10","uid":12781828,"size":8795820001,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:80be7375d1f7ec72bcb604bb6558690204b7beb8&amp;dn=The+Bible+Series+2+-+The+Bible+-+History+Channel+Series+-+6+-+10&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":19,"time":1447797712,"description":"The Bible \r\n\r\nis a television miniseries based on the Bible. It was produced by Roma Downey and Mark Burnett[2][3] and was broadcast weekly between March 3 and March 31, 2013 on History channel.[4] It has since been adapted for release to theaters as a feature film (138 minutes), the 2014 American epic biblical drama Son of God.\r\n\r\nBurnett, best known for producing prime-time hit reality shows, considers the scripted 10-hour series to be the &quot;most important&quot; project he has undertaken. The project was conceived by Burnett and Downey, who are married, after watching Cecil B. DeMille's version of The Ten Commandments for the first time since childhood.\r\n\r\nThe series is Mark Burnett's first scripted project.[5] In addition to Burnett and Downey, executive producers include Richard Bedser and History's Dirk Hoogstra and Julian P. Hobbs.[6] The first episode of the mini-series was seen by 13.1 million viewers, the largest cable television audience of 2013 to date.[7] The second installment continued &quot;to deliver blockbuster ratings&quot; for the network, attracting 10.8 million viewers. The third installment on March 17, 2013 was once again the No. 1 show on all of Sunday night television with 10.9 million total viewers. In addition, the series garnered 4.2 million adults 25–54 and 3.5 million adults 18–49.[8] In total, with subsequent airings, 'The Bible' has received more than 100 million cumulative views.[9]\r\n\r\nThe series received three Emmy Award nominations for best miniseries, and sound editing and sound mixing on July 18, 2013.[10]\r\n\r\nParts of the telecast – including unaired footage – have been turned into a feature film about the life of Jesus entitled Son of God.[11] A sequel series with the title A.D.: The Bible Continues aired on NBC","torrent":{"xt":"urn:btih:80be7375d1f7ec72bcb604bb6558690204b7beb8","amp;dn":"The+Bible+Series+2+-+The+Bible+-+History+Channel+Series+-+6+-+10","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80be7375d1f7ec72bcb604bb6558690204b7beb8","infoHashBuffer":{"type":"Buffer","data":[128,190,115,117,209,247,236,114,188,182,4,187,101,88,105,2,4,183,190,184]},"announce":[],"urlList":[]}}