{"title":"18 Eighteen - Tinah Star","uid":12919628,"size":660595264,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:81833450032c4251dfe601f9a32c18f174d96218&amp;dn=18+Eighteen+-+Tinah+Star&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"hunter534","files":1,"time":1449401668,"description":"Do you get off on cute, sexy Asian-American girls? If you do, you'll approve of pretty little Tinah Starr, a freshman cum-bimbo. Tinah is the right age to begin her training in how to be properly fucked by a man and how to be molded into a man-pleaser as she enters her twenties. Tinah seems very interested. Her fuck-buddy for this video-date instructs Tinah to get on her knees on the bed and lift up her top. You can see the camel-toe outline of her sweet pussy lips against the white cloth. She has tats and a belly piercing but that's okay. All teens and 20somethings today are getting them. It doesn't mean that she doesn't look virginal and innocent even with them. Shit, their mothers are getting tats and piercings too. After he feels her tender nipples, Tinah is told to lay back and to rub herself with her hand over her panties. She begins sucking his cock with her pierced tongue. This is not awkward beginner dick sucking. Tinah blows his meat with an experienced mouth that's much more advanced than her age would indicate. The hard man can't wait to mount her and fuck her pussy; she is so sweet and her fresh, soft, young body is driving him insane. Tinah's going to be plowed hard and she welcomes that. There may not be that much training he can give her. She looks like she's an alumni of a sex academy already. She pumps him nicely during their scissor fuck but in the rest of their hot sexing, Tinah is rammed by the dude like she's a porno love doll. How many men have fucked her before him? He's too busy drilling her to ask. And it doesn't matter. He's the boss while he's got her pinned like a butterfly before she flies away. If you weren't a big fan of perky Asian fuck-toys before, you might be by the time you finish this video.\r\n\r\nCOVER+SCEENSHOT:\r\n \nhttp://photo-up.info/img-56640e722c4e0.html \r\n \nhttp://myimg.info/img-56640e70a599c.html","torrent":{"xt":"urn:btih:81833450032c4251dfe601f9a32c18f174d96218","amp;dn":"18+Eighteen+-+Tinah+Star","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81833450032c4251dfe601f9a32c18f174d96218","infoHashBuffer":{"type":"Buffer","data":[129,131,52,80,3,44,66,81,223,230,1,249,163,44,24,241,116,217,98,24]},"announce":[],"urlList":[]}}