{"title":"Front of the Class - 2008","uid":12675142,"size":2093969631,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8213b7c8af1736eeaf6ced68f83ad97c621d71a2&amp;dn=Front+of+the+Class+-+2008&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":16,"time":1446497889,"description":"Very good, inspiring\r\nAuthor: vchimpanzee\r\n8 December 2008\r\n\r\nIn this fact-based story, Brad Cohen has Tourette's Syndrome. This means he makes noises involuntarily, even in places like school, where he would be expected to behave.\r\n\r\nEarly in the movie, with James Wolk narrating, we first see Brad as a child in St. Louis, played by Dominic Scott Kay. Brad is picked on by other children and told to behave by his teachers. Since he can't control himself, he is constantly being sent to the principal. His father Norman (Treat Williams) has divorced his mother and still believes Brad should work harder to control his actions. So mother Ellen (Patricia Heaton) must raise Brad and his brother Jeff (Charles Wyson) pretty much on her own. Ellen does research and finds out there is a name for Brad's condition, but no cure. The one thing Brad can do that pleases his father is play baseball, where rude noises are tolerated.\r\n\r\nFor the first part of the movie, the scenes of Brad's childhood alternate with those of the adult Brad, played by Wolk, who is living with a roommate Ron (not a real person, I found out, but a composite of several friends) and trying unsuccessfully to get a job as a second grade teacher in Atlanta, where his father runs a construction business. Norman wants Brad to work for him, but Brad is determined to prove he can make it as a teacher.\r\n\r\nYoung Brad finally finds a school that will accept him. The actions of Principal Myer inspire him not to give up, and he is determined to be a teacher unlike those who mistreated him.\r\n\r\nBut finding that job won't be easy. Though Brad demonstrates a great deal of confidence and determination and has a winning personality, and even though he succeeded as a student teacher. No one wants to take a chance on him. But Brad pushes harder, even as financial considerations force him to work for his father--doing the dirty work on job sites. Finally, Brad hears from Mountain View Elementary. They actually want him! Jim Ovbey (Joe Chrest) is the principal, and Hilarie Straka (Dianne Butler, who reminds me of Patricia Routledge in appearance) is the assistant principal who actually hired him. Susan Scott (Helen Ingebritsen) is his mentor.\r\n\r\nBut it still won't be easy to get through the first year. Some parents are uncomfortable with him. There are students with problems, but Brad has the ability to deal with those. After all, he too was a problem student, and he learned from his disability.\r\n\r\nWill he succeed? Well, if he didn't, would you be watching this?\r\n\r\nOh, Brad also wants to have relationships with women. Can he do that too? What do you think?\r\n\r\nI predict an Emmy nomination for James Wolk. It's not just that he effectively shows Brad's disability, or that he seamlessly integrates it into what seem he makes like normal conversation. He shows a very confident, very determined, easily likable man, in a way that would have made his performance a winner even if Brad had been like most of us. And he is an excellent teacher and loved by his students, who are also effectively portrayed.\r\n\r\nPatricia Heaton does a very good job, partly because I didn't even know who he was. I know her mainly from &quot;Back to You&quot; and clips of &quot;Everybody Loves Raymond&quot;.\r\n\r\nMike Pniewski has only a few lines, but as the principal who changed Brad's life, he is outstanding.\r\n\r\nSarah Drew does a very good job as Nancy, the girl who accepts Brad as he is and may go on to be more than just a girlfriend.\r\n\r\nI only have one criticism. Does Brad really make those noises THAT often in real life? He says it's mainly when he's nervous, but I think the writers could have cut back a little when he wasn't.\r\n\r\nThis is definitely worthy of the name Hallmark Hall of Fame","torrent":{"xt":"urn:btih:8213b7c8af1736eeaf6ced68f83ad97c621d71a2","amp;dn":"Front+of+the+Class+-+2008","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8213b7c8af1736eeaf6ced68f83ad97c621d71a2","infoHashBuffer":{"type":"Buffer","data":[130,19,183,200,175,23,54,238,175,108,237,104,248,58,217,124,98,29,113,162]},"announce":[],"urlList":[]}}