{"title":"The Bible Series 2 - Magdalena - Relaesed From Shame - 8 Lang","uid":12789357,"size":4680843874,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:822b05e3503a5487e4605c8923f9f7573ececa15&amp;dn=The+Bible+Series+2+-+Magdalena+-+Relaesed+From+Shame+-+8+Lang&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":70,"time":1447898507,"description":"Magdalena - Relaesed From Shame\r\n\r\n\r\nDescription:\r\n\r\nLanguages\r\nEnglish, Spanish, French, Mandarin, Korean, Arabic, Portuguese and Russian languages. Subtitles are in English.\r\n\r\nMagdalena: Released From Shame\r\n2008  NR  82 Minutes\r\n\r\nA woman caught in the shameful act of adultery; a social outcast ignored because of her loose lifestyle; a recluse shunned in society for 12 years because of a despicable illness; a widow mourning the loss of her only son. An ugly thread of shame, sorrow and hopelessness painfully weaves its way through each of these women's lives.\r\nAfter spending three years following Jesus, Mary Magdalene has seen it all - lives changed, miracles performed, the sorrow of death and yet the triumph of life. Mary has watched in amazement as Jesus taught a whole new way of looking at life and at people. Jesus radically transformed her own life when he healed her from demon possession, so much so that she became His follower.\r\n\r\nFast forward to A.D. 40.  Although Jesus no longer remains on earth, Mary Magdalene still lives a changed life. Despite His miraculous works and His surprising compassion, not everyone bought into the teachings of this man, Jesus. Skeptical about this supposed Savior, Mary's friend questions her, &quot;The God who created all of this? I doubt He even sees me, much less knows me.&quot;\r\n\r\nIn response, Mary Magdalene passionately retells the details of Jesus' life - from birth, to death, and eventually to resurrection - and how His life continues on in the lives of those who follow Him","torrent":{"xt":"urn:btih:822b05e3503a5487e4605c8923f9f7573ececa15","amp;dn":"The+Bible+Series+2+-+Magdalena+-+Relaesed+From+Shame+-+8+Lang","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"822b05e3503a5487e4605c8923f9f7573ececa15","infoHashBuffer":{"type":"Buffer","data":[130,43,5,227,80,58,84,135,228,96,92,137,35,249,247,87,62,206,202,21]},"announce":[],"urlList":[]}}