{"title":"Phosphoric Acid - Purification, Uses, Technology, and Economics","uid":12915794,"size":13396311,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:84416a3f643422482b88a5660560f087061d9853&amp;dn=Phosphoric+Acid+-+Purification%2C+Uses%2C+Technology%2C+and+Economics&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1449342453,"description":"Phosphoric Acid - Purification, Uses, Technology, and Economics - Rodney Gilmour (CRC, 2014).pdf\r\n\r\nISBN 9781439895160\r\n\r\nThe rise and rationalization of the industrial phosphates industry have gone hand in hand with the development and maturation of technologies to purify phosphoric acid. In the 1960s and 70s, driven by the exponential sales growth of the detergent-builder sodium tripolyphosphate, chemical producers raced to develop processes that would provide a sufficiently pure phosphoric acid feedstock for manufacture to undercut thermal phosphoric acid made from phosphorus. As environmental and political pressure led to a collapse in demand for sodium tripolyphosphate in the 1990s, the commercial pressures to rationalize at plant and corporate levels rose such that only the fittest survived.\r\n\r\n\r\nPhosphoric Acid: Purification, Uses, Technology, and Economics, the first and only book of its kind to be written on this topic, covers the development of purification technologies for phosphoric acid, especially solvent extraction, describing the more successful processes and setting this period in the historical context of the last 350 years. Individual chapters are devoted to the key derivative products which are still undergoing active development, as well as to sustainability and how to approach the commissioning of these plants. The text is aimed at students of chemistry, chemical engineering, business, and industrial history, and to new entrants to the industry","torrent":{"xt":"urn:btih:84416a3f643422482b88a5660560f087061d9853","amp;dn":"Phosphoric+Acid+-+Purification%2C+Uses%2C+Technology%2C+and+Economics","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84416a3f643422482b88a5660560f087061d9853","infoHashBuffer":{"type":"Buffer","data":[132,65,106,63,100,52,34,72,43,136,165,102,5,96,240,135,6,29,152,83]},"announce":[],"urlList":[]}}