{"title":"Office 2016 At Work For Dummies [ePUB + PDF] {{ERTB}}","uid":12962828,"size":94961274,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:84702be0785317db5f0cb3f072fcb4c1ebe8dd0a&amp;dn=Office+2016+At+Work+For+Dummies+%5BePUB+%2B+PDF%5D+%7B%7BERTB%7D%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"erapid","files":4,"time":1449866047,"description":"Office 2016 at Work For Dummies [ePUB + PDF] {{ERTB}}\r\n \nhttp://i.imgur.com/khqdPqK.jpg\r\n\r\n\r\nIt may seem like an eternity since your IT department upgraded you to the latest version of Microsoft Office. Prepare yourself, because Office 2016 is packed with updated features and new ways to increase your productivity in the office! With Office 2016 at Work For Dummies, we make it easy by breaking the content down into over 300 of the most common tasks and operations, providing you with straightforward, simple-to-navigate, approachable information. With four-color illustrations for visual support as your work through the tasks, and then nearly three hours of supporting video, you can choose your path for learning the ins and outs of Office 2016.\r\n\r\nAs the world's leading productivity software, Microsoft Office plays an integral role in the daily lives of professionals. Understanding how to quickly and accurately use Office 2016 can improve your productivity, enhance your deliverables, and provide you with the tools and knowledge you need to be successful.\r\n\r\nChoose your path for learning and explore the fundamental features of Microsoft Office 2016 through task based exercises supported by online video\r\nDive into Microsoft Word by creating a document, formatting paragraphs and pages, and adding tables and graphics\r\nExplore Microsoft Excel's ability to analyze data through creating formulas and functions, and learn to format and print spreadsheets\r\nUse Outlook to organize your work day, and find out how to make amazing PowerPoint presentations using the new features in the 2016 version.\r\nGenre: Non-Fiction, Tech &amp; Devices","torrent":{"xt":"urn:btih:84702be0785317db5f0cb3f072fcb4c1ebe8dd0a","amp;dn":"Office+2016+At+Work+For+Dummies+%5BePUB+%2B+PDF%5D+%7B%7BERTB%7D%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84702be0785317db5f0cb3f072fcb4c1ebe8dd0a","infoHashBuffer":{"type":"Buffer","data":[132,112,43,224,120,83,23,219,95,12,179,240,114,252,180,193,235,232,221,10]},"announce":[],"urlList":[]}}