{"title":"Rent.A.Cop.s01e01.EN.SUB.x264.WEBRIP.[MPup]","uid":12654268,"size":517331331,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:84bb21920992630583076872c0e15093acaa13fd&amp;dn=Rent.A.Cop.s01e01.EN.SUB.x264.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1446198818,"description":"Rent.A.Cop.s01e01.EN.SUB.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\n\r\n\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nSeries following a Darlington-based private security firm. Francis is hired by a local resident to tackle a gang on motorbikes who have been riding dangerously in public areas.\r\n\r\n[img]http://extraimago.com/images/2015/10/30/fba970ff7745982a9486edc1fe9d108e.jpg[/img]\r\n\r\nObservational documentary series following Sparta Security, a Darlington-based private security firm. Sparta is run by well-known local character Francis Jones, who has given behind-the-scenes access to himself, his staff and their operations.\r\nFrancis is a born-again Christian and former professional boxer. He is a man with a big personality and he's on a mission to clean up the streets of Darlington. No job is too small for Sparta Security and Francis often goes the extra mile to help his clients with often outrageous but also hilarious consequences.\r\nFrancis relies on his office team Rachel and Claire, who use their unusual sales techniques to help him find and secure new business. The work they bring in varies from mediating in neighbourhood disputes to guarding against grand larceny at big businesses in the area. Francis employs a number of security staff to work with him, including balaclava-clad ex-forces officers, part-time bouncers and a personal trainer, and together they use a range of unorthodox methods to make Darlington a better place to live.\r\nIn episode one, Francis is hired by a local resident to tackle a gang on motorbikes who have been riding dangerously in public areas, and he arranges a meeting with the local MP Jenny Chapman to discuss the problem. Elsewhere, Francis is interviewing for a new apprentice to help grow the business. He likes to mentor former offenders and appoints a young man called Pembow to the role. Pembow will assist Francis on jobs where a security licence isn't required and joins him on a night-time burglar hunt","torrent":{"xt":"urn:btih:84bb21920992630583076872c0e15093acaa13fd","amp;dn":"Rent.A.Cop.s01e01.EN.SUB.x264.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"84bb21920992630583076872c0e15093acaa13fd","infoHashBuffer":{"type":"Buffer","data":[132,187,33,146,9,146,99,5,131,7,104,114,192,225,80,147,172,170,19,253]},"announce":[],"urlList":[]}}