{"title":"Four.Corners.In.Our.Care.Disability.Provider.Scandals.288p.MPup","uid":12978482,"size":163526382,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:85b8545b0ffc8328263db89a43b61318a4b0a35b&amp;dn=Four.Corners.In.Our.Care.Disability.Provider.Scandals.288p.MPup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":1,"time":1450011160,"description":"Four.Corners.2014.11.24.In.Our.Care.Disability.Provider.Scandals.288p.LDTV.WEBRIP.[MPup]\r\nLow-Definition Television (LDTV) ABC iview WEBRIP: 640x360\r\n\r\nFormat: MPEG-4\r\nSize: 512x288 (with vertical black bars)\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 44.1 KHz\r\n\r\nWhen it comes to people with disabilities, caregivers are supposed to be exactly that - carers, protecting the most vulnerable in our community.\r\n\r\nBut what if managers in a major institution ignored warning signs that staff may have been abusing people in their care, effectively allowing the abuse, including sexual assault, to continue?\r\n\r\n[img]http://extraimago.com/images/2015/12/13/f0a512e03c9e458e5b561b0a1cb5fd37.jpg[/img]\r\n\r\nThis week, in a joint Four Corners/Fairfax investigation, reporter Nick McKenzie lifts the lid on a major scandal involving one of the country's biggest disability providers. How did a respected provider fail in its duty to the people it has sworn to protect and nurture?\r\n\r\nDespite their horrific experiences, a number of disabled people and former staff speak about their treatment. The allegations they make are deeply disturbing.\r\n\r\nThey detail shocking sexual assaults inflicted repeatedly upon numerous disabled clients… with the victims left to fend for themselves, scarred and terrified.\r\n\r\nThey tell how complaints were ignored and whistleblowers targeted, their warnings not acted upon. As a result, two men employed by the organisation - and now allegedly a third - went on to rape and sexually abuse disabled clients.\r\n\r\nAs one person employed by the organisation explains, there were two aspects to the abuse. One involved the assaults and harassment, the other was the failure to act on the warnings and complaints.\r\n\r\n&quot;There was a sort of bunkering down, we don't want any more bad publicity, as much as possible we want to sweep it under the carpet.&quot;\r\n\r\nUsing first-hand testimony from the abused, the whistleblowers and many documents, the program makes it clear the problems did not involve just one facility, but were across an organisation.\r\n\r\nThose who know the disability sector now say the evidence presented demands a full inquiry by the Government to discover the extent of the problem and prevent it happening again in the future","torrent":{"xt":"urn:btih:85b8545b0ffc8328263db89a43b61318a4b0a35b","amp;dn":"Four.Corners.In.Our.Care.Disability.Provider.Scandals.288p.MPup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85b8545b0ffc8328263db89a43b61318a4b0a35b","infoHashBuffer":{"type":"Buffer","data":[133,184,84,91,15,252,131,40,38,61,184,154,67,182,19,24,164,176,163,91]},"announce":[],"urlList":[]}}