{"title":"Stossel.2015.11.20.Threats.to.Liberty.720p.WEBrip","uid":12931496,"size":793845665,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:861c54b4fdca09464513b74392442f290e9c582d&amp;dn=Stossel.2015.11.20.Threats.to.Liberty.720p.WEBrip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BBreach","files":1,"time":1449529764,"description":"Anti-Liberty Politicians\r\nJohn Stossel | November 18, 2015\r\n\r\nAfter a terrorist attack, it's natural to ask: What can politicians do to keep us safe?\r\n\r\nOne thing they could do is actually focus on keeping us safe rather than devoting so much time, energy and hot air to the many things government does instead of protecting lives and property.\r\n\r\nMy state's politicians are particularly bad. New York's legislators regularly go to jail for taking bribes to pass, or not pass, special regulations.\r\n\r\nOne recent governor, Eliot Spitzer, perhaps because his rich father gave him money, didn't take bribes (to my knowledge). Instead, he had sex with prostitutes, meanwhile publicly declaring that sex work was &quot;modern-day slavery.&quot; He then signed a law that increased penalties for people caught doing it. When Spitzer was caught, he resigned. He's a felon, but he managed to avoid jail.\r\n\r\nToday, New Yorkers suffer under a new anti-liberty politician, Attorney General Eric Schneiderman. He hasn't been jailed yet, but the public would be better served if he were. Schneiderman pushes &quot;pro-consumer&quot; laws that win media attention while depriving consumers of good choices.\r\n\r\nSchneiderman has sought to limit wonderful &quot;sharing economy&quot; innovations like Uber and Airbnb. Home-sharing companies let people rent out their apartments while they're away. Ride-hailing companies efficiently bring together customers and products that might have just sat around unused.\r\n\r\nBut to Schneiderman (and economically clueless autocrats in some other states), these innovations are dangerous &quot;unregulated&quot; services. Politicians want politicians to decide what you use your property for.\r\n\r\nAfter Airbnb delighted tourists by giving them better and cheaper vacation experiences, Schneiderman issued a press release announcing that he was &quot;aggressively tackling this growing problem.&quot;\r\n\r\nI suspect his real motive was tackling campaign contributions from hotels and their Democrat-supporting unions. Politicians are also eager to collect hotel taxes, which in New York City, add 15 percent to your bill.\r\n\r\nSchneiderman launched his lawyers at Uber, claiming that the company's &quot;surge&quot; pricing violates price-gouging laws.\r\n\r\nCalling price increases &quot;gouging&quot; is a way politicians mislead consumers into thinking that government must protect us. But competition protects us from unfair prices better than government ever can.\r\n\r\nUber's ever-changing prices ensure cars are available when consumers most want them. No one is tricked into paying a higher price. It's clearly marked on your phone and passengers are given every chance to decline it.\r\n\r\nAttorney General Schneiderman also continued his predecessors' ban on &quot;mixed martial arts&quot; contests. When MMA first became visible, some politicians called it &quot;barbaric&quot; and &quot;unregulated.&quot; Several states banned it, a move some politicians make against most anything new and different.\r\n\r\nBut while states were busy banning it, it became one of the most popular and lucrative sports in America. Smarter states got rid of their bans, but not New York. MMA supporters and the Ultimate Fighting Championship are fighting the ban. May the best man win—and the regulators lose.\r\n\r\nAnd now, after taking campaign contributions from the casino industry, my ambitious attorney general has ordered fantasy football betting companies DraftKings and FanDuel to stop taking bets from New Yorkers. He pompously announced, &quot;Today we have sent a clear message: not in New York and not on my watch.&quot;\r\n\r\nSchneiderman says that fantasy football involves no skill and thus is gambling—illegal under New York law. His argument is nonsense. The games obviously involve skill—people constantly argue about how wise their picks were.\r\n\r\nEither way, who cares? Let people take chances if they want to. New York's own government runs a much worse gambling operation—a state lottery. It clearly involves no skill, preys on poor people and has odds worse than illegal bookies offer.\r\n\r\nNew Jersey Gov. Chris Christie got it right when he yelled at an unctuous CNBC moderator during the second Republican presidential debate: &quot;We have ISIS and al-Qaida attacking us, and we're talking about fantasy football?&quot; Exactly.\r\n\r\nI dream of a world with fewer regulators","torrent":{"xt":"urn:btih:861c54b4fdca09464513b74392442f290e9c582d","amp;dn":"Stossel.2015.11.20.Threats.to.Liberty.720p.WEBrip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"861c54b4fdca09464513b74392442f290e9c582d","infoHashBuffer":{"type":"Buffer","data":[134,28,84,180,253,202,9,70,69,19,183,67,146,68,47,41,14,156,88,45]},"announce":[],"urlList":[]}}