{"title":"Jane Austen - Northanger Abbey - Svensk","uid":12623323,"size":437289330,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:87ddd7529a4c18385580077a30c13b872b3fad9f&amp;dn=Jane+Austen+-+Northanger+Abbey+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"totomas1","files":86,"time":1445632353,"description":"Jane Austen - Northanger Abbey\r\n\r\nJane Austens första stora roman Northanger Abbey, som inte utkom förrän efter hennes död, är en frän drift med tidens populära skräckromaner liksom med den societet hon alltid älskade att häckla.\r\n\r\nRomanens hjältinna heter Catherine Morland och hon är nyligen introducerad i societeten. Under en vistelse i staden Bath får hon många nya bekanta. Bland annat den jämnåriga miss Thorpe med vilken hon delar sitt stora intresse för romaner, något man inte kan diskutera med vem som helst.\r\nDe unga damerna pratar om allt väsentligt: kvällens bal, morgondagens promenad, en viss ung mans uppförande.\r\n\r\nUnder en bal i inledningen av sin vistelse har Catherine nämligen blivit presenterad för en mr Tilney. När han bjuder upp henne blir hon mycket smickrad, då han är både stilig och spirituell men dagen efter balen är han försvunnen. Efter flera dagars bortovaro återvänder han dock och Catherine börjar genast förhöra sig lite försiktigt hos hans syster och söker sig allt oftare till hennes sällskap.\r\nDetta ses inte med helt blida ögon av miss Thorpe, det blir rent av lite spänt vid flera tillfällen.\r\n\r\nNär så Catherine blir medbjuden av familjen Tilney att tillbringa en tid på deras gods tackar hon andlöst ja. Väl framme vid Northanger Abbey tycker hon sig ställd inför den gotiska litteraturens alla otäcka scenarier och föreställer sig det värsta. Lyckligtvis bistås hon av ett sunt förnuft, och den oemotståndlige Henry Tilney.\r\n\r\nNorthanger Abbey är en klassisk Jane Austen-roman, fylld av intriger och förvecklingar. Den fick vänta länge på publicering och kom ut flera år efter både Förnuft och känsla och Stolthet och fördom men hennes skildringar av sin tids mellanmänskliga förehavanden är minst lika briljanta här som i dem.\r\n\r\n\r\nUppläsare: Johanna Fridell\r\n\r\nAll creds to original ripper","torrent":{"xt":"urn:btih:87ddd7529a4c18385580077a30c13b872b3fad9f","amp;dn":"Jane+Austen+-+Northanger+Abbey+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87ddd7529a4c18385580077a30c13b872b3fad9f","infoHashBuffer":{"type":"Buffer","data":[135,221,215,82,154,76,24,56,85,128,7,122,48,193,59,135,43,63,173,159]},"announce":[],"urlList":[]}}