{"title":"Minions Paradise v6.1.2350 Mod apk v6.0.2295","uid":12951181,"size":92702653,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:898f946ec17ed0db700d0bbdea7c01ac4845c5ca&amp;dn=Minions+Paradise+v6.1.2350+Mod+apk+v6.0.2295&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tiropitaki","files":1,"time":1449729445,"description":"Minions Paradise v6.1.2350 (Mod) v6.0.2295\r\n\r\nJoin the Minions on the vacation of a lifetime! Watch as a lovable-yet-bumbling Minion named Phil accidentally sinks an entire cruise ship carrying his vacationing Minion buddies. To redeem himself, Phil must turn a deserted tropical island into the perfect vacation destination. Illumination Entertainment – the creators of the MINIONS movie – and EA invite you to help Phil build his ultimate Minions Paradise.\r\n\r\nPARTY WITH YOUR FAVORITE MINIONS\r\nBreak out the tiny umbrellas and crack open some coconuts. Phil’s turning the island into a party-paradise, and you’re invited – along with Kevin, Stuart, and Bob from the MINIONS movie. Help Phil throw incredible Minion parties and transform your island into the perfect getaway. Pass the flamethrower!\r\n\r\nUNLEASH YOUR CREATIVITY\r\nCustomize your island with hot tubs, hammocks, and beach volleyball courts, all with brand-new Minion animations. Plant firefly trees, harness power from electric eels, and grow bushels of bananas to make an unforgettable island for Phil and his Minion buddies.\r\n\r\nEXPLORE YOUR PARADISE\r\nThe more land you get, the more fun your Minions will have! You can also become an expert at alligator waterskiing, dive off waterslides, and much more.\r\n\r\nTAKE VILLAINOUS VACATIONS\r\nAll Minions need a villainous boss to serve! Aid Phil in building a special resort for all your favorite villains from the MINIONS movie. Help these villains enjoy paradise while putting their own dastardly plans into motion.\r\n\r\nWhat’s New:\r\n- New crazy animal characters: Froggy, Moggy, Piggy, Dino and more\r\n- Brand new World 7\r\n- Santa hats for characters\r\n- Better rescue position after using save token\r\n- Holiday icon\r\n\r\nHacks:\r\n1. Get Massive xp everytime u build a decoration\r\n*Need to be level 3 to build decorations.* \r\n\r\nThe mod will not work if it is installed on a google version.\r\nRequires Android: 4.1+","torrent":{"xt":"urn:btih:898f946ec17ed0db700d0bbdea7c01ac4845c5ca","amp;dn":"Minions+Paradise+v6.1.2350+Mod+apk+v6.0.2295","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"898f946ec17ed0db700d0bbdea7c01ac4845c5ca","infoHashBuffer":{"type":"Buffer","data":[137,143,148,110,193,126,208,219,112,13,11,189,234,124,1,172,72,69,197,202]},"announce":[],"urlList":[]}}