{"title":"Sale of Goods Act 2002","uid":12657369,"size":1855971,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89c553986f4a029b55d48b9645a96e212007e05b&amp;dn=Sale+of+Goods+Act+2002&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tricky29","files":1,"time":1446247934,"description":"This might just be of value to those people who get ripped off by companies/shops etc who give you the same old BS  &quot;you only got a year guarantee mate&quot; trades people who rip you off and second hand car sales people. the list goes on, but almost no-one is aware of their rights and this legislation might be very valuable to you. the OFT, while it existed, reckoned people in the UK get ripped off by two thousand million pounds every year. i know the act was updated on 1st oct this year, but i haven't got around to looking at this yet (can't be arsed right now  lol) i have this on my phone just in case some person tries to pull the wool over my eyes. so i can let them read the relevant section. then watch their face turn red when the penny drops. so next time you get something that breaks after a year or two and you take it back to the shop (you don't actually have to, they have to arrange for collection if it's faulty, if you insist) and they give you the same BS you've always had. just educate them as to their legal responsibilities and watch them explode. they just love getting you to part with your money so you can buy more trash from them. hope this will upload, many torrents i try to upload fail for some reason. i'm really crap at following instructions","torrent":{"xt":"urn:btih:89c553986f4a029b55d48b9645a96e212007e05b","amp;dn":"Sale+of+Goods+Act+2002","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89c553986f4a029b55d48b9645a96e212007e05b","infoHashBuffer":{"type":"Buffer","data":[137,197,83,152,111,74,2,155,85,212,139,150,69,169,110,33,32,7,224,91]},"announce":[],"urlList":[]}}