{"title":"The Greatest - Malcolm Knox","uid":12928676,"size":7256428,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8cbaea339bac5cb404260098d31b6b8fc8dbe1f0&amp;dn=The+Greatest+-+Malcolm+Knox&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1449497574,"description":"From 1993 to 2008 the Australian cricket team reached the highest of heights. They won three world cups in a row and sixteen consecutive test matches. They continually dominated England in the Ashes, destroyed the once great West Indies, who had defeated them constantly, and outplayed South Africa and India, both at home and abroad. The 2003 and 2007 world cups Australia won without losing a match the entire campaign. Australians were glued to their television screens. Legend after legend stepped onto the pitch: Mark Taylor, Steve and Mark Waugh, Adam Gilchrist, Glenn McGrath, Jason Gillespie, Damien Martyn, Justin Langer, Brett Lee, Ricky Ponting, Michael Hussey and, of course, the once-in-a-lifetime-player Shane Warne - perhaps the greatest cricketer ever. It was an unprecedented run of success, even surpassing the achievements of Don Bradman's Invincibles and the rampaging West Indies of the 1970s and '80s. As Australia enters a period of rebuilding, The Greatest reflects on the golden age of Australian cricket. It revisits the key moments, major players and personalities, and important influences, match by match. With 100 full-colour photos throughout, The Greatest is a celebration of a truly phenomenal era - the greatest era in Australian cricket history","torrent":{"xt":"urn:btih:8cbaea339bac5cb404260098d31b6b8fc8dbe1f0","amp;dn":"The+Greatest+-+Malcolm+Knox","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cbaea339bac5cb404260098d31b6b8fc8dbe1f0","infoHashBuffer":{"type":"Buffer","data":[140,186,234,51,155,172,92,180,4,38,0,152,211,27,107,143,200,219,225,240]},"announce":[],"urlList":[]}}