{"title":"Autumnwatch.2015-Complete--BBC","uid":12793921,"size":13234665472,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:8e6dc44fa3a9dd8a81f8cb390306e3e8ad73a220&amp;dn=Autumnwatch.2015-Complete--BBC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uggauga","files":25,"time":1447948805,"description":"\nSpringwatch, Autumnwatch and Winterwatch are annual BBC television series which chart the fortunes of British wildlife during the changing of the seasons in the United Kingdom. The programmes are broadcast live from locations around the country in a primetime evening slot on BBC Two and BBC Two HD. They require a crew of 100 and over 50 cameras, making them the BBC's largest British outside broadcast events. Many of the cameras are hidden and operated remotely to record natural behaviour, for example, of birds in their nests and badgers outside their set.\r\n\r\nUnsprung\r\nSince the Springwatch 2009 season, which aired from Pensthorpe in Norfolk, the Springwatch and Autumnwatch series have been accompanied by a live Unsprung programme, a half-hour show that airs once a week and answers viewers' wildlife questions, along with audience surveys and &quot;pub quizzes&quot; filmed in the main studio.[32]\r\n________________________________________________\r\n\r\nAutumnwatch, 2015\r\nAutumnwatch is back, live from a brand new location - the Wildfowl &amp; Wetland Trust Caerlaverock Reserve in the beautiful south west of Scotland. Chris Packham, Michaela Strachan and Martin Hughes-Games watch the action unfold as resident badgers and otters prepare for winter. Elsewhere, the red deer rut goes into nocturnal overdrive, and the country is invaded by hundreds of thousands of swans and geese.\r\n\r\nAutumnwatch Unsprung, 2015\r\nAutumnwatch Unsprung returns with a mix of special guests, audience interaction and viewers' questions and comments. Chris Packham hosts and talks to a local expert about the area around Caerlaverock and why the show has moved here, and Lindsey Chapman is on hand to review what the audience has been up to over the summer.\r\n________________________________________________\r\n\r\n832x486 or 1280x720 resolution - the best the BBC would let me download at for each episode, respectively.\r\n\r\nEnjoy !!","torrent":{"xt":"urn:btih:8e6dc44fa3a9dd8a81f8cb390306e3e8ad73a220","amp;dn":"Autumnwatch.2015-Complete--BBC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e6dc44fa3a9dd8a81f8cb390306e3e8ad73a220","infoHashBuffer":{"type":"Buffer","data":[142,109,196,79,163,169,221,138,129,248,203,57,3,6,227,232,173,115,162,32]},"announce":[],"urlList":[]}}