{"title":"Asterix 36 - Der Papyrus des Cäsar (Ehapa 2015-10)","uid":12629324,"size":167947575,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9109439683f9bd349636950636d7c5f651f3e0b0&amp;dn=Asterix+36+-+Der+Papyrus+des+C%26auml%3Bsar+%28Ehapa+2015-10%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1445816081,"description":"48 Seiten\r\nVerlag: Egmont Comic Collection (22. Oktober 2015)\r\nSprache: Deutsch\r\nISBN-10: 3770438906\r\nISBN-13: 978-3770438907\r\n\r\nCBR\r\n\r\n\r\nTitelgebend für den Band ist das reale Werk De bello Gallico, eine lange Papyrusrolle, in dem Cäsar seine erfolgreichen Feldzüge gegen die Gallier beschreibt. \r\n\r\nIm Comic enthält es jedoch das fiktive Kapitel „Rückschläge im Kampf gegen die unbeugsamen Gallier in Aremorica“, womit die gallische Sippe der beiden Helden der Comicreihe, Asterix und Obelix, gemeint ist. In Einverständnis mit Cäsar lässt ein römischer Zensor namens Syndicus diese Passage zunächst entfernen. Der numidische Schreiber Bigdatha gibt eine Abschrift der unzensierten Version an den gallischen Kolporteur Polemix weiter, der die Schriftrolle in das Dorf von Asterix und Obelix trägt. \r\n\r\nHäuptling Majestix ist die Lüge, dass „ganz Gallien“ unter römischer Herrschaft stünde, zunächst egal, bis ihn seine Ehefrau Gutemine anbrüllt, diese Unwahrheit zu bekämpfen. \r\n\r\nAsterix, Obelix und der Druide Miraculix gehen in den Karnutenwald und geben die Papyrusrolle mit der unzensierten Version von De bello Gallico weiter an Archaeopterix, den Hüter des gallischen Wissens. \r\n\r\nSyndicus versucht mittlerweile, dieses Leck durch Propaganda und Spionage zu vertuschen, und verwickelt sich gegenüber Cäsar immer weiter in ein Lügengebäude. \r\n\r\nAls seine Römer und er Polemix gefangen nehmen, drohen sie dem gallischen Dorf an, ihn umzubringen, wenn sie nicht ihre Papyrusrolle aufgeben. Die Gallier scheinen verloren, da Asterix, Obelix und Miraculix abwesend sind, sie werden aber rechtzeitig durch den gallischen Nachrichtendienst alarmiert, das u.a. auf dem Röhrophon des Barden Troubadix, fleißiger Mund-zu-Mund-Propaganda und auf fiependen Eichhörnchen basiert. \r\n\r\nEs kommt zu einem großen Kampf der Römer gegen die Gallier, in dem sich u.a. Syndicus und Polemix um die unzensierte Papyrusrolle prügeln. Plötzlich erscheint Cäsar, der Syndicus des Amtes enthebt, da er ihn mit seiner Schlamperei beinahe vor dem römischen Senat blamiert hat. Im Austausch für Polemix und dem Versprechen, dass Kolporteure nicht mehr verfolgt werden, übergibt Häuptling Majestix die unzensierte Papyrusrolle an Cäsar. \r\n\r\nDie eigentliche Geschichte endet mit dem traditionellen Festbankett der Gallier. Im Nachwort wird erzählt, dass zunächst nur die zensierte Version von De bello Gallico in die Geschichte einging, aber die Pointe des Albums ist, dass die unzensierte Variante durch Überlieferung von gallischen Druiden bis ins 20. Jahrhundert überlebte. Sie wurde von „zwei talentierten Autoren in Paris namens René und Albert“ zum Comic Asterix der Gallier und vielen Nachfolgebänden verwertet","torrent":{"xt":"urn:btih:9109439683f9bd349636950636d7c5f651f3e0b0","amp;dn":"Asterix+36+-+Der+Papyrus+des+C%26auml%3Bsar+%28Ehapa+2015-10%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9109439683f9bd349636950636d7c5f651f3e0b0","infoHashBuffer":{"type":"Buffer","data":[145,9,67,150,131,249,189,52,150,54,149,6,54,215,197,246,81,243,224,176]},"announce":[],"urlList":[]}}