{"title":"Advances in Planar Lipid Bilayers and Liposomes Vol. 15","uid":12631568,"size":6318171,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93aa1dcad5b47af8379864b672cf774dbf4475a6&amp;dn=Advances+in+Planar+Lipid+Bilayers+and+Liposomes+Vol.+15&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1445852419,"description":"Advances in Planar Lipid Bilayers and Liposomes Vol. 15 (Elsevier, 2012).pdf\r\n\r\nISBN 9780123965332\r\n\r\nVolume 15 of Advances in Planar Lipid Bilayers and Liposomes (APLBL) is dedicated to studies of the effects of active molecules on the physical properties of lipid bilayers such as lateral lipid molecules mobility along the lipid bilayer surface, spontaneous pore formation, or interfacial water dynamics. Different experimental methods (such as the flickering technique) and theoretical methods (molecular dynamics simulations) for determination of bending elastic properties of lipid bilayer were described. The impact of the binding of various molecules in the lipid bilayer (such as sterols, salts, or charged molecules) on the membrane elasticity is also discussed. In addition, the dependence of the membrane elastic properties on the chain length and saturation of the lipid is presented. Further, a new computer method to study the shapes of giant lipid bilayer vesicles is described and different methods for multiscale modeling and simulation of lipid bilayers and membranes are reviewed. In the more biologically oriented chapters, the possible role of the membrane rafts in the structure and function of cell junctions is discussed. The cell membrane represents a barrier for gene delivery; therefore different techniques of transfer of DNA across the cell membrane are subject of increasing interest. In this volume of APLBL, the electropermeabilization technique in which an external electric field is applied across the cell membrane to induce the pore formation (electropermeabilization) is described in detail","torrent":{"xt":"urn:btih:93aa1dcad5b47af8379864b672cf774dbf4475a6","amp;dn":"Advances+in+Planar+Lipid+Bilayers+and+Liposomes+Vol.+15","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93aa1dcad5b47af8379864b672cf774dbf4475a6","infoHashBuffer":{"type":"Buffer","data":[147,170,29,202,213,180,122,248,55,152,100,182,114,207,119,77,191,68,117,166]},"announce":[],"urlList":[]}}