{"title":"twenty","uid":12795316,"size":3073423650,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9462febc97efdff4f2c5f4a761bb6c29a88cbea7&amp;dn=twenty&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1447971255,"description":"20 ten´s was compiled from the perfect UCI vids which appeared right after this tour\r\n\r\nIt contains the best ´´special´´ performances, songs which were rarely performed or performed in a different manner. All thanks to UCI and the original recorders, this compilation was made by a friend for private use but I think it´s worth sharing.\r\n\r\nTorrent will be up as long as there are seeders\r\n\r\nSongs peformed\r\n\r\n** Controversy (Antwerp). Included because of the intro\r\n\r\n** Empty Room (Herning). No explanation needed, rare song, perfect HQ video\r\n\r\n** Stratus (Herning). At the time it was a rarity but this performance wit Sheila E is still special\r\n\r\n** Future Soul Song (Copenhagen). Same\r\n\r\n** We Party Hearty/ Which Way is Up (Arnhem ''pre-show''). Was included for the intro to 2nd song which is probably funkiest moment on the whole Tour!\r\n\r\n** The Love We Make, highlight of probably the best show of the tour\r\n\r\n** Shh (Arnhem); she's probably STILL speechless....\r\n\r\n** Crimson and Clover (Berlin). just because it will probably never be played anymore\r\n\r\n** Forever In My Life/ Act Of God. Half a year after the release a much better version of this show appeared but this is still an absolute stunner. Act of God is a an absolute rarity, probably the only time it was played live EVER. Hunt down the final Berlin video for the perfect version\r\n\r\n**Dreamer (Antwerp). One of those songs nobody cared about at the time but listening now it's brilliant\r\n\r\n** I feel For You/ A Love Bizarre. Not rare at all but Prince has hardly ever been THIS relaxed on stage before and after. Nice inclusion\r\n\r\n** Peach (Rome). Included for the HQ and the brilliant mocking of Keith Richards' guitar playing and a testament to his playing songs long after half of the stadium has left, and to show contrast to the other side of his performance spectrum :\r\n\r\n** Sometimes It Snows in April (Bergen). Pure. Simple. Genius\r\n\r\n** Beautiful Strange/Miss You (Paris).\r\n\r\n** ''Bonus''","torrent":{"xt":"urn:btih:9462febc97efdff4f2c5f4a761bb6c29a88cbea7","amp;dn":"twenty","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9462febc97efdff4f2c5f4a761bb6c29a88cbea7","infoHashBuffer":{"type":"Buffer","data":[148,98,254,188,151,239,223,244,242,197,244,167,97,187,108,41,168,140,190,167]},"announce":[],"urlList":[]}}