{"title":"Escobar Season 01","uid":12930100,"size":35596627092,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:957996d054ead9193eaafecf176b11435002084c&amp;dn=Escobar+Season+01&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"aldamirpustnovich","files":114,"time":1449512884,"description":"ner vivo a Herber.\r\nEpisodio-47: Marcos Herber es capturado por la policía.\r\nEpisodio-48: Escobar burla a las autoridades.\r\nEpisodio-49: Escobar vende a sus propios hombres.\r\nEpisodio-50: Mauricio, muy cerca de descubrir la traición de Pablo.\r\nEpisodio-51: Escobar le entrega un falso positivo al Coronel Pedregal.\r\nEpisodio-52: Escobar anuncia una nueva guerra.\r\nEpisodio-53: Explotan petardos en Drogas El Rebajón.\r\nEpisodio-54: Pedro Motoa es detenido.\r\nEpisodio-55: El Cartel de Cali prepara un atentado contra Escobar.\r\nEpisodio-56: El Marino asesina a Yesenia.\r\nEpisodio-57: Motoa es dejado en libertad.\r\nEpisodio-58: Atentan contra Pablo Escobar y su Familia.\r\nEpisodio-59: Escobar no deja que su cabeza tenga precio.\r\nEpisodio-60: Secuestran a Andrés Pastrana.\r\nEpisodio-61: Escobar le da la cara a Pastrana.\r\nEpisodio-62: La guerra se recrudece entre el Estado y los narcos.\r\nEpisodio-63: Anuncian el asesinato del Procurador General de la Nación.\r\nEpisodio-64: La furia y los celos, los peores enemigos de Escobar.\r\nEpisodio-65: Pablo Escobar desata toda su furia.\r\nEpisodio-66: El Mariachi prepara un plan siniestro.\r\nEpisodio-67: Nuevas víctimas del terror de Pablo Escobar.\r\nEpisodio-68: El Coronel Quintana no tiene salida.\r\nEpisodio-69: El Coronel Quintana es asesinado.\r\nEpisodio-70: Pese a las advertencias, Galán decide ir a Soacha.\r\nEpisodio-71: El crimen que hizo reaccionar al país.\r\nEpisodio-72: El país se conmociona con la pérdida del candidato presidencial.\r\nEpisodio-73: El Gobierno se compromete a dar con los asesinos.\r\nEpisodio-74: Ana Maria Cano busca la seguridad de El Espectador.\r\nEpisodio-75: Atentan contra El Espectador.\r\nEpisodio-76: El Espectador sigue adelante.\r\nEpisodio-77: Cae el primer miembro de la familia de Escobar.\r\nEpisodio-78: Escobar ordena dos grandes atentados.\r\nEpisodio-79: Peraza recibe un sobre bomba.\r\nEpisodio-80: Un cruel y atroz atentado conmociona a Colombia.\r\nEpisodio-81: Atentan contra el edificio del DAI.\r\nEpisodio-82: El narcoterrorismo no triunfará.\r\nEpisodio-83: El grupo élite, tras las huellas del Mariachi.\r\nEpisodio-84: El grupo élite y el Mariachi se enfrentan.\r\nEpisodio-85: Las autoridades dan de baja al Mariachi.\r\nEpisodio-86: Escobar envía un mensaje al Gobierno.\r\nEpisodio-87: Los extraditables aceptan el llamado de paz.\r\nEpisodio-88: Cancelan las negociaciones de paz.\r\nEpisodio-89: Escobar le pone precio a los policías.\r\nEpisodio-90: Cae otro candidate presidencial.\r\nEpisodio-91: Escobar emprende la guerra contra Pabón.\r\nEpisodio-92: Escobar revela las intenciones de las Autodefensas.\r\nEpisodio-93: Atentan contra Pizano, ponen precio a la cabeza de Escobar.\r\nEpisodio-94: Pabón recibe una jugoza propuesta.\r\nEpisodio-95: Cae el Chili, mano derecha de Escobar.\r\nEpisodio-96: Las autoridades, cada vez más cerca de Escobar.\r\nEpisodio-97: Luego de varios días en la selva, Pablo decide atacar.\r\nEpisodio-98: Gonzalo Gaviria cae en enfrentamiento con el grupo élite.\r\nEpisodio-99: Diana Turbay cae en las garras de Pablo Escobar.\r\nEpisodio-100: Turbay es secuestrada por orden de Escobar. \r\nEpisodio-101: Maruja y Benerice, víctimas del patrón del mal.\r\nEpisodio-102: Los Motoa se entregan.\r\nEpisodio-103: Diana Turbay muere en su rescate.\r\nEpisodio-104: Un sacerdote será intermediario para la paz.\r\nEpisodio-105: Escobar planea entregarse.\r\nEpisodio-106: Escobar se entrega a las autoridades.\r\nEpisodio-107: El Cartel de Cali quiere negociar con Escobar.\r\nEpisodio-108: Escobar sigue deliquiendo desde la Catedral.\r\nEpisodio-109: El Gobierno autoriza la creación de un Bloque de Búsqueda.\r\nEpisodio-110: Entrega de Peluche y Marino.\r\nEpisodio-111: Escobar se despide de su familia y entra en depresión.\r\nEpisodio-112: Los Pepes atentan contra la familia Escobar.\r\nEpisodio-113: Muerte del Capo","torrent":{"xt":"urn:btih:957996d054ead9193eaafecf176b11435002084c","amp;dn":"Escobar+Season+01","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"957996d054ead9193eaafecf176b11435002084c","infoHashBuffer":{"type":"Buffer","data":[149,121,150,208,84,234,217,25,62,170,254,207,23,107,17,67,80,2,8,76]},"announce":[],"urlList":[]}}