{"title":"Crusaders Quest v2.0.7.KG Apk + Mod","uid":12919649,"size":55486984,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:96adfa4a40a878fa165472d944e3dff2c705fdac&amp;dn=Crusaders+Quest+v2.0.7.KG+Apk+%2B+Mod&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tiropitaki","files":2,"time":1449401992,"description":"Crusaders Quest v2.0.7.KG Apk + Mod\r\n\r\nMatch your way to victory in the new epic action RPG from TOAST, Crusaders Quest! Collect and control over 200 heroes, make real-time puzzle matches, and defeat waves of monsters in an epic quest to save the planet before it falls to the forces of evil!\r\n\r\n***Battle the Corrupted Soltar***\r\nTake your heroes to the 8th floor of the Fortress of Souls to confront the Apostle and Master of Souls, Lord Soltar. Put a stop to this warlord's corrosive magic and take his bounty of Iron, Crystals, and Soulbound Weapons for your own!\r\n\r\n***Answer the Call***\r\nOnly you and your ragtag group of 16-bit crusaders can journey to save the Goddesses and unlock their special powers to repel a mysterious witch's darkness from the land. Travel through the thick forest, across the blazing desert, under the waves of the ocean, through the heart of a volcano, and traverse the frozen tundra to find the Goddesses.\r\n\r\n***Matching Puzzle Battles***\r\nReal-time and fast paced puzzle combat! Match your heroes' skill blocks to quickly decimate your foes. The more matches you make, the more devastating your attacks will be. Fill your power meter to deliver character specific special moves like the Archer's Flaming Arrows or the Paladin's Earth-Shattering Smash!\r\n\r\n***Fight to the Final Breath***\r\nAfter strengthening your heroes, take them into epic PVP battles to test your strength against the world! With over 200 heroes to collect, there's no limit to the combinations of crusaders you can take into battle! Find the winning combination and climb to the top ranks of our global PVP leaderboard.\r\n\r\n***Quest for the Goddesses***\r\nFind the center of the monster madness in the world. Follow the trail of elemental magic as you rescue more Goddesses from their epic fight with evil. Team up with the heroines as you sweep out the rampaging beasts and wipe the wild corruption from the world.\r\n\r\n***Recruit Classic Dungeon-Crawlers***\r\nPlay 6 unique classes and recruit over 200 unique heroes, each with their own strengths on the pixelated battlefield. Choose the Warrior for power, the Wizard for magical force, the Hunter for precision, the Archer for striking speed, the Priest for healing, or the Paladin for the holy might! \r\n\r\nWhat's new:\r\n- Ep 6. Update\r\n- 36 New Types of Normal Hero Update\r\n- New Master Hero Update\r\n- New Soulbound Weapon Updated (Isabel, V, Magnus, Wilhelm, Necron, Dara)\r\n- Fortress of Souls 9th Floor Update\r\n- Optimization and Various Bugs Fixed\r\n- Minor Updates.\r\n\r\nRequires Android: 3.0+","torrent":{"xt":"urn:btih:96adfa4a40a878fa165472d944e3dff2c705fdac","amp;dn":"Crusaders+Quest+v2.0.7.KG+Apk+%2B+Mod","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96adfa4a40a878fa165472d944e3dff2c705fdac","infoHashBuffer":{"type":"Buffer","data":[150,173,250,74,64,168,120,250,22,84,114,217,68,227,223,242,199,5,253,172]},"announce":[],"urlList":[]}}