{"title":"The Bible Series 2 - The Gospel of John","uid":12781496,"size":2644782780,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:97ac6e7e1ef4f1d9261a15333c25e5693bc43465&amp;dn=The+Bible+Series+2+-+The+Gospel+of+John&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":3,"time":1447792836,"description":"The Bible Series - The Gospel of John\r\n\r\n\r\nOn the face of things, The Gospel of John seemed like it would be a difficult narrative to convincingly bring to life on the silver screen. For starters, how would they get an audience to sit still for the all-talk-and-no-action Farewell Discourses in John 14-17, not to mention other long discourses in John's gospel?\r\n\r\nThen there is the difficulty of the Johannine Jesus, whom Bible scholar Ernst Kasemann once said &quot;bestrides the stage of this Gospel like a colossus, as a deity.&quot; How do you convincingly portray Jesus saying things like &quot;before Abraham was, I am&quot; and make it believable in an early Jewish setting—coming from a truly human being? How do you convince the audience that this is the same Jesus of the other Gospels, when John's gospel has no exorcisms, few if any parables, no Sermon on the Mount, no birth narratives, and Jesus spends more time in Judea than in Galilee?\r\n\r\nHow do you pull this off when the screenplay is a verbatim transcript of the Good News translation of this Gospel—with no words added or subtracted? How do you successfully weave together the voice of the narrator and the dialogue of the characters in the drama?\r\nThe Gospel of John\r\n\r\nThe Gospel of John\r\n\r\nDespite these and other daunting challenges, this first ever full-length film on the Gospel of John is a convincing and powerful portrayal of the Johannine Jesus. It's not the first film in the Visual Bible series (Matthew and Acts are among the others), but it is decidedly the first that involves world-class actors (culled from the Royal Shakespeare company and elsewhere), a world-class actor turned narrator (Christopher Plummer), and world-class producers and cinematographers. The film's beautiful soundtrack to the movie is of equally high quality, and involves replicas of musical instruments used in Jesus' day.\r\n\r\nIt all adds up to what I think is the best portrayal of Jesus ever offered in a feature length film.\r\n\r\nInterestingly, this beautifully shot film (mostly filmed in Spain with the Temple scenes filmed in a studio in England) was financed by a wealthy Jewish Canadian. Various biblical scholars—led by Dr. Peter Richardson of Toronto—were on the committee to assure its authenticity.\r\n\r\nThe film runs some three hours, and the DVD package comes with two discs of the film, and a third disc of background information, interviews with the principles and some wonderful extras like maps and much more.\r\n\r\nAnd though the film is a stunning success, that's not to say it is without its weaknesses. If you were to compare the Passion narrative as portrayed in this film to Franco Zeffirelli's 1977 portrayal in Jesus of Nazareth, I think you would come away finding the Zeffirelli version more compelling and having more pathos. It is a fair comparison since Zeffirelli largely follows John's gospel in his portrayal of Jesus before Pilate and Jesus on the cross.\r\nThe Gospel of John\r\n\r\nThe Gospel of John\r\n\r\nThe crucifixion scene is relatively bloodless in The Gospel of John (a deficiency Mel Gibson's The Passion of The Christ makes up for in spades). Furthermore, the portrayal of Lazarus' resurrection is more telling and more dramatically rendered in Zeffirelli's film than in this one","torrent":{"xt":"urn:btih:97ac6e7e1ef4f1d9261a15333c25e5693bc43465","amp;dn":"The+Bible+Series+2+-+The+Gospel+of+John","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97ac6e7e1ef4f1d9261a15333c25e5693bc43465","infoHashBuffer":{"type":"Buffer","data":[151,172,110,126,30,244,241,217,38,26,21,51,60,37,229,105,59,196,52,101]},"announce":[],"urlList":[]}}