{"title":"Tricky Spa - Jenna Reid, Jack Vegas","uid":12784076,"size":687455217,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:9aa973bbb501429c5f42cec71a2de822cb4a0931&amp;dn=Tricky+Spa+-+Jenna+Reid%2C+Jack+Vegas&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"eliotmali","files":3,"time":1447846086,"description":"\n \nhttp://imgtpb.com/img-564c525482b5f.html\r\n  \nhttp://imgtpb.com/img-564c5254b1a8e.html \r\n\r\n\r\n\r\nJenna Reid, Jack Vegas - Can I See More? (18/11/2015)\r\n\r\nStep daughter Jenna Reid asks her father Jack Vegas if it is alright to go to the mall today and with no objections Jack gives her permission. He is glad that he can have some alone time so surf the internet and masturbate over hot chicks. Unfortunately, Jack is interrupted as Jenna walks back in, catching him with his pants down, cock exposed. She runs to her bedroom not knowing what her virgin eyes just witnessed. Jack follows her, apologizing for what she saw, explaining that things between him and her mother aren't going very well sexually, and this is the only way he can relieve his needs. Jenna feels bad for her father and offers him a massage to relieve him for all his stress. Although Jenna knows Jack is married to her mom, she cannot resist to know what it would be like to watch a man masturbate. She persuades her father to show her how he likes to please himself with images of young women and if he doesn't do exactly what she asks, she will tell her mommy. Jenna wants to see it grow, and pleads with Jack to shove it in her mouth. She loves the feeling of his cock getting bigger in her mouth but she wants more, she wants him to fuck her tight pussy, demanding he fuck her deep and hard, aware that she is pleasing her daddy's cock.\r\n\r\nSize: 655.41 MiB\r\nTime: 00:18:24\r\nFormat: MP4","torrent":{"xt":"urn:btih:9aa973bbb501429c5f42cec71a2de822cb4a0931","amp;dn":"Tricky+Spa+-+Jenna+Reid%2C+Jack+Vegas","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9aa973bbb501429c5f42cec71a2de822cb4a0931","infoHashBuffer":{"type":"Buffer","data":[154,169,115,187,181,1,66,156,95,66,206,199,26,45,232,34,203,74,9,49]},"announce":[],"urlList":[]}}