{"title":"HotLegsAndFeet - Vinna Reed (Carnal Affection, Psychologist Sedu","uid":12646773,"size":2227510659,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:9ac2e65aa8ae93d579f098d3b667df3ce9a832c8&amp;dn=HotLegsAndFeet+-+Vinna+Reed+%28Carnal+Affection%2C+Psychologist+Sedu&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EndYou","files":1,"time":1446069590,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/image/Zrr \nhttp://imgpremium.com/image/Zrv \r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nThe name of the actress: Vinna Reed\r\nName movie: Carnal Affection: Psychologist Seduces Foot Fetish Lover\r\nNPP site and the site: HotLegsAndFeet.com / DDFNetwork.com\r\n\r\nYear: 2015\r\nGenre: Feet, Stockings, Gonzo, Hardcore, All Sex\r\nDuration: 00:44:22\r\n\r\nVinna Rees is a well-known psychologist in the Czech Republic. Her therapy methods are pretty uncommon but her clients and patients appreciate her gentle healing methods. Today, it's Lutro's appointment and after a couple of minutes on the couch, talking to the doc, the carnal affection hits the blonde hot babe and she puts one leg onto the therapy couch, so Lutro can enjoy her toned calves and lick her white nylon stockings. The carnal affection towards her patients makes the psychologist seduce her clients for some foot fetish treatment.\r\n\r\nAfter licking her legs and shoes, she gives Lutro a blowjob and he takes off one of her high heels to take a deep sniff of that irresistible scent of carnal desire. He rubs his helmet on her shoe's heel and Vinna gives him a foot job. Today's episode of DDF Network's Hot Legs &amp; Feet series heats up when she gives him some face sitting and he sucks her moist shaved pussy and clit while Vinna massages his shaft with her foot soles.\r\n\r\nFinally, he fucks her hot pussy and she rides him like a cowgirl before he bangs her twat doggy style while sucking her toes and licking her soles. Lutro peels off her nylon stockings and enjoys sucking her naked toes before cramming her tight fuckhole one more time from behind. The doc then grabs his boner with her feet and wanks off that hard prick until he blows his cum all over her feet. Meanwhile, Vinna gives us some pussy gape. Check out the closeups below in our XXX porn gallery!\r\n\r\nType HD video: 720p\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 1280x720 29.97fps 6499kbps\r\nAudio: AAC 48000Hz stereo 189kbps","torrent":{"xt":"urn:btih:9ac2e65aa8ae93d579f098d3b667df3ce9a832c8","amp;dn":"HotLegsAndFeet+-+Vinna+Reed+%28Carnal+Affection%2C+Psychologist+Sedu","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ac2e65aa8ae93d579f098d3b667df3ce9a832c8","infoHashBuffer":{"type":"Buffer","data":[154,194,230,90,168,174,147,213,121,240,152,211,182,103,223,60,233,168,50,200]},"announce":[],"urlList":[]}}