{"title":"Kennedy.2015.11.05.WS.SDTV.x264-XAiO","uid":12992446,"size":264509711,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9b4370b3c082cf7ec7ce2ecc56fa0bbdf2ec0ad4&amp;dn=Kennedy.2015.11.05.WS.SDTV.x264-XAiO&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Reive","files":1,"time":1450135978,"description":"&quot;Kennedy&quot; is a news panel show hosted by Kennedy Montgomery. Kennedy Montgomery is a libertarian that you may recognize from 90's MTV, Stossel, and the Independents.\r\n\r\n_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nDOUBLE HIGH FIVE! Kennedy can not wait to watch Trump on SNL. Will it be a disaster? A pro-immigration group is hoping so, they're even willing to help pay for it. Offering a 5,000 dollar bounty on anyone in the crowd who yells out that Trump is a racist.\r\n\r\nOur party panel consists of WILL RAHN, KATHERINE TIMPH, and GAVIN MCCINES and they kick the night off continuing to talk about the topics Kennedy covered at the top of the show. Bernie Sanders earned some Clinton brownie points by defending her in the debate last month - but now he's changing his tune. Bush H. W. Bush has recently thrown some shade on Donald Rumsfeld and Dick Cheney. (BHut not really, he just called Cheney an iron ass.)\r\n\r\nFBN will be hosting 2 Republican debates on 11.10. DANA PERINO is here to give her advice to the candidates in a segment called DANA'S DO'S AND DON'Ts. 1. Be well briefed. 2. Have command of your policy proposals. 3. Put yourselves in the shoes of a hard working family. 4. Don't get lost in the specifics. 5. Don't make promises you can not keep. 6. Do not forget to criticize the Democrats.\r\n\r\nLast week Rand Paul warned that free college is like a drug. You might even say it's like heroin.. or wait, what? The panel is here to discuss. Next up an incredibly caustic inflammatory topic. Are hot dogs sandwiches?!\r\n\r\nTONY ROBBIN's is in studio to talk about becoming a millionaire.. wait, no.. a BILLIONAIRE! Also his book MONEY: THE MASTER OF THE GAME.\r\n\r\nNightcap: MAILBAG!","torrent":{"xt":"urn:btih:9b4370b3c082cf7ec7ce2ecc56fa0bbdf2ec0ad4","amp;dn":"Kennedy.2015.11.05.WS.SDTV.x264-XAiO","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b4370b3c082cf7ec7ce2ecc56fa0bbdf2ec0ad4","infoHashBuffer":{"type":"Buffer","data":[155,67,112,179,192,130,207,126,199,206,46,204,86,250,11,189,242,236,10,212]},"announce":[],"urlList":[]}}