{"title":"Fairy Farm v2.8.0 mod apk + data","uid":12888860,"size":103063515,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:9be7f20d01d0e8936fce62ef646cbc5a785d24ae&amp;dn=Fairy+Farm+v2.8.0+mod+apk+%2B+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":2,"time":1449083988,"description":"Fairy Farm v2.8.0 mod apk + data\r\n\r\nFairy Farm is a kind and beautiful game about magical wizards. \r\n\r\nWorking magic has never been as simple as it is in our game – clear tutorials and fun quests will help you learn how to play in just minutes. Here, you can cast incredible spells using the ingredients that grow right on your Farm. You can build astonishing buildings, plant fantastic plants, and raise and tame hundreds of wild and domestic animals of which you have never heard before. Let your imagination run wild expanding your territory and building the Farm of your dreams! Beautiful graphics, fun characters and magic adventures will please anyone who likes farm games and wants to have their own magic garden.\r\n\r\n– No Internet connection required. You can play anytime, anywhere!\r\n– Regular updates available every week with new and unique animals and objects!\r\n– Discover over 150 magical plants and trees!\r\n– Tame over 400 animals, like the flying pony, dragons, unicorns and other unimaginable creatures!\r\n– Craft potions using the berries and herbs from your garden and hold the bravest of alchemic experiments!\r\n– Decorate your Farm with the endless assortment of incredible objects!\r\n\r\n~~&gt; Get ready for the most exciting journey of your life!\r\n~~&gt; Raise amazing mythical animals!\r\n~~&gt; Cast spells and expand your magic garden!\r\n\r\nDear wizards! New update here!\r\n- Jack O’Lantern is going to arrange a Halloween masquerade this year! Get your farm prepared to the celebration! You will get 25 amazing quests about decorating your farm and raising treats for your guests!\r\n- Special exclusive: Find new masquerade kittens in the Jack’s chest at specials!\r\n- Grow gloomy pumpkins, harvest them and get different presents at the Jack’s cauldron\r\n- 5 new quests about sewing new masquerade costumes for kittens with the Ghostly tailor!\r\n\r\n\r\nThe mod will not work if it is installed on a google version. Remove the previous first. \r\nInstall APK,Place data folder in SDCard/Android/Obb/ and play.\r\nRequires Android: 2.3.3","torrent":{"xt":"urn:btih:9be7f20d01d0e8936fce62ef646cbc5a785d24ae","amp;dn":"Fairy+Farm+v2.8.0+mod+apk+%2B+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9be7f20d01d0e8936fce62ef646cbc5a785d24ae","infoHashBuffer":{"type":"Buffer","data":[155,231,242,13,1,208,232,147,111,206,98,239,100,108,188,90,120,93,36,174]},"announce":[],"urlList":[]}}