{"title":"Rigmar Radio Karaoke Collection 11000","uid":12958524,"size":3005662471,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a071ff04f2226766fbdb39702d945a4932aa82fc&amp;dn=Rigmar+Radio+Karaoke+Collection+11000&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rigmar_radio","files":1000,"time":1449816338,"description":"WARNING this is a large download over 2.79 Gigabytes in Size.   IF YOU DO NOT KNOW what that means and the impact it may have on your internet usage, socal life and bit torrent use, perhaps this is NOT the download for you.  It should take between 1 and 2 hours to download if all is well at your end and I max out my upload speed at 7.62 mbps.\r\n\r\nHI Gang, We are attempting to find the ideal sized torrent, given the fact that more than a quarter of the Peers I see in each swarm have no idea why there download speeds are so patheticly SLOW and worse still, do not seem to care or want to do anything about this.\r\n\r\nBAD PEERS, that is slow downloaders who do not seed back to the swarm, KILL average swarm speeds and affect everyone.  Together we can do something about this and I am doing my best BY DOUBLING th e torrent size from this upload from 250 songs to 500.  The bad peers will fall behind and drop out as the torrent ages and the seeds fall away with time.\r\n\r\nBAD PEERS MUST UNDERSTAND THAT NO ONE can seed for the weeks or even months it may take for them to download a single torrent and the seeds will drop off as the torrent ages.  This is a 300 Gigabyte Karaoke collection and I can not seed more than a dozen parts at any one time without overloading my Bit Torrent client and giving very poor seeding speeds as a result.   Thank you to all the seeds who not only understand this but have given up there upload bandwidth to help me in this mission.\r\n\r\nADVERTENCIA Este es un gran volumen de descarga más de 2,79 gigabytes de tamaño. SI USTED NO SABE lo que eso significa y el impacto que puede tener en su uso de Internet, la vida socal y el uso bit torrent, tal vez esto no es la descarga para usted. Se debe tener entre 1 y 2 horas para descargar si todo está bien en su extremo y máximo fuera de mi velocidad de subida al 7,62 mbps.\r\n\r\nHI Gang, estamos tratando de encontrar el torrente de tamaño ideales, dado el hecho de que más de una cuarta parte de los compañeros que veo en cada enjambre tiene ni idea de por qué hay velocidades de descarga son tan patheticly lento y peor aún, no parece importarle o querer hacer algo sobre esto.\r\n\r\nCOMPAÑEROS BAD, es decir descargadores lentos que no siembran de nuevo al enjambre, MATAN velocidades promedio del enjambre y afectan a todos. Juntos podemos hacer algo al respecto y estoy haciendo mi mejor esfuerzo doblando ª tamaño e torrente de esta carga de 250 canciones a 500. Los malos compañeros se quedarán atrás y soltar como las edades de torrent y las semillas caerán con el tiempo.\r\n\r\nCOMPAÑEROS BAD deben entender que nadie puede sembrar para las semanas o incluso meses que puede tomar para ellos para descargar un solo torrente y las semillas se caerán como las edades torrent. Esta es una colección Gigabyte Karaoke 300 y no puedo sembrar más de una docena de piezas en cualquier momento sin sobrecargar mi cliente Bit Torrent y dando velocidades de siembra muy pobres como resultado. ¡Gracias a todas las semillas que no sólo entienden esto, pero han dado allí ancho de banda de subida para que me ayude en esta misión.\r\n\r\nAVERTISSEMENT Ceci est un grand téléchargement sur 2,79 gigaoctets. SI VOUS NE SAVEZ PAS ce que cela signifie et l'impact qu'elle peut avoir sur votre utilisation d'Internet, la vie et l'utilisation socal bit torrent, peut-être ce ne sont pas les télécharger pour vous. Il devrait prendre entre 1 et 2 heures pour télécharger si tout va bien à votre fin et je max ma vitesse de téléchargement à 7,62 Mbps.\r\n\r\nHI Gang, Nous essayons de trouver le torrent idéal de taille, compte tenu du fait que plus d'un quart des pairs que je vois dans chaque essaim ont aucune idée de pourquoi il des vitesses de téléchargement sont si patheticly LENT et, pire encore, ne semble pas se soucier ou envie de faire quoi que ce soit à ce sujet.\r\n\r\nPAIRS BAD, qui est téléchargeurs lents qui ne sème pas revenir à l'essaim, de tuer des vitesses moyennes de l'essaim et touchent tout le monde. Ensemble, nous pouvons faire quelque chose à ce sujet et je fais de mon mieux en doublant ème taille e torrent de ce téléchargement à partir de 250 chansons à 500. Les mauvaises pairs seront à la traîne et d'abandon que les âges de torrent et les graines tombent avec le temps.\r\n\r\nPAIRS BAD doivent comprendre que personne ne peut ensemencer pour les semaines, voire des mois, il peut prendre pour eux de télécharger un seul torrent et les graines tomberont comme les âges de torrent. Ceci est une Gigabyte Karaoke collection 300 et je ne peut pas semer plus d'une douzaine de pièces à tout moment sans surcharger mon client Bit Torrent et donnant des vitesses de semis très pauvres comme un résultat. Merci à toutes les semences qui non seulement comprennent cela, mais ont renoncé il bande passante de téléchargement de me aider dans cette mission","torrent":{"xt":"urn:btih:a071ff04f2226766fbdb39702d945a4932aa82fc","amp;dn":"Rigmar+Radio+Karaoke+Collection+11000","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a071ff04f2226766fbdb39702d945a4932aa82fc","infoHashBuffer":{"type":"Buffer","data":[160,113,255,4,242,34,103,102,251,219,57,112,45,148,90,73,50,170,130,252]},"announce":[],"urlList":[]}}