{"title":"Breakthrough! 100 Astronomical Images That Changed Our World Vie","uid":12881815,"size":29792389,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a29335b829a45369b08a58f48763c4223ebe8cd2&amp;dn=Breakthrough%21+100+Astronomical+Images+That+Changed+Our+World+Vie&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TopShelfBook","files":2,"time":1449016284,"description":"Breakthrough! 100 Astronomical Images That Changed Our World View | PDF\r\n\r\n\r\nThis unique volume by two renowned astrophotographers unveils the science and history behind 100 of the most significant astronomical images of all time. The authors have carefully selected their list of images from across time and technology to bring to the reader the most relevant photographic images spanning all eras of modern astronomical history. Based on scientific evidence today we have a basic notion of how Earth and the universe came to be. The road to this knowledge was paved with 175 years of astronomical images acquired by the coupling of two revolutionary technologies – the camera and telescope. With ingenuity and determination humankind would quickly embrace these technologies to tell the story of the cosmos and unravel its mysteries. This book presents in pictures and words a photographic chronology of our aspiration to understand the universe. From the first fledgling attempts to photograph the Moon, planets, and stars to the marvels of orbiting observatories that record the cosmos at energies beyond the range of human vision, astronomers have always relied on images to &quot;break through&quot; to the next level of understanding. A subset of these breakthrough images has profound significance in documenting some of the greatest milestones in modern astronomy.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:a29335b829a45369b08a58f48763c4223ebe8cd2","amp;dn":"Breakthrough%21+100+Astronomical+Images+That+Changed+Our+World+Vie","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a29335b829a45369b08a58f48763c4223ebe8cd2","infoHashBuffer":{"type":"Buffer","data":[162,147,53,184,41,164,83,105,176,138,88,244,135,99,196,34,62,190,140,210]},"announce":[],"urlList":[]}}