{"title":"Led Zeppelin Discography (orig 1980s Barry Diamond Masters) FLAC","uid":12653426,"size":3249535352,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a2ce55136f8d778628fa4182314e8ffa58ac4950&amp;dn=Led+Zeppelin+Discography+%28orig+1980s+Barry+Diamond+Masters%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tmaxxx666","files":180,"time":1446178852,"description":"REUP==\r\nOK folks. This is not my torrent but was put together and uploaded by jimclip at the PB. (and a HUGE thanks to him)\r\n\r\nI am blown away by the audio quality of these Barry Diament masters. My Led Zep music was ripped off my own discs, but thay sound like crap compared to this. These even beat out the Jimmy Page remasters that were just put out, especially for the first 3 albums. The Diament masters have so, so much sonic space they are just plain fucking awesome, especially on the first 4 albums. Download this and trash your previous Zeppelin music.\r\n\r\nHere's jimclip's writeup. Enjoy.\r\n\r\n\r\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\r\nLed Zeppelin - Original CD Discography (1980s Barry Diament masters aka &quot;non-remasters&quot;)\r\nAll 10 official releases, including the standard versions of The Song Remains The Same &amp; Coda\r\nRipped to FLAC with EAC v1.0 beta 1, Secure Mode, Offset Corrected, Test &amp; Copy, AccurateRip verified\r\nLogs, CUE sheets, FFP &amp; MD5 checksums and cover art included\r\n\r\n-a jimclip rip\r\n+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\r\n\r\nJune 2011\r\n\r\nI assembled this collection out of frustration with the existing torrents of what I call the &quot;non-remasters&quot;, i.e.¡the original Led Zeppelin catalog as mastered by Barry Diament* for its first release on CD in the 1980s, before Jimmy Page and George Marino remastered the songs for the 1990 &amp; 1993 box sets and the re-release of the individual CDs. Every lossless torrent I found still active in spring 2011 turned out to be a jumbled combination of remasters and non-remasters, was done with a mix of drives (sometimes with incorrect offsets), suffered from ripping errors or AccurateRip database mismatches, had audible errors (such as intros being clipped off, especially on Physical Graffiti), or some or all of the above. In other words, imperfect.\r\n\r\nSo I decided to take matters into my own hands. I already owned each of these CDs, but a couple were the remastered versions, and if you're still reading you probably know that there remains a contingent of fans who prefer the original CD masters of these classic albums over the reissues. We haven't forgotten what the volume knob does, and we're happy to use it in exchange for a wider dynamic range. So I purchased non-remastered versions of the CDs I was missing and ripped the entire collection with EAC v1.0b1. As the logfiles show, there were no errors on the rips, and I had 100 percent AccurateRip database matching down the line. In the interest of full disclosure, I should point out that I used the BMG Music Club versions of the CDs (except Presence, which is the retail version), a fact that may or may not matter to you. From what I've read, neither the durability nor sonic properties of BMG CDs are any less than their retail counterparts; mine have held up quite well over the years with reasonable care. But using them probably does produce lower AccurateRip confidence results due to the fewer number of people who own (and, more importantly, ripped) these particular pressings.\r\n\r\nOne further note about the source discs. Upon receiving a non-remastered copy of Physical Graffiti to replace the one I lost years ago, it turned out to be a Columbia House version. No big deal, I thought, since after all I was using BMG pressings for my other rips. Except that I had trouble obtaining sonically acceptable results with this particular version. The logfiles didn't show any errors or AccurateRip mismatches, but on Disc 2 the beginnings of some songs were chopped off by a tiny fraction of a second. It was enough to dampen the first snare hit on Down By The Seaside, for example, and throw off the percussive timing of the lead-in to Boggie With Stu. I re-ripped the CD using XLD on my Macintosh, same unfortunate result. The intros sound fine when I play the CD in my home stereo, but that's of little consolation when trying to achieve good lossless rips. In downloading and sorting through numerous torrents before undertaking this project, I noticed that at least one other rip of Physical Graffiti had similarly clipped intros, so this abnormality may be unique to certain pressings of this disc (again, it passed AccurateRip verification with double-digit confidence, and my drive offset is definitely set correctly). In any case, rather than trying to track down and purchase ANOTHER copy and hope that it the result would be different, I replaced my own rip of Physical Graffiti with the best non-remastered EAC-FLAC version I had from among several torrents. I've tested it nine ways to Sunday, including listening to the FLAC files carefully and manually checking the rip against AccurateRip (the original EAC log shows that the AccurateRip database wasn't queried on the original rip, but it passed when I checked it manually with XLD using the CUE sheet, a very cool feature that EAC lacks as far as I can tell). I can assure you that the FLAC files are clean and bit-accurate. Because of this one substitution, the logs for Physical Graffiti obviously show a different drive than the one I used to rip the other nine albums.\r\n\r\nFor those who care, this is the proper version of Physical Graffiti with the &quot;cough&quot; at the end of In My Time Of Dying.\r\n\r\n* It's worth pointing out that apparently Joe Sidore (rather than Barry Diament) was the mastering engineer on LZ IV for the original CD release. The liner notes for LZ IV don't actually specify who mastered it, and for that matter neither do the liner notes for Houses, ITTOD and Coda (at least not on my copies). However, I've only seen Sidore's name mentioned in conjunction with LZ IV, and some quick Internet research suggests that Barry Diament mastered all of the original CDs except LZ IV.\r\n\r\nI included a large, high-quality cover image of each album, including the original blue-titled UK version of LZ I and all six photos from different perspectives used for ITTOD. The FLAC files are accurately tagged, and I created fingerprints and MD5 checksums for each disc, along with post-rip AccurateRip database check logs that I generated with XLD after moving the collection from my PC to my Macintosh for torrenting (all 10 albums passed). I encourage you to help seed and share with other trackers/sites if so inclined, but please don't remove any files from the torrent; there's simply no need.\r\n\r\nI hope this collection is useful to some folks. If so, drop me a line at gmail, or say thanks on the torrent site where you downloaded this Led For Your Head.\r\n\r\nTurn it up, and enjoy !!!\r\n\r\nOriginal release dates, plus catalog numbers of each CD ripped for this torrent. *All albums were mastered for CD by Barry Diament, except Led Zeppelin IV (mastered by Joe Sidore):\r\n\r\nLed Zeppelin (Jan. 12, 1969)\r\nSD 19126-2\r\n\r\nLed Zeppelin II (Oct. 22, 1969)\r\nSD 19127-2\r\n\r\nLed Zeppelin III (Oct. 5, 1970)\r\nSD 19128-2\r\n\r\nLed Zeppelin IV (Nov. 8, 1971)\r\nSD 19129-2\r\n\r\nHouses Of The Holy (March 28, 1973)\r\nSD 19130-2\r\n\r\nPhysical Graffiti (Feb. 24, 1975)\r\nSS-200-2\r\n\r\nPresence (March 31, 1976)\r\nSS 8416-2\r\n\r\nThe Song Remains The Same (Sept. 28, 1976)\r\nRecorded July 27-29, 1973 at Madison Square Garden, NYC\r\nSS-201-2\r\n\r\nIn Through The Out Door (August 15, 1979)\r\n16002-2\r\n\r\nCoda (Nov. 19, 1982)\r\nRecorded 1970-1978\r\n90051-2\r\n\r\n\r\n******* PLEASE HELP SEED, BUT DO NOT REMOVE ANY FILES FROM THIS TORRENT *******","torrent":{"xt":"urn:btih:a2ce55136f8d778628fa4182314e8ffa58ac4950","amp;dn":"Led+Zeppelin+Discography+%28orig+1980s+Barry+Diamond+Masters%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2ce55136f8d778628fa4182314e8ffa58ac4950","infoHashBuffer":{"type":"Buffer","data":[162,206,85,19,111,141,119,134,40,250,65,130,49,78,143,250,88,172,73,80]},"announce":[],"urlList":[]}}