{"title":"One More Step (2015).epub Gooner","uid":12626383,"size":1989040,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a582b60c3babd8014c35291a7b1ffc06379abc2f&amp;dn=One+More+Step+%282015%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1445779173,"description":"One More Step - My Story of Living with Cerebral Palsy, Climbing Kilimanjaro and Surviving the Hardest Race on Earth (2015).epub Gooner\r\n\r\nPublisher: HarperOne (March 10, 2015)\r\nLanguage: English\r\nISBN-10: 0062295586\r\nISBN-13: 978-0062295583\r\n\r\nIn this exhilarating and inspirational memoir, the first man with cerebral palsy to climb Mount Kilimanjaro and complete the brutal Ironman competition shares the exhilarating adventure that led to his achievements—redefining our ideas of normal and proving that life is never truly limited for any of us.\r\n\r\nBonner Paddock summited 19,341 foot-high Mount Kilimanjaro, the world’s tallest freestanding mountain. Four years later, he earned the elite triathlete title, Kona Ironman. Thousands have done each individually. Bonner is the first person with cerebral palsy to do both.\r\n\r\nDiagnosed in his youth, Bonner swore he wouldn’t let this neurological disorder limit him, and for twenty-nine years he guarded the truth about his health. But the sudden death of a friend’s young son who also suffered from CP forced Bonner to reevaluate his life. No longer would he be content striving for normal. Instead he would live life to its fullest, pursuing one breathtaking experience at a time—while raising money for special needs children along the way—and never turn down a challenge for fear of his physical limitations.\r\n\r\nHis is a remarkable journey that has taken him across the globe and introduced him to a fascinating cast of characters who have supported his inspiring quest. An athlete, adventurer, and philanthropist, Bonner is today no longer defined by his limits, but by the moments that pushed him past them. Infused with his irresistible charisma, courage, and heart, illustrated with 16 pages of color photos, One More Step shows us that we can all conquer our own challenges and embrace every moment life has to offer","torrent":{"xt":"urn:btih:a582b60c3babd8014c35291a7b1ffc06379abc2f","amp;dn":"One+More+Step+%282015%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a582b60c3babd8014c35291a7b1ffc06379abc2f","infoHashBuffer":{"type":"Buffer","data":[165,130,182,12,59,171,216,1,76,53,41,26,123,31,252,6,55,154,188,47]},"announce":[],"urlList":[]}}