{"title":"Alex.Polizzi.Hire.Our.Heroes.s01e01.EN.SUB.x264.WEBRIP.[MPup]","uid":12967077,"size":1059034634,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a88da45f8765b88130581fb3e8a260ad4f131078&amp;dn=Alex.Polizzi.Hire.Our.Heroes.s01e01.EN.SUB.x264.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1449900238,"description":"Alex.Polizzi.Hire.Our.Heroes.s01e01.EN.SUB.MPEG4.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nAlex Polizzi finds work for war veterans. Veterans are 60% more likely to be unemployed than their civilian counterparts. Alex hears the heartbreaking testimonies of four men.\r\n\r\n[img]http://extraimago.com/images/2015/12/12/3137f3e0cc612a236f7c245e8ee06ed8.jpg[/img]\r\n\r\nVeterans are 60% more likely to be unemployed than their civilian counterparts, and where discharge from the armed forces is accompanied by mental illness, as is thought to be the case for one in five veterans of the wars in Iraq and Afghanistan, the discrepancy can be much worse. Alex hears the sometimes heartbreaking testimony of four veterans, all medically discharged from the army with mental illness, all with a highly trained military skill set, all finding themselves on the civilian scrapheap when it comes to work. As Alex attempts to join together employers and veterans, she learns how psychological injury can severely affect veterans' self-confidence. After years of rejection, self-esteem is at rock bottom, and Alex's first job is to try and build confidence in the men.\r\n\r\nAs well as coaching, cajoling and mentoring her unit of vets, Alex wants to bang the drum to employers that military veterans are a valuable untapped resource. But as the group take their first steps into employment, she begins to think she might have bitten off more than she can chew. Just days into a work placement, Lee's prospects of a permanent job are dashed when his post-traumatic stress disorder flares up. Phil survived tours of Iraq and frontline combat in Afghanistan. He seems at first sight the most work-ready of the group but when a fifth operation to repair his leg amputation is delayed, depression kicks in and his job hunt is put on hold. As the episode ends, only gentle giant Stuart, who for 14 years has known nothing but army life, seems set for meaningful employment after being accepted on to a bricklayers apprenticeship. But after battling PTSD, Stuart's confidence is in his boots, and the world outside his supported specialist veterans' housing is baffling and daunting","torrent":{"xt":"urn:btih:a88da45f8765b88130581fb3e8a260ad4f131078","amp;dn":"Alex.Polizzi.Hire.Our.Heroes.s01e01.EN.SUB.x264.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a88da45f8765b88130581fb3e8a260ad4f131078","infoHashBuffer":{"type":"Buffer","data":[168,141,164,95,135,101,184,129,48,88,31,179,232,162,96,173,79,19,16,120]},"announce":[],"urlList":[]}}