{"title":"FantasyMassage - Sage Evans (The Rekindling)","uid":12652092,"size":274660244,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:aa67fca8b55add0d2adfe80d983607f2cb4729ea&amp;dn=FantasyMassage+-+Sage+Evans+%28The+Rekindling%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EndYou","files":1,"time":1446154608,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/image/ZXf \nhttp://imgpremium.com/image/ZXg \r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nThe name of the actress: Sage Evans\r\nName movie: The Rekindling\r\nNPP site and the site: FantasyMassage.com\r\n\r\nYear: 2015\r\nGenre: Kissing, Pussy Licking, Tattoo, Body Massage, Blowjob, 69, Hardcore, Fingering, Massage, Cunilingus, Redhead, Pilots\r\nDuration: 00:27:08\r\n\r\nMarcus London has not seen Sage Evans ever since taking on projects at work that prevents him from seeing his wife. After three long months of intense work, he finally finishes his project and he's ready to take a well deserved vacation. His boss calls him over the phone, proposing he start another project but Marcus refuses, adamant that he can not and is on vacation effective immediately.\r\n\r\nAt home, Marcus walks into the master bedroom, seeing Sage folding laundry as usual, her face transparent with disappointment and loneliness from being home without a husband to show her any affection. Marcus gives Sage the good news that starting today, he is on vacation and will take her on a trip to anywhere she desires. But first, he offers her a sensual massage, rekindling the time lost between the two lovers.\r\n\r\nMarcus removes Sage's clothing, slowly, rubbing her flawless white skin. He takes off her underwear, hungry to kiss the insides of her pussy and her neglected boobs. He pushes his finger deep inside of her hole, penetrating her with eager anticipation making her pussy wet. She starts begging him not to stop until she cums. The lovers turn their bodies around to indulge in each others most important parts, Sage sucking on Marcus' hard cock and Marcus filling Sage's hungry pussy with saliva and fingers. Marcus' restless cock desires her pussy, riding his cock deep inside of her. Sage needs the surreal affirmation of her husband's cock pushing inside of her, as she stretches her red pussy lips, ready for his massive cock. Soon he is unable to control his orgasm, and releases his load, cumming all over her stomach!\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 720x400 (16: 9) 29.97fps 1213kbps\r\nAudio: AAC 44100Hz stereo 128kbps","torrent":{"xt":"urn:btih:aa67fca8b55add0d2adfe80d983607f2cb4729ea","amp;dn":"FantasyMassage+-+Sage+Evans+%28The+Rekindling%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa67fca8b55add0d2adfe80d983607f2cb4729ea","infoHashBuffer":{"type":"Buffer","data":[170,103,252,168,181,90,221,13,42,223,232,13,152,54,7,242,203,71,41,234]},"announce":[],"urlList":[]}}