{"title":"The Sword in the Stone - OAR - Original Mono - Multiaudio -1080p","uid":12798564,"size":20612059771,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:ad9e9153d15a4d90dfd5fbcbaf3c3a0455ef742a&amp;dn=The+Sword+in+the+Stone+-+OAR+-+Original+Mono+-+Multiaudio+-1080p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"shadoe.federation","files":3,"time":1448014881,"description":"Jerry Shadoe presents:\r\n\r\nThe.Sword.In.The.Stone.Open.Matte.Original.Theatrical.Mono.1963.Multiaudio.Multisubs.1080p.BDremux.x264.LPCM.AC3.Shadoe\r\n\r\nPurpose: to provide the highest quality possible of the open-matte transfer with original mono audio for as many languages as possible. The official BD release is a &quot;smear-o-vision&quot; DNR'ed and EE'ed to death mess, is cropped to supposed &quot;OAR,&quot; and does only provides a 5.1 upmix for almost all language options.\r\n\r\nVideo sources: 1080i Disney Cinemagic broadcast, 720p-rip of a 1080i Disney Cinemagic broadcast (different broadcast with logo placed in different place) old transfer 1080p itunes web-dl, EUR/US BD (for timing purposes ONLY)\r\n\r\nAudio sources: Lossless audio - LD PCM, lossy - numerous DVDs and DVB broadcast\r\n\r\nSubtitles sources: various DVDs and BD\r\n\r\nBonus sources: a film blog for the final draft (thanx to TServo2049 for sharing the link)\r\n\r\nFinal format: MKV/BD-25\r\n\r\n\r\nProject info:\r\n\r\nThe Sword in the Stone has one of the worst releases I have ever seen on BD. It's a DNR'ed mess. On top of that, it's presented in &quot;OAR&quot; at a 1.75 AR which just seems like everything is overcropped. It also does not contain almost any original mono mix. I found two different Disney Cinemagic transfers with the logo in a different spot and managed to &quot;patch&quot; the logo with just those two &quot;patching each other.&quot; There was a little bit left that I ran through a de-logo avisynth script. This provided a decent result, but there were still some artifacts present here and there. So, I took the old 1080p itunes transfer, color-matched it to the HDTV (they were close but not identical) overlayed it with a real 35mm grain plate and rendered that out. I used that as an overlay for the HDTV which helped mask any artifacts left and brought some detail out that was missing before (there were frames were due to compression part of the frame would look better on one versus the other and they kind of compliment each other when overlayed) Then, I took that render and overlayed real 35mm grain on that which produced a beautiful result. \r\n\r\nI wanted to include all of the original mono mixes I could find and tracked down the English and French PCM from Laserdiscs and tracked down all first edition R1 and R2 DVD releases from 1999 (this was an expensive, painful process for the DVDs) In total, I have 24 original audio mixes included here, most of them the original mono. It took me over two weeks to sync them all...\r\n\r\nWhile syncing each audio track manually (I used the BD video/audio as a time-sync reference for the audio and video of this project) I discovered something at the opening scene at the 27th minute into the film where you can clearly see Merlin talking but there is no audible dialog. There was dialog there originally, which is proven with the fact that the lines are present on two of the dubs (The French and the Italian) as well as in the final draft (thanx to TServo2049 for supplying to link so source images) I downloaded all the source images (all 236 of them) for the entire draft and created a PDF document, which is included with this release. In it, you will see the missing part of the dialog is:\r\n\r\nMerlin: &quot;Well, after you become a squire then in time you'll be a knight I suppose.&quot;\r\nWart: &quot;Oh, I wish I could.&quot;          I'd give anything to go... here, the part NOT in quotation marks is where the dialog actually starts in the film... These line were impossible to reconstruct, which I really wanted to do, because there is no place in the film (or other films, as I researched the voice actor and some of his other work) where he uses the word &quot;squire&quot; which really sucks. This missing dialog IS present in the English SDH subtitles that I included:)\r\n\r\nMain Feature Video:\r\n\r\n1920x1080, 23.976fps, A.R. ~1.34 (Pillarboxed) AVC encoded ~26mbps\r\n\r\nMain Feature Audio:\r\n\r\nEnglish - Original mono sourced from JPN LD\r\nEnglish - Original mono sourced from R2 DVD (slightly different than LD track, as it's missing a sound effect)\r\nEnglish - downmixed BD stereo track to mono for reference (included it's for comparison)\r\nFrench - Original mono dub sourced from PAL LD\r\nArabic - Original mono dub sourced from a bootleg R1 DVD\r\nBulgarian - Original mono voice-over sourced from R2 DVD\r\nChinese Mandarin - Original mono dub sourced from NTSC VCD\r\nCzech - Original mono dub sourced from R2 DVD\r\nDanish - Original mono dub sourced from R2 DVD\r\nDutch - Original mono dub sourced from R2 DVD\r\nGerman - Original mono dub sourced from R2 DVD\r\nGreek - Original mono dub sourced from R2 DVD\r\nHebrew - Original mono dub sourced from R2 DVD\r\nHindi - Original mono dub sourced from German BD\r\nHungarian - Original mono dub sourced from R2 DVD\r\nItalian - Original mono dub sourced from R2 DVD\r\nKorean - Original mono dub sourced from R3 DVD\r\nNorwegian - Original mono dub sourced from R2 DVD\r\nPortuguese (Brazil) - Original mono sourced from R1 DVD\r\nPortuguese (Euro) - Original mono sourced from R2 DVD\r\nRomanian - Original Dolby Stereo dub sourced from R2 DVD\r\nRussian - Original Dolby Stereo dub sourced from EUR BD\r\nSwedish - Original mono dub sourced from R2 DVD\r\nUkrainian - Original mono voice-over sourced from PAL DVB broadcast\r\n\r\nEnglish (all) and French audio are 2ch LPCM 16bit @1536kbps @48kHz\r\nAll other audio tracks are 2ch AC3 16bit @224kbps @48kHz\r\n\r\nMain Feature Subtitles:\r\n\r\nEnglish, French, Arabic, Bulgarian, Czech, Danish, Dutch, German, Hebrew, Italian, Norwegian, Polish, Portuguese Brazilian, Portuguese European, Romanian, Russian, and Spanish.\r\n\r\nBonus Feature:\r\n\r\nThe Sword in the Stone Final Draft (external PDF file)\r\n\r\nPlease feel free to share this release BUT KEEP THIS INFO FILE and the PDF file.\r\nThanx and Enjoy ;o)\r\nJerry Shadoe\r\n\r\nfor information on the development of this project, you can go here: \nhttp://forum.fanres.com/showthread.php?tid=597\r\n\r\nRelease Date: 11-17-2015\r\nby Jerry Shadoe\r\n\r\n\r\nExtra-Notes: I included all the chapters, with their titles, from the BD release;)\r\n\r\nScreenshots: \r\n\r\n[img]http://i.imgur.com/qXAsIVn.png[/img]\r\n[img]http://i.imgur.com/yUw7rpo.png[/img]\r\n[img]http://i.imgur.com/vCH5gnR.png[/img]\r\n[img]http://i.imgur.com/K60zMKC.png[/img]\r\n[img]http://i.imgur.com/U2yJA2J.png[/img]\r\n[img]http://i.imgur.com/ygG7pXu.png[/img]\r\n[img]http://i.imgur.com/XhqtWNL.png[/img]\r\n[img]http://i.imgur.com/b0vhM7k.png[/img]\r\n[img]http://i.imgur.com/pGVN0Jr.png[/img]\r\n[img]http://i.imgur.com/4nYPwix.png[/img]\r\n[img]http://i.imgur.com/V2o6fLH.png[/img]","torrent":{"xt":"urn:btih:ad9e9153d15a4d90dfd5fbcbaf3c3a0455ef742a","amp;dn":"The+Sword+in+the+Stone+-+OAR+-+Original+Mono+-+Multiaudio+-1080p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad9e9153d15a4d90dfd5fbcbaf3c3a0455ef742a","infoHashBuffer":{"type":"Buffer","data":[173,158,145,83,209,90,77,144,223,213,251,203,175,60,58,4,85,239,116,42]},"announce":[],"urlList":[]}}