{"title":"Super MP3 Download 5.1.1.6 + Patch","uid":12935452,"size":6478589,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ae2fff08f1919f98d4426cd2409bbe92b937d4a6&amp;dn=Super+MP3+Download+5.1.1.6+%2B+Patch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubberboy37","files":1,"time":1449573408,"description":"Super MP3 Download is a handy tool that let's you listen to and download MP3 songs from the online environment.\r\n\r\n\r\nYou should be careful when installing this software. Since it is an ad-supported application, Super MP3 Download offers to install the Hot MP3 Toolbar. The application features an intuitive interface with few options, so users of any experience level can easily handle it!\r\n\r\n\r\nAll you have to do is type in the name of the artist and/or song, hit the search button and the results will almost instantly appear. You can view their title, lenght and popularity, but you can also download them by specifying the output file name and destination, bitrate and ID3 tags.\r\n\r\n\r\nFurthermore, you can view hot songs found on USA Airplay Hot 100, as well as rthe current day's hits by categories. If you have any issues, you can view the online FAQ page.\r\n\r\n\r\nUnfortunately, the free edition of Super MP3 Download does not allow you to use advanced search or download more than one MP3 at a time (you have to purchase the pro edition, in this case). Plus, the volume is this kind of low, even at it's maximum capacity.\r\n\r\n\r\nAn MP3 song takes several minutes to download, during which system memory is moderately used. If you add several tasks to the queue, each one of them automatically starts when the previous song has completed downloading.\r\n\r\n\r\nOveraal, Super MP3 Download is a great tool for downloading MP3 songs from the internet, but it lacks any advanced functions and sometimes it freezes.\r\n\r\n\r\nFeatures:\r\n\r\nOver 100 Million MP3 For Free\r\nSuper MP3 Download is free to use. You can search and download over 100 million MP3 from the largest download network fast and free.\r\n\r\n\r\nBring You The Hottest Songs\r\n\r\nSuper MP3 Download recommends you the USA Airplay Hot 100 every week and lists the hottest songs across all genres, from Electronic to Religious, mainstream to Indie, Hip-Hop to Classical, ect.\r\n\r\n\r\nListen To Music Online Without Limits\r\n\r\nAll with unlimited access to over 100 million songs, you can listen to music online for FREE and try the searched results to decide which one to download.\r\n\r\nAdvanced Search\r\n\r\nSuper MP3 Download can search songs in tags of title, artist, album and edition. You can even search the live, piano, guitar, acapella or cover editions of you favorite songs.\r\n\r\nRelease date: 2015-08-14\r\n\r\nOS: 2000/XP/Vista/7/8/10\r\n \nhttp://imgbay.mobi/di/Knipsel1-8ec5j.jpg \nhttp://imgbay.mobi/di/Knipsel2-w7ftr.jpg","torrent":{"xt":"urn:btih:ae2fff08f1919f98d4426cd2409bbe92b937d4a6","amp;dn":"Super+MP3+Download+5.1.1.6+%2B+Patch","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae2fff08f1919f98d4426cd2409bbe92b937d4a6","infoHashBuffer":{"type":"Buffer","data":[174,47,255,8,241,145,159,152,212,66,108,210,64,155,190,146,185,55,212,166]},"announce":[],"urlList":[]}}