{"title":"NubileFilms - Chloe Amour, Kinsley Eden (All Business) NEW 06 De","uid":12921149,"size":280478863,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:ae9db87ee96299ad73e329c64ce4a525650a6753&amp;dn=NubileFilms+-+Chloe+Amour%2C+Kinsley+Eden+%28All+Business%29+NEW+06+De&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1449416988,"description":"A lusty sight greets Ryan Driller when he arrives home from work to find Kinsley Eden and Chloe Amour making out on the couch. When he settles onto the couch between the two girls, they welcome him with heated kisses and sexy smiles that speak of the pleasure that Ryan can look forward to more loudly than words.While Ryan pushes up Kinsley's sheer bra to play with her tits, Chloe works on pulling his cock from his pants. Once both girls are topless, they kneel down to work Ryan's rock hard dick with their talented mouths and magic hands. Meanwhile, Ryan reaches out to fondle both girls' breasts and cup their asses to slide their thongs aside so that he can dip his fingers into the wetness of their sweet twats.Settling Chloe and Kinsley side by side on the couch so that their pussies are next to one another, Ryan peels off Chloe's thong and then leans forward to lap at her bald slit with his hot tongue. Unwilling to let her friend go for long without stimulation, Chloe reaches over to fondle Kinsley's clit. That draws Ryan's attention, and he switches pussies to lavish the same attention on his other lover...\r\nTags: Medium Boobs, Shaved Pussy, Brunette, Long hair, Hardcore, Lesbian, Tan, Latina, Girl-Girl-Boy, Blowjob, Deep Throat, Pussy Licking\r\n \nhttp://imgdone.com/viewer.php?file=73006671597587419406.jpg\r\n \nhttp://imgdone.com/viewer.php?file=18812472875381599096.jpg","torrent":{"xt":"urn:btih:ae9db87ee96299ad73e329c64ce4a525650a6753","amp;dn":"NubileFilms+-+Chloe+Amour%2C+Kinsley+Eden+%28All+Business%29+NEW+06+De","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae9db87ee96299ad73e329c64ce4a525650a6753","infoHashBuffer":{"type":"Buffer","data":[174,157,184,126,233,98,153,173,115,227,41,198,76,228,165,37,101,10,103,83]},"announce":[],"urlList":[]}}