{"title":"Encyclopedia of Polymeric Nanomaterials","uid":12712460,"size":128944724,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aec7f654ed9e78c0abecb1a59c779b137a1e0a8c&amp;dn=Encyclopedia+of+Polymeric+Nanomaterials&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"clouderone","files":1,"time":1446899671,"description":"Encyclopedia of Polymeric Nanomaterials - Shiro Kobayashi and Klaus Müllen (Springer, 2015).pdf\r\n\r\nISBN 9783642296475\r\n\r\nOver the last few years, nanoscience and nanotechnology have been the focus of significant research attention, both from academia and industry. This sustained focus has in-turn driven the interdisciplinary field of material science research to the forefront of scientific inquiry through the creation and study of nanomaterials. Nanomaterials play an important role in the development of new materials as they can be used to influence and control physical properties and specific characteristics of other materials. Nanostructured materials that have been created include nanoparticles, nanocapsules, nanoporous materials, polymer multi-layers to name a few. These are increasingly used across applications as diverse as automotive, environment, energy, catalysis, biomedical, pharmaceutical, and polymer industries. The Encyclopedia of Polymeric Nanomaterials (EPN) intends to be a comprehensive reference work on this dynamic field studying nanomaterials within the context of the relationship between molecular structure and the properties of polymeric materials. \r\n\r\nAlphabetically organized as an encyclopedic Major Reference Work, EPN will cover the subject along multiple classification axes represented by name, source, properties, function, and structures or even processes, applications and usage. The underlying themes of the encyclopedia has been carefully identified to be based not just on material-based and function-based representation but also on structure- and process-based representation. The encyclopedia will have an exclusive focus on polymeric nanomaterials (for e.g., nanoceramics, nanocomposites, quantum dots, thin films) and will be a first of its kind work to have such an organization providing an overview to the concepts, practices and applications in the field. The encyclopedia intends to cover research and development work ranging from the fundamental mechanisms used for the fabrication of polymeric nanomaterials to their advanced application across multiple industries","torrent":{"xt":"urn:btih:aec7f654ed9e78c0abecb1a59c779b137a1e0a8c","amp;dn":"Encyclopedia+of+Polymeric+Nanomaterials","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aec7f654ed9e78c0abecb1a59c779b137a1e0a8c","infoHashBuffer":{"type":"Buffer","data":[174,199,246,84,237,158,120,192,171,236,177,165,156,119,155,19,122,30,10,140]},"announce":[],"urlList":[]}}