{"title":"Keeper of The Lost Cities Series - Shannon Messenger","uid":12809264,"size":4951791,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b010cee8fb40775206a2d2d13b71cbc56dc1bbd2&amp;dn=Keeper+of+The+Lost+Cities+Series+-+Shannon+Messenger&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":12,"time":1448151541,"description":"01. Keeper of the Lost Cities (Keeper of The Lost Cities, #01) - Shannon Messenger\r\n\r\n\r\n\r\nIn this riveting debut, a telepathic girl must figure out why she is the key to her brand-new world—before the wrong person finds the answer first.\r\n\r\nTwelve-year-old Sophie has never quite fit into her life. She’s skipped multiple grades and doesn’t really connect with the older kids at school, but she’s not comfortable with her family, either. And Sophie has a secret—she’s a Telepath, someone who can read minds. But the day Sophie meets Fitz, a mysterious (and adorable) boy, she learns she’s not alone. He’s a Telepath too, and it turns out the reason she has never felt at home is that, well…she isn’t. Fitz opens Sophie’s eyes to a shocking truth, and almost instantly she is forced to leave behind her family for a new life in a place that is vastly different from what she has ever known.\r\n\r\nBut Sophie still has secrets, and they’re buried deep in her memory for good reason: The answers are dangerous and in high-demand. What is her true identity, and why was she hidden among humans? The truth could mean life or death—and time is running out.\r\n\r\n02. Exile (Keeper of The Lost Cities, #02) - Shannon Messenger\r\n\r\n\r\n\r\nSophie befriends the mythical Alicorn--and puts her mysterious powers to the test--in this enchanting sequel to Keeper of the Lost Cities.\r\n\r\nSophie is settling in nicely to her new home and her new life in the world of the lost cities. And it helps that living at Havenfield means getting to spend time with rare, precious species--including the first female Alicorn, who shows herself to Sophie and trusts no one but her.\r\n\r\nSophie is tasked with helping to train the magical creature so that the Alicorn can be revealed to the people of the lost cities as a sign of hope, and Sophie wants to believe that the recent drama and anguish is gone for good.\r\n\r\nBut the secrets buried deep in Sophie's memories remain, and before long she's back in incredible danger, risking everything to find the answers to questions that could save not only her life, but the life of someone close to her...\r\n\r\n03. Everblaze (Keeper of The Lost Cities, #03) - Shannon Messenger\r\n\r\n\r\n\r\nSophie uncovers shocking secrets—and faces treacherous new enemies—in this electrifying third book in the Keeper of the Lost Cities series.\r\n\r\nSophie Foster is ready to fight back.\r\n\r\nHer talents are getting stronger, and with the elusive Black Swan group ignoring her calls for help, she’s determined to find her kidnappers—before they come after her again.\r\n\r\nBut a daring mistake leaves her world teetering on the edge of war, and causes many to fear that she has finally gone too far. And the deeper Sophie searches, the farther the conspiracy stretches, proving that her most dangerous enemy might be closer than she realizes.\r\n\r\nIn this nail-biting third book in the Keeper of the Lost Cities series, Sophie must fight the flames of rebellion, before they destroy everyone and everything she loves.\r\n\r\n04. Neverseen (Keeper of The Lost Cities, #04) - Shannon Messenger\r\n\r\n\r\n\r\nSophie battles the rebels—and recovers dark memories from her past—in this jaw-dropping fourth book in the bestselling Keeper of the Lost Cities series.\r\n\r\nSophie Foster is on the run—but at least she's not alone.\r\n\r\nHer closest friends from the Lost Cities have gone with her to join the Black Swan. They still have doubts about the shadowy organization, but the only way to find answers is to start working with them. And as they settle into their new lives, they uncover secrets bigger than anything they’d imagined.\r\n\r\nBut their enemies are far from done, and unleash a terrifying plague that threatens the safety of an entire species. Sophie and her friends fight with everything they have—with new allies joining them—but every choice has consequences. And trusting the wrong person could prove deadly.\r\n\r\nIn this game-changing fourth book in the Keeper of the Lost Cities series, Sophie must question everything to find a truth that will either save her world—or shatter it","torrent":{"xt":"urn:btih:b010cee8fb40775206a2d2d13b71cbc56dc1bbd2","amp;dn":"Keeper+of+The+Lost+Cities+Series+-+Shannon+Messenger","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b010cee8fb40775206a2d2d13b71cbc56dc1bbd2","infoHashBuffer":{"type":"Buffer","data":[176,16,206,232,251,64,119,82,6,162,210,209,59,113,203,197,109,193,187,210]},"announce":[],"urlList":[]}}