{"title":"ExploitedCollegeGirls - Esu NEW 19 November 2015","uid":12799922,"size":340336480,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:b058d0df03ce209890a287b9fb28df50d37be002&amp;dn=ExploitedCollegeGirls+-+Esu+NEW+19+November+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1448035180,"description":"Meet Esu, a busty little Latina who loves showing off on camera and can't seem to stop diddling her clit or squeezing her nice, perky tits for the full hour. As the shoot opens, Jay does a behind the scenes interview as Esu explains that while she's lived in town her entire life she's never seen the waterfront view from Jay's posh hotel. Well, sorry to break it to you Esu, but no, you can't see that view from, ahem, that side of the tracks. Worry not, though, you're clearly moving on up!After a daring outdoor blowjob, the shoot moves inside to the bed and Esu strips down to nothing and shows off a great set of natural tits as well as her very accomplished beej skills. After a nice behind the scenes beej, Jay backs her off and has her show off her curvy, thick figure. A bit more small talk and Jay gets things started again by positioning her with her legs in the air and, thank god, gets yet another chance to make his amateur gynecologist joke. Just like the girls on Ex Co Gi that baby NEVER GETS OLD.As Jay gets started with his fingers, Esu stares deeply into the camera with a look that either means, &quot;You like what you see here boys?&quot; or, &quot;Don't you wish you'd bought me that pony now, Daddy?&quot; You decide which one makes you harder, no judgement on our end. After some tentative fingering to get Esu relaxed and in the mood Jay tries a dildo to only mild success. No matter how nervously tight she is, Esu seemed really relaxed when sucking, so when she drops to the floor and revisits Jay's dick, you can see how amazing her blowjob skills are. It's almost too bad Jay isn't willing to let her finish him off, she looks like this is a grudge match with Jay's cock and she's not going to let him escape without coating her throat.Eventually Jay decides to get his fuck on, but Esu seems to be too nervous to really relax into it. Jay lubes her up and lays it on her but she gasps and grunts like he's trying to fist her while holding a roll of nickels. Jay's a creative bastard, though, and after a few different positions like doggy and sideshow he's got her taking his entire dick. No, Esu may not be the best lay ever but Jay is sure as hell going to have fun. Yes, by fun, we mean a huge cum facial. He gets Esu on her knees and blasts her face and tits and as she rubs his jizz into her tits, she seems to finally be loosening up, just a little late.\r\nTags: Blowjob, Facial, Sex Toys, Amateur, Casting, POV, Hardcore\r\n \nhttp://imgdone.com/viewer.php?file=41207492482620493019.jpg\r\n \nhttp://imgdone.com/viewer.php?file=44686689782714316547.jpg","torrent":{"xt":"urn:btih:b058d0df03ce209890a287b9fb28df50d37be002","amp;dn":"ExploitedCollegeGirls+-+Esu+NEW+19+November+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b058d0df03ce209890a287b9fb28df50d37be002","infoHashBuffer":{"type":"Buffer","data":[176,88,208,223,3,206,32,152,144,162,135,185,251,40,223,80,211,123,224,2]},"announce":[],"urlList":[]}}