{"title":"The Art of Crash Landing - Melissa Decarlo","uid":12649154,"size":884949,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0718fd7cd2e0635f94d00e6f9c9127b1c512c3f&amp;dn=The+Art+of+Crash+Landing+-+Melissa+Decarlo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1446101349,"description":"From a bright new talent comes this debut novel about a young woman who travels for the first time to her mother’s hometown, and gets sucked into the mystery that changed her family forever\r\n\r\nMattie Wallace has really screwed up this time. Broke and knocked up, she’s got all her worldly possessions crammed into six giant trash bags, and nowhere to go. Try as she might, Mattie can no longer deny that she really is turning into her mother, a broken alcoholic who never met a bad choice she didn’t make.\r\n\r\nWhen Mattie gets news of a possible inheritance left by a grandmother she’s never met, she jumps at this one last chance to turn things around. Leaving the Florida Panhandle, she drives eight hundred miles to her mother’s birthplace—the tiny town of Gandy, Oklahoma. There, she soon learns that her mother remains a local mystery—a happy, talented teenager who inexplicably skipped town thirty-five years ago with nothing but the clothes on her back. But the girl they describe bears little resemblance to the damaged woman Mattie knew, and before long it becomes clear that something terrible happened to her mother, and it happened here. The harder Mattie digs for answers, the more obstacles she encounters. Giving up, however, isn’t an option. Uncovering what started her mother’s downward spiral might be the only way to stop her own.\r\n\r\nHilarious, gripping, and unexpectedly wise, The Art of Crash Landing is a poignant novel from an assured new voice","torrent":{"xt":"urn:btih:b0718fd7cd2e0635f94d00e6f9c9127b1c512c3f","amp;dn":"The+Art+of+Crash+Landing+-+Melissa+Decarlo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0718fd7cd2e0635f94d00e6f9c9127b1c512c3f","infoHashBuffer":{"type":"Buffer","data":[176,113,143,215,205,46,6,53,249,77,0,230,249,201,18,123,28,81,44,63]},"announce":[],"urlList":[]}}