{"title":"El juego de la OCA (descubre tu futuro)","uid":12668187,"size":6389777,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:b0b0651ca903273d5101fff38b659be343f4642f&amp;dn=El+juego+de+la+OCA+%28descubre+tu+futuro%29+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"goliat0408","files":8,"time":1446402254,"description":"\n \nhttp://www.taringa.net/post/info/18461964/Conoce-tu-futuro-con-el-juego-de-la-oca.html\r\n\r\n\r\n\r\nDescubra su futuro con el juego de la oca \r\n\r\n\r\nAl principio de los tiempos se atribuían a la oca virtudes adivinatorias. En la actualidad, este juego esconde en sus casillas un mensaje. ¡Tire los dados y descúbralo! \r\n\r\n¿El juego de la oca predice el futuro? Podría pensarse que se trata de una idea original, pues siempre se ha sabido que es un divertidisimo entretenimiento para niños que se ha transmitido de generación en generación. Sin embargo, ahora le proponemos descubrir con él su futuro. Le ofrecemos un metodo de adivinación que se remonta a tiempos pasados. En babilonia, una de las civilizaciones más antiguas, este juego era considerado un sistema de predicción para los adultos. \r\ny fue en el siglo XVII cuando se convirtió en el pasatiempo que hoy conocemos. Su configuración se inspira en las antiguas formas en espiral -chinas y egipcias- concodias ya en el año 2000 antes de Cristo. Estas casillas tenían un carácter esotérico, y encerraban un cierto misterio que había que desentrañar o descifrar. \r\nLa elección de la espiral no es arbitraria: simboliza los recorridos iniciales del juego, que descubre progresivamente el futuro y se pregunta cuestiones sobre si mismo. El fin del juego se encuentra en el centro de la espiral. Esto hace pensar que las respuestas que se buscan a determinados interrogantes planteados a lo largo de la existencia están en el interiro de uno mismo. \r\nProfundizando con este juego de la oca logrará dar solución a la mayoria de los problemas que se producen en su vida cotidiana y que influyen en su propio ser. \r\n\r\nEste juego lo encontre en una revista de un familiar que desde hace tiempo utiliza este juego, me acorde del juego, mi familiar me dijo que le ha funcionado, por lo tanto sabiendo que en google no se encontraba estando yo lejos decidi y aproveche para escanearlo muy bien y compartirlo con el mundo, este juego estava en una revista de los años 80 o 90 muy vieja, realmente este metodo de adivinacion nadie mas lo conoce ahora mismo sino solo las personas del antepasado y los que hallan tenido esta version de la revista, imagino que este juego en version de adivinacion esta en un libro pero de esos esotericos de brujas ancianas profesionales","torrent":{"xt":"urn:btih:b0b0651ca903273d5101fff38b659be343f4642f","amp;dn":"El+juego+de+la+OCA+%28descubre+tu+futuro%29+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0b0651ca903273d5101fff38b659be343f4642f","infoHashBuffer":{"type":"Buffer","data":[176,176,101,28,169,3,39,61,81,1,255,243,139,101,155,227,67,244,100,47]},"announce":[],"urlList":[]}}