{"title":"Hemingway in Love : His Own Story 2015 {{ERTB}}","uid":12722036,"size":2779117,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b69190af74d19ebc2ae7afd7211ea4f2bd917163&amp;dn=Hemingway+in+Love+%3A+His+Own+Story+2015+%7B%7BERTB%7D%7D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"erapid","files":1,"time":1447003324,"description":"Hemingway in Love : His Own Story 2015\r\n\r\nISBN: 1250077486 | 2015 | EPUB | 192 pages | 3 MB\r\n\r\n \nhttp://i.imgur.com/ENDykue.jpg\r\n\r\n\r\nIn June of 1961, A.E. Hotchner visited an old friend in the psychiatric ward of St. Mary's Hospital. It would be the last time they spoke: a few weeks later, Ernest Hemingway was released home, where he took his own life. Their final conversation was also the final installment in a story whose telling Hemingway had spread over nearly a decade.\r\n\r\nIn characteristically pragmatic terms, Hemingway divulged to Hotchner the details of the affair that destroyed his first marriage: the truth of his romantic life in Paris and how he lost Hadley,the real part of each literary woman he'd later create and the great love he spent the rest of his life seeking. And he told of the mischief that made him a legend: of impotence cured in a house of God; of a plane crash in the African bush, from which he stumbled with a bunch of bananas and a bottle of gin in hand; of F. Scott Fitzgerald dispensing romantic advice; of midnight champagne with Josephine Baker; of adventure, human error, and life after lost love. This is Hemingway as few have known him: humble, thoughtful, and full of regret.\r\n\r\nTo protect the feelings of Ernest's wife, Mary - also a close friend - Hotch kept the conversations to himself for decades. Now he tells the story as Hemingway told it to him. Hemingway in Love puts you in the room with the master as he remembers the definitive years that set the course for the rest of his life and dogged him until the end of his days","torrent":{"xt":"urn:btih:b69190af74d19ebc2ae7afd7211ea4f2bd917163","amp;dn":"Hemingway+in+Love+%3A+His+Own+Story+2015+%7B%7BERTB%7D%7D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b69190af74d19ebc2ae7afd7211ea4f2bd917163","infoHashBuffer":{"type":"Buffer","data":[182,145,144,175,116,209,158,188,42,231,175,215,33,30,164,242,189,145,113,99]},"announce":[],"urlList":[]}}