{"title":"Destiny and Power: The American Odyssey of George Herbert Walker","uid":12807111,"size":127959907,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b83fcb6c20f97b9b1fadda0ac67bf876d6b77b89&amp;dn=Destiny+and+Power%3A+The+American+Odyssey+of+George+Herbert+Walker&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TopShelfBook","files":2,"time":1448136688,"description":"Destiny and Power: The American Odyssey of George Herbert Walker Bush | EPUB\r\n\r\nIn this brilliant biography, Jon Meacham, the Pulitzer Prize–winning author, chronicles the life of George Herbert Walker Bush. Drawing on President Bush’s personal diaries, on the diaries of his wife, Barbara, and on extraordinary access to the forty-first president and his family, Meacham paints an intimate and surprising portrait of an intensely private man who led the nation through tumultuous times. From the Oval Office to Camp David, from his study in the private quarters of the White House to Air Force One, from the fall of the Berlin Wall to the first Gulf War to the end of Communism, Destiny and Power charts the thoughts, decisions, and emotions of a modern president who may have been the last of his kind. This is the human story of a man who was, like the nation he led, at once noble and flawed.\r\n\r\nHis was one of the great American lives. Born into a loving, privileged, and competitive family, Bush joined the navy on his eighteenth birthday and at age twenty was shot down on a combat mission over the Pacific. He married young, started a family, and resisted pressure to go to Wall Street, striking out for the adventurous world of Texas oil. Over the course of three decades, Bush would rise from the chairmanship of his county Republican Party to serve as congressman, ambassador to the United Nations, head of the Republican National Committee, envoy to China, director of Central Intelligence, vice president under Ronald Reagan, and, finally, president of the United States. In retirement he became the first president since John Adams to see his son win the ultimate prize in American politics.\r\n\r\nWith access not only to the Bush diaries but, through extensive interviews, to the former president himself, Meacham presents Bush’s candid assessments of many of the critical figures of the age, ranging from Richard Nixon to Nancy Reagan; Mao to Mikhail Gorbachev; Dick Cheney to Donald Rumsfeld; Henry Kissinger to Bill Clinton. Here is high politics as it really is but as we rarely see it.\r\n\r\nFrom the Pacific to the presidency, Destiny and Power charts the vicissitudes of the life of this quietly compelling American original. Meacham sheds new light on the rise of the right wing in the Republican Party, a shift that signaled the beginning of the end of the center in American politics. Destiny and Power is an affecting portrait of a man who, driven by destiny and by duty, forever sought, ultimately, to put the country first.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:b83fcb6c20f97b9b1fadda0ac67bf876d6b77b89","amp;dn":"Destiny+and+Power%3A+The+American+Odyssey+of+George+Herbert+Walker","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b83fcb6c20f97b9b1fadda0ac67bf876d6b77b89","infoHashBuffer":{"type":"Buffer","data":[184,63,203,108,32,249,123,155,31,173,218,10,198,123,248,118,214,183,123,137]},"announce":[],"urlList":[]}}