{"title":"Railworks TS2016 DTG BR Class 24 Loco Add-On","uid":12716683,"size":310992405,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b97880e07c5dad693fe2e2dd128c9c0243915a70&amp;dn=Railworks+TS2016+DTG+BR+Class+24+Loco+Add-On&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TS2015","files":1,"time":1446943643,"description":"As the first diesel locomotives to be built at BR’s Darlington Works, the Class 24 was built as part of the British Rail Modernisation Plan in the late 1950s. \r\n\r\nThe Class 24 was a Sulzer Type 2, Bo-Bo diesel-electric locomotive built between 1958 and 1961, incorporating numerous elements such as off-the-shelf standardised components used for manufacture, including a Sulzer 6LDA28 diesel engine and a 735Kw British Thomson-Houston (BTH) electric transmission, producing a total of 1,160hp resulting in a top speed of 75mph (120km/h). \r\n\r\nBuilt at BR’s Derby, Crewe and Darlington Works, Class 24s could be seen running services initially around Derby and Crewe, but eventually across the British Rail network hauling both passenger and freight. Fifteen of the original 20 locomotives were put into use on the Southern Region as the Kent Coast electrification scheme was behind schedule, and could also be spotted in the Eastern Region, London Midland Region, Wales and Lancashire. \r\n\r\nClass 24s also took over Condor freight services from London to Glasgow, replacing Class 28s, and became the foundation for the later Class 25 model. \r\n\r\nThe first Class 24 to be withdrawn from service was D5051 in November 1967 and by 1979, all but three Class 24s had been withdrawn from service, 14 of which were scrapped before receiving a TOPS number. The final locomotive, 24081, was withdrawn in October 1980. \r\n\r\nToday, only four of the Class have survived into preservation, D5032 and D5061 at the North Yorkshire Moors Railway, D5054 at the East Lancashire Railway and 24081 at the Gloucestershire &amp; Warwickshire Railway. \r\n\r\nThe BR Class 24 for Train Simulator recreates the locomotive as it operated for British Railways throughout the UK in the 1960s, and is available in British Railways corporate blue/grey livery. Also included are BR Mk1 coaches in corporate blue/grey livery and 40T YGH ‘Sealion’ ballast wagons. \r\n\r\n\r\n\r\n\r\nTHIS ADDON WILL NOT WORK ON LEGIT TRAIN SIMUALTOR 2016!!!!","torrent":{"xt":"urn:btih:b97880e07c5dad693fe2e2dd128c9c0243915a70","amp;dn":"Railworks+TS2016+DTG+BR+Class+24+Loco+Add-On","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b97880e07c5dad693fe2e2dd128c9c0243915a70","infoHashBuffer":{"type":"Buffer","data":[185,120,128,224,124,93,173,105,63,226,226,221,18,140,156,2,67,145,90,112]},"announce":[],"urlList":[]}}