{"title":"PetiteHDPorn - Hannah Reese (Lions) NEW 10 December 2015","uid":12952749,"size":372122063,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:bc182445cf679cd6705addd3258b2ffaba1e6496&amp;dn=PetiteHDPorn+-+Hannah+Reese+%28Lions%29+NEW+10+December+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1449750480,"description":"After searching for Hanna Reese all over his apartment, Bruce Venture finds his wild and crazy babe hanging out on a lion with a leash attached to her neck. This horny babe has sex on the brain, and is happy to give up all control to make sure that she gets whatever her man wants.Pulling Bruce's cuck from his pants so that she can watch it get hard as a rock, Hannah takes a few minutes to do a seductive striptease that leaves her miniskirt dress on the floor. When she's wearing only the leash, she teases her bald twat with the chain and then settles in for a lusty blowjob that conveys every sexy urge this juicy coed has.After pulling Hannah up by her leash, Bruce positions her over the lion statue and bends down to lap at her snatch. Finding her nice and wet, he rises to his feet and slams his cock into her greedy hole. Unable to control herself, Hannah goes crazy moaning and pushing back for every stroke of Bruce's dick. When she gets him on the ground, nothing can stop her from going for an orgasmic stiffie ride!As much fun as the couple is having, they know it can't last forever. Hopping back onto the lion's back, Hannah leans forward for one more pussy pounding. This time when she climaxes she takes Bruce with her as he fills her tight twat with a creampie of cum.\r\nTags: Small Boobs, Shaved Pussy, Brunette, Long hair, Hardcore, High Heels, Girl-Boy, Blowjob, Creampie, Deep Throat, Girls Finishing the Job, Pussy Licking\r\n \nhttp://imgdone.com/viewer.php?file=31794942122965720471.jpg\r\n \nhttp://imgdone.com/viewer.php?file=51210923814340706399.jpg","torrent":{"xt":"urn:btih:bc182445cf679cd6705addd3258b2ffaba1e6496","amp;dn":"PetiteHDPorn+-+Hannah+Reese+%28Lions%29+NEW+10+December+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc182445cf679cd6705addd3258b2ffaba1e6496","infoHashBuffer":{"type":"Buffer","data":[188,24,36,69,207,103,156,214,112,90,221,211,37,139,47,250,186,30,100,150]},"announce":[],"urlList":[]}}