{"title":"Kadambari-720p-DVD.Upscale-HEVC-x265.AC3-2.2 GB-[DDR]","uid":12688250,"size":2391293021,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:be8fa3fe4dde1b4ddb528cf23236a56accda919b&amp;dn=Kadambari-720p-DVD.Upscale-HEVC-x265.AC3-2.2+GB-%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":1,"time":1446633280,"description":"DDR Presents\r\n\r\n\r\nKadambari(2015)\r\n(A film by Suman Ghosh)\r\n\r\nBengali - DVD Upscale - 1280x5444p (2.35:1)- 2.2 GB - x.265.AC3 - 1 Hrs:29 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/Jf8 \nhttp://extraimago.com/image/JWf \nhttp://extraimago.com/image/JWW \nhttp://extraimago.com/image/JW5 \nhttp://extraimago.com/image/JWg \nhttp://extraimago.com/image/JWX \nhttp://extraimago.com/image/JWP \nhttp://extraimago.com/image/JWG \nhttp://extraimago.com/image/JWr \nhttp://extraimago.com/image/JWp \nhttp://extraimago.com/image/JWY\r\n\r\n Tech Specifications: \r\n \nhttp://extraimago.com/image/JfO\r\n\r\nSynopsis:\r\nKadambari Debi (Played by Konkona Sensharma), the sister-in-law of Rabindranath Tagore (Parambrata Chattopadhyay), was also his early muse, who not just encouraged him to write, but was his early critic and was instrumental in getting his early works published. Yet, she was a neglected wife, her husband Jyotirindranath Rabindranath's elder brother (Koushik Sen), getting involved in a myriad of interests and as per rumours other women too.\r\n\r\nThrown in close proximity, an emotional relationship grew up between Rabindranath and Kadambari Debi. It was a relationship that was doomed from the start, and when Rabindranath, after his own marriage started moving away, kadambari Devi committed suicide.\r\n\r\nThis film is about their tempestuous relationship.\r\n\r\nComments:\r\nThe relationship between Tagore and his brilliant sister-in-law has been a topic of interest of all of Tagore's biographers and the subject of some films before this one. But this is the first film that looks at this relationship in detail and explores the formative years of Tagore the poet.\r\n\r\nYou will like the acting of Konkona Sensharma. She is brilliant as the lonely neglected wife who becomes the intellectual muse of one of the greatest poets the world has known, and yet was a tragedieenne, for it was the same relationship, which inevitably gre distant, that led her to take her own life. In comparison, Parambrata as rabindranath is somewhat wooden, unable to stir our passions as much. Koushik Sen as Jyoti Thakur is good, but he did have an easier role to play, although in one scene, on the boat at night, there is a fleeting moment of greatness as he realises his wife's fascination for his younger brother and covers it up.\r\n\r\nThis is a film that has no action scenes, no scenes of unbridled passion, but hold our interest as it explores the world of young lovers in a constraining society. The efforts of the Director is enhanced by some brilliant music direction by Bicram Ghosh. His use of a song by Vidyapati (Bhara Badar, Maha Bhadar) is exquisite. Also brilliant is the cinematography of Barun Mukherjee.\r\n\r\nUploader's Notes:\r\nThe DVD from NK video's is awful. Not only does it have no subtitles,but a huge and extremely ugly logo mars the visuals. We have masked the logo and improved the quality of the images so that you can really enjoy the superb cameramanship of Barun Mukherjee. Even the sound is just 2 Channel AC3. We have preserved the original sound for you.\r\n\r\nCheck the screenshots which are evenly spaced across the film and the sample, which is from the from the song &quot;Bhara Badara, Mah Badara&quot; and is close to the center of the video clip, to get an idea of the quality of this rip.\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDB Link: \nhttp://www.imdb.com/title/tt4658786/\r\nSample (2 minutes): Download from here","torrent":{"xt":"urn:btih:be8fa3fe4dde1b4ddb528cf23236a56accda919b","amp;dn":"Kadambari-720p-DVD.Upscale-HEVC-x265.AC3-2.2+GB-%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be8fa3fe4dde1b4ddb528cf23236a56accda919b","infoHashBuffer":{"type":"Buffer","data":[190,143,163,254,77,222,27,77,219,82,140,242,50,54,165,106,204,218,145,155]},"announce":[],"urlList":[]}}