{"title":"The Decca Sound [50 CDs] 2011","uid":12783929,"size":17046192824,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bef553c0a694710f2fcd99dd3d233d468df43cd2&amp;dn=The+Decca+Sound+%5B50+CDs%5D+2011&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Horisarte","files":1091,"time":1447844519,"description":"https://i.imgur.com/kxNDzz4.jpg\r\n\r\nThis set is a marvel, a mostly wonderful 50-CD tribute to some of the finest stereo recordings ever made in the Classical medium. Smartly packaged, and intelligently chosen, the box is worth having even if one owns some of the contents already. And you are bound to, for even a novice collector will recognize the great singers, conductors, and soloists on display. It's also reasonably priced on both sides of the pond, and is undoubtedly a limited edition, in the sense it will be pulled soon and sold at outrageous eBay prices. So if the prospect interests you, by all means indulge.\r\n\r\nBy and large the historical recordings are of more worth than the more recent offerings. Argenta, Martinon, and Maag all get a nod, and it's equally nice to see that Ashkenazy is being recognized as both an arranger and conductor here. Karajan and Solti naturally appear, although it must be said that those are wholly successful appearances, Dorati gets tons of kudos on Mercury, so one disc will do here; I wish only that it were Haydn. Schiff's justly famous Goldberg's are here, and Radu Lupu gets a disc, even if it's hardly the best. Britten's War Requiem with the composer conducting has been jammed onto one disc, as if it could get any more essential, and Kerstez's Vienna 9th and London 8th make a memorable Dvořák disc indeed.\r\n\r\nThe modern recordings are more variable. I don't really like the disc of songs with Ute Lemper, but some may, and surely it was chosen to show off Decca's artistic range. The &quot;Three Tenors&quot; concert is entirely irritating in that it pushed any number of great recordings out of the set, and the same goes for the live Carnegie concert with Pavarotti, Sutherland, and Horne. The label's new wave; Fleming, Bell, and Bartoli, are here because they had to be, not because any of this is their best work. That said, the early music recordings are all extremely worthwhile and perhaps unexpected in a collection such as this. And Chailly is stunning in both his appearances as are his other currently active counterparts; Mehta, Blomstedt, and Dohnányi.\r\n\r\nThere are also some recordings where the &quot;Decca Sound&quot; is frankly lacking. The New Year's Concert from Vienna is an important historical document, magnificently played, but the sound and especially applause are brittle and unpleasant. And the Walton disc at the end of the set is swallowed by a simply awful acoustic that the engineers were powerless against. Conversely, many of these recordings still pack a massive punch today. Solti's Mahler 8th has been bettered recently, but his soloists have never been equaled, and the disc is a thrill. Maazel's Cleveland disc of orchestral blockbusters is reference material, and Bohm's Bruckner 4th is simply an experience. Dorati's Haydn isn't here, but his wonderfully engineered Stravinsky from Detroit's fabled Orchestra Hall is. So it's a lot of good mixed in with that bad.\r\n\r\nOverall, the set offers incredible value. While a good deal of this material has been around on Decca Legends and later Decca Originals, a good deal of it has not been easy to find. Take the &quot;limited&quot; part of this set very seriously. It serves as a way to build a collection, supplement it, or simply expand it. No matter where you are as a collector, I promise hours of enjoyment. Grab it while you can!\r\n \nhttps://i.imgur.com/FFxrdID.jpg\r\n\r\n \nhttp://www.classical.net/music/recs/reviews/l/lon782826a.php","torrent":{"xt":"urn:btih:bef553c0a694710f2fcd99dd3d233d468df43cd2","amp;dn":"The+Decca+Sound+%5B50+CDs%5D+2011","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bef553c0a694710f2fcd99dd3d233d468df43cd2","infoHashBuffer":{"type":"Buffer","data":[190,245,83,192,166,148,113,15,47,205,153,221,61,35,61,70,141,244,60,210]},"announce":[],"urlList":[]}}