{"title":"Pussyman 14 - Dreams Of A Gigolo 1996 DVDRip","uid":12982066,"size":1792651984,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c38d8fe0f9ac0f65e4b2205c0c13d78a1a2bf2d8&amp;dn=Pussyman+14+-+Dreams+Of+A+Gigolo+1996+DVDRip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EndYou","files":1,"time":1450044073,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/album/6z\r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nYear: 1996\r\nCountry: USA\r\nGenre: Feature, Anal, IR, DP\r\nDuration: 1:39:57\r\nRussian language\r\nTranslation: SP Company odnogolosyj\r\nDirected by: David Christopher\r\nStudio: Snatch Productions\r\n\r\nSindee Coxx, Alex Dane, Jeanna Fine, Kaitlyn Ashley, Kimberly Kummings, Catarina Rinaldi, Monica Orsini, Nyrobi Knight, Nikki Sinn, Kathy Kash, Sid Deuce, Lana Sands, Missy, Kim Kataine, Peter North, Sean Michaels, Randy West, Sean Rider, David Hardman, King Tung, Julian St. Jox\r\n\r\nIn this latest edition of Pussyman's amorous adventures, Peter North stars as a gigolo who decides that he can make even more cash if her starts stealing from his hot-to-trot clients. Or something like that. The plot soon unravels completely, leaving us with a series of white-hot, mainly group encounters featuring some of the most alluringly curvaceous cuties in the industry. Among the hottest scenes is a torrid threeway with gorgeous light-skinned black gal Nyrobi Knight, Sean Michaels and the always-energetic Missy. All three gals put tons of effort into the sex, lifting the scene to ultra-erotic heights with their sweaty enthusiasm. A North / Kimberly Kummings tryst stands out as another high point, while the threesome with Kaitlyn Ashley, Sid Deuce and North will light up the night of any fan of well-enhanced blonde strumpets. There's a nice collection of sexually talented starlets here, with an emphasis on extremely inflated front ends. The huge cast keeps things at a fever pitch even when the &quot;story&quot; gets pretty silly.\r\n\r\nIn this latest edition of the amorous adventures of a womanizer, Peter North plays a gigolo who decides that he can make more money, if it starts to steal his hot clients. Or something like that. The plot is fully revealed soon, leaving us with a series of incandescent mainly of group scenes featuring the most delicious cuties in the industry. Among the hottest scenes from the hottest troynichok gorgeous mulatto Nairobi Knight, Shawn Michaels, and, as always, energetic mission. All three are laid out in a sex scene, raising the level to ultraeroticheskim heights with admirable enthusiasm. Appointment of Peter North and Kimberly Cummings - another hot scene, while the trio with Kaitlyn Ashley, Sid Deuce and Peter North will please any fan of the beautiful horny blonde. In this movie - a beautiful collection of sexy talented stars. Fine cast keeps in a state of extreme excitement, even when the &quot;history&quot; is becoming quite unexpected.\r\n\r\nQuality of video: DVDRip\r\nVideo Format: MKV\r\nVideo: MPEG4 Video (H264) 720x544 25 fps 2000 kb / s\r\nAudio: Dolby AC3 48000Hz stereo 192 kbps","torrent":{"xt":"urn:btih:c38d8fe0f9ac0f65e4b2205c0c13d78a1a2bf2d8","amp;dn":"Pussyman+14+-+Dreams+Of+A+Gigolo+1996+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c38d8fe0f9ac0f65e4b2205c0c13d78a1a2bf2d8","infoHashBuffer":{"type":"Buffer","data":[195,141,143,224,249,172,15,101,228,178,32,92,12,19,215,138,26,43,242,216]},"announce":[],"urlList":[]}}