{"title":"The.Last.Dukes.EN.SUB.x264.WEBRIP.[MPup]","uid":12638348,"size":1057886399,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c3b38a61412ca5d14d61ca4129171a539271b9f5&amp;dn=The.Last.Dukes.EN.SUB.x264.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1445961560,"description":"BBC.Documentaries.2015.10.26.The.Last.Dukes.EN.SUB.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\n\r\n\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nDocumentary featuring archive footage. Dukedoms are created by the monarch, but as they gradually become extinct, what will become of those that remain?\r\n\r\n[img]http://extraimago.com/images/2015/10/27/e8c7aacd4393bbf74e4f3937f79bd41f.jpg[/img]\r\n\r\nDukedoms are created by the monarch for reasons ranging from a grateful nation rewarding a major war leader to a king acknowledging his illegitimate son. The last dukedom to be created was by Queen Victoria. As they gradually become extinct, what will become of those that remain? Do they still have power and wealth? What is it to be a duke in the 21st century?\r\n\r\nAnswers come from a surprising variety of extraordinary characters - the Duke of Marlborough and his aunt, born Lady Rosemary Spencer-Churchill, who remembers being brought up in Blenheim Palace with 36 indoor servants, and the Duke of Atholl, who until 2012 was a rural South African sign-maker called Bruce Murray - on succeeding to the dukedom he now heads the only private army in Europe - the Atholl Highlanders.\r\n\r\nThe Duke of Montrose is a Scottish hill farmer and a politician, one of the few dukes who still sit in the House of Lords. The Duchess of Rutland made dozens of people redundant when she took over Belvoir Castle, but is determined to make it an efficient business.\r\n\r\nThe Duke and Duchess of St Albans don't have a stately pile, but do have their coronets and coronation robes. The duke's heir Charles Beauclerk is fascinated by the history of mental illness in the family. And if Camilla Osborne had been a boy, she would have become the 11th Duke of Leeds. But she wasn't and the dukedom is now extinct. Where does that leave her?","torrent":{"xt":"urn:btih:c3b38a61412ca5d14d61ca4129171a539271b9f5","amp;dn":"The.Last.Dukes.EN.SUB.x264.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3b38a61412ca5d14d61ca4129171a539271b9f5","infoHashBuffer":{"type":"Buffer","data":[195,179,138,97,65,44,165,209,77,97,202,65,41,23,26,83,146,113,185,245]},"announce":[],"urlList":[]}}