{"title":"Camilla Davidsson - Under Vintergatans... - Svensk","uid":12623025,"size":255024463,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c44c3442dd95cd88cea0cb290e5a71ecfe13009d&amp;dn=Camilla+Davidsson+-+Under+Vintergatans...+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"totomas1","files":113,"time":1445627136,"description":"Camilla Davidsson - Under Vintergatans alla stjärnor\r\n\r\nMed Under Vintergatans alla stjärnor utkommer debutanten Camilla Davidsson med en intelligent och trovärdig feelgoodroman om en sönderstressad och vilse karriärkvinnas väg mot inre utveckling.\r\n\r\nI romantrilogins första del tvingas Emma lämna sin på ytan bekväma tillvaro i storstaden. Hon kastas ut på resa som blir fysiskt såväl som psykiskt utmanande, men också början till något nytt.\r\nNär vi lär känna Emma har hon utarbetad flytt karriärjobbet i Stockholm för att söka lyckan i London där Eric, amerikanen hon blivit handlöst förälskad i, bor. Deras relation blir komplicerad och utvecklas i en helt annan riktning än Emma tänkt sig.\r\n\r\nHon lider sig igenom tiden i London och hankar sig fram på tillfälliga jobb. Av en tillfällighet hör hon talas om den tusenåriga pilgrimsleden Camino de Santiago de Compostela i Spanien och får en ingivelse att den är precis vad hon behöver för att reda upp sitt liv.\r\n\r\nMed en gammal ryggsäck och ett par slitna gymnastikskor ger hon sig iväg på den åttio mil långa vandringen mitt under den spanska högsommaren.Att vandra långa sträckor dag efter dag är jobbigare än Emma någonsin kunnat föreställa sig.\r\nUnder mödosamma dagar till fots genom den spanska landsbygden tvingas hon konfrontera sina mörkaste tankar och minnen från det förflutna. Men hon är inte ensam. Längs vägen möter hon en rad färgstarka personer från olika världsdelar och bakgrund.\r\nFlera av dem får stor betydelse för henne på olika plan. Emmas spontana infall utvecklas till en omvälvande resa som får henne att omvärdera sina livsval och allt hon någonsin trott på.\r\n\r\nCamilla Davidsson har själv upplevt hur fel livet kan bli om man gör sina val utifrån en strävan efter att vara lyckad eller att andra till lags. Under Vintergatans alla stjärnor är till stor del baserad på författarens egen historia och hennes eget sökande efter mål och mening i tillvaron.\r\n\r\n\r\nUppläsare: Viktoria Flodström\r\n\r\nAll creds to original ripper","torrent":{"xt":"urn:btih:c44c3442dd95cd88cea0cb290e5a71ecfe13009d","amp;dn":"Camilla+Davidsson+-+Under+Vintergatans...+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c44c3442dd95cd88cea0cb290e5a71ecfe13009d","infoHashBuffer":{"type":"Buffer","data":[196,76,52,66,221,149,205,136,206,160,203,41,14,90,113,236,254,19,0,157]},"announce":[],"urlList":[]}}