{"title":"Sword of the Samurai -Win-Mac-Linux+Extras Drm-free","uid":12644977,"size":33027841,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c45a9832b93ce7ae36fddab7fab9bc155b8a3560&amp;dn=Sword+of+the+Samurai+-Win-Mac-Linux%2BExtras+Drm-free+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Maou-JP","files":7,"time":1446042400,"description":"About: \r\n\r\nEnter Japan in the Age of Warring States. At the center of this role-playing, action-adventure simulation of combat, statesmanship and intrigue, you are a samurai warrior struggling for Honor. More important than life itself, Honor is crucial to achieving your ultimate goal: unifying the country under your noble rule.\r\nIn Sword of the Samurai, you will be part of the culture of feudal Japan, and you must learn to live by its rules. To succeed as a samurai, you must think like the samurai. Learn when to leave your sword in its sheath, when to draw it - and what to do with it once it’s drawn. You will fight duels, lead troops on the battlefields, and defend your family against assassins and kidnappers. If you are courageous and honorable, you may advance to become the head of your clan, and warlord of your province. If you master diplomacy and generalship, and outmaneuver your rivals, you may even become Shogun - absolute ruler of Japan. But remember that in all cultures power corrupts - and those who seek absolute power don’t always play by the rules.\r\n\r\n    Unite all 48 warring provinces in common allegiance to you, and earn the title of Shogun, military ruler of all Japan.\r\n    Computer-controlled opponents make decisions based on your actions -- and on the actions of other rival characters.\r\n    Vindicate yourself in duels against rivals who would like nothing better than to diminish your Honor.\r\n    Furious melee action against multiple warriors takes place in castles, villages and rice paddies.\r\n    Real-time battles involving infantry, cavalry and muskets on battlefields that vary with every conflict.\r\n\r\nObs: Includes both Windows, Mac, Linux editions plus goodies.\r\n\r\nGog","torrent":{"xt":"urn:btih:c45a9832b93ce7ae36fddab7fab9bc155b8a3560","amp;dn":"Sword+of+the+Samurai+-Win-Mac-Linux%2BExtras+Drm-free+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c45a9832b93ce7ae36fddab7fab9bc155b8a3560","infoHashBuffer":{"type":"Buffer","data":[196,90,152,50,185,60,231,174,54,253,218,183,250,185,188,21,91,138,53,96]},"announce":[],"urlList":[]}}