{"title":"Rent.A.Cop.s01e02.EN.SUB.x264.WEBRIP.[MPup]","uid":12704612,"size":518537384,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c62a2994aa70a2e1d11de32f1ce35996ed92c6ef&amp;dn=Rent.A.Cop.s01e02.EN.SUB.x264.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1446816353,"description":"Rent.A.Cop.s01e02.EN.SUB.MPEG4.x264.WEBRIP.[MPup]\r\n\r\nFormat: MPEG-4\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]2 of 8[/b]\r\n\r\nSeries following a Darlington-based private security firm. New apprentice Pembow has to make his first sales pitch, while boss Francis has a date at a trendy local restaurant.\r\n\r\n[img]http://extraimago.com/images/2015/11/06/afa3b91d70d60c0b24bf2bff221dc7c4.jpg[/img]\r\n\r\nObservational documentary series following Sparta Security, a Darlington-based private security firm. Sparta is run by well-known local character Francis Jones, who has given behind-the-scenes access to himself, his staff and their operations.\r\n\r\nFrancis is a born-again Christian and former professional boxer. He is a man with a big personality, and he's on a mission to clean up the streets of Darlington. No job is too small for Sparta Security, and Francis often goes the extra mile to help his clients, with often outrageous but also hilarious consequences.\r\n\r\nFrancis relies on his office team Rachel and Claire, who use their unusual sales techniques to help him find and secure new business. The work they bring in varies from mediating in neighbourhood disputes to guarding against grand larceny at big businesses in the area. Francis employs a number of security staff to work with him, including balaclava-clad ex-forces officers, part-time bouncers and a personal trainer, and together they use a range of unorthodox methods to make Darlington a better place to live.\r\n\r\nNew apprentice Pembow is thrown in at the deep end with his first sales pitch to a potential Sparta client, and his stakeout training continues with another covert mission. Love is in the air as Francis has a date at a trendy local restaurant. The only problem is that, en route to pick up the lucky lady, he's forgotten both her name and address. Elsewhere, Francis is back on the trail of Darlo's nuisance bikers. A local football team have complained of motorbikes riding across the pitch during games, and Francis is determined that this time he'll catch his prey","torrent":{"xt":"urn:btih:c62a2994aa70a2e1d11de32f1ce35996ed92c6ef","amp;dn":"Rent.A.Cop.s01e02.EN.SUB.x264.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c62a2994aa70a2e1d11de32f1ce35996ed92c6ef","infoHashBuffer":{"type":"Buffer","data":[198,42,41,148,170,112,162,225,209,29,227,47,28,227,89,150,237,146,198,239]},"announce":[],"urlList":[]}}