{"title":"KAVAL KILK JA KAKSTEIST LOLLI","uid":12940112,"size":2672172,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c8d488231f0aa67c0f79aa384bb609d391c7a8e6&amp;dn=KAVAL+KILK+JA+KAKSTEIST+LOLLI&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kolhoos","files":1,"time":1449621931,"description":"KAVAL KILK JA KAKSTEIST LOLLI\r\n\r\nAutor: JAANO MARTIN OTS, TARMO TEEVÄLI \r\n\r\nIgast vigurvändast ei kirjutata raamatuid. Aga et Rein Kilk on eriline mees, tunnistavad needki paljukannatanud ligimesed, kelle elutee ristumine selle särasilmse kavalpea tegemistega on toonud kaasa pisaraid, halle juukseid, rahalisi kaotusi ja kohtukutseid. \r\n\r\nSorava jutuga, optimistlik ja plaanidest pakatav Kilk aga jätab intervjuudes ning raadio- ja TV-esinemistes rõõmsameelse mulje, puhub pasunat ja kandideerib nii Tartu linnapeaks kui Riigikogu liikmeks. Kui jutuks tulevad pankrotid, maksmata võlad või kohtuasjad, lasevad tema kommentaarid aimata, et tema on puhas kui prillikivi ning süüdi on kõik teised. \r\n\r\nUurivate ajakirjanike aastaid kestnud töö tulemusel on välja joonistunud ärimuster, mida võiks kirjeldada vanasõnaga: loll saab kavala Kilgiga äri tehes alati peksa! See viimane muide polegi ainult sõnakõlks, kunagine Pärnu linnapea ning hiljem lühiajaliselt Kilgi alluvuses töötanud Mart Viisitamm meenutab koguni politseisse jõudnud käsikähmlust, millega ülemus teda õpetada püüdis. \r\n\r\nMiks Neinar Seli, Oliver Kruuda, Jüri Mõis, Urmas Sõõrumaa, Hans H. Luik, Rain Lõhmus, Olga Aasav, Endel Siff, Indrek Sepp, Tauno Kangro ja mitmed teisedki Kilgiga enam kunagi midagi ühist ette ei võta, aitavad selle raamatu külgedel selgitada Kilgi kunagised alluvad, endised äripartnerid ning väitluspartnerid paljudes jaburates kohtuasjades. \r\n\r\n„Füüri laskmise“ ja „kuse kurnamisega“ kuulsaks saanud Reinu aga võivad paljud algajad ärimehed eeskujuks võtta: kuigi paljudele tuska tekitanud ja rohkematele võlgu jäänud mees naudib endiselt luksuslikku elustiili ning on isiklikuks eeskujuks kõigile Riigikogu valimistel tema poolt hääletanud 260-le Pärnu valijale. \r\n\r\nVõtkem seda raamatut kui lollide tervitust kavalale ärimehele, kellega kokku puutumine on avanud neile äritegevuse ennenägematuid tahke ning üht-teist uut õpetanud","torrent":{"xt":"urn:btih:c8d488231f0aa67c0f79aa384bb609d391c7a8e6","amp;dn":"KAVAL+KILK+JA+KAKSTEIST+LOLLI","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8d488231f0aa67c0f79aa384bb609d391c7a8e6","infoHashBuffer":{"type":"Buffer","data":[200,212,136,35,31,10,166,124,15,121,170,56,75,182,9,211,145,199,168,230]},"announce":[],"urlList":[]}}