{"title":"[NubileFilms] Ariana Marie, Marley Brinx (Sexy Surprise) SD **NE","uid":12870215,"size":243396327,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c90c5e7b6a2cf354691ede46d04adc204b53a80f&amp;dn=%5BNubileFilms%5D+Ariana+Marie%2C+Marley+Brinx+%28Sexy+Surprise%29+SD+%2A%2ANE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"UniX","files":1,"time":1448871315,"description":"[NubileFilms] Ariana Marie, Marley Brinx (Sexy Surprise) SD **NEW NOV 30,2015**\r\n\r\nSCREENS\r\n \nhttp://imgurx.net/share-864E_565BF686.html\r\n\r\nBabes Ariana Marie and Marley Brinx are dressed in next to nothing and ready to seduce when Johnny Castle arrives. They beckon him over as they exchange a kiss, making it clear that they want him to join them in a lusty threesome. The trio undresses between sweet kisses and soft touches to each other's sensitive bodies.\r\n\r\nOnce Marley's thong has been rolled down her long legs, Johnny can't wait another moment to bury his face in her landing strip twat. Dropping to his knees, he slides his tongue over Marley's soft slit to sample her juices. Ariana isn't left out for long; Johnny gets to his feet and presses her onto the bed so that he can slip his tongue into the slit of her crotchless thong and go to town suckling her needy clit.\r\n\r\nAs Ariana's cries of eagerness get louder, Johnny responds by slipping two fingers into her tight twat. Marley is happy to help by slipping her hand between her friend's thighs to rub her clit so that soon the coed is moaning her orgasm.\r\n\r\nNext up it's Johnny's turn to enjoy some oral sex and the girls are happy to deliver. Getting on their hands and knees, they take turns putting their warm mouths to work sucking and deep throating his big cock. They spend some time working Johnny over one at a time, but the rest of the time they work in tandem with one girl sucking on his balls and licking his shaft while the other Hoovers the tip.\r\n\r\nWhen they have finally warmed Johnny up sufficiently, the girls use him as their own personal stud. First Marley gets Ariana settled onto Johnny's cock so she can go for a cowgirl ride, and then Marley takes care of her own pleasure by seating herself so that her needy snatch covers Johnny's face.\r\n\r\nOf course, Marley needs to get her pussy filled too! Once Ariana has temporarily satisfied herself, she lies down on the bed with her legs spread wide so that Marley can lean forward to eat her lover's pussy out while Johnny fucks her from behind.\r\n\r\nJohnny manages to bring Marley to a climax, but he's not quite spent yet! Marley is happy to scoot up a little bit so that Ariana's lusty twat is easily accessible and primed for a pussy pounding. The horny coed can't contain her gasps of excitement as Johnny goes to town on her landing strip fuck hole, sending her screaming over the edge.\r\n\r\nJohnny can't wait another moment to cum once he has brought Ariana off. Pulling out, he releases his load all over Ariana's belly and Marley's waiting face and mouth. The girls aren't quite satisfied with that; they both need to lick his cock clean and then exchange a long kiss as they enjoy the cleanup of their lover's cum","torrent":{"xt":"urn:btih:c90c5e7b6a2cf354691ede46d04adc204b53a80f","amp;dn":"%5BNubileFilms%5D+Ariana+Marie%2C+Marley+Brinx+%28Sexy+Surprise%29+SD+%2A%2ANE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c90c5e7b6a2cf354691ede46d04adc204b53a80f","infoHashBuffer":{"type":"Buffer","data":[201,12,94,123,106,44,243,84,105,30,222,70,208,74,220,32,75,83,168,15]},"announce":[],"urlList":[]}}