{"title":"Minority.Report.S01E08.READNFO.HDTV.x264-FLEET","uid":12775913,"size":378531483,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ca0f0417da379cd7b1c7a76dfb1c863fef2fc5b0&amp;dn=Minority.Report.S01E08.READNFO.HDTV.x264-FLEET&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TvTeam","files":5,"time":1447733281,"description":"------------------------------------------------------------------------\r\n\r  https://www.torrenting.com\r\n\r\nSign up is OPEN - for time being. Come and have fun.\r\n\r\n------------------------------------------------------------------------\r\n.Minority.Report.S01E08.READNFO.HDTV.x264-FLEET                                \n\nDate:          2015-11-16                                   \nSize:          354.08 MiB                \nDuration:      42:28          \nResolution:    720x404        \nFramerate:     23.976         \nVideo Bitrate: 1028 Kb/s      \nAudio:         2ch, 131kbps   \nCRF:           19    \nSubtitle:      N/A          \n\nFrom now on we will not see 0sec as a legit pre group.\n\nWe know they early addpre and auto mkdir at sites before the release is ready, and then race the files later.\nThese people have the audacity to addpre to databases and undermine all groups who actually pre complete.\nOur investigation has found that the first site to mkdir is done so by an autobot.\nThis is against what the entire scene stands for and what competition means.\n\nRar-files are traded off their dump with   ** autobot and the sfv is NEVER traded right away.\nWhy are they not sending the sfv right away? Well answer is simple, they cant because the release is not &quot;complete&quot; yet.\nNo one has access to their predump and clearly 0SEC cant allow people on it, otherwise their cheating\nfairytale would be over.\n\nNow after some talks to the guy behind   **, he admits he has access to this dump, but he does not want to help\nwith any screenshots or anything to prove us wrong. According to him, he just auto from their so called dump to a \nfew sites and thats it and he has no time to look into it.\n\nNow lets look at another fact. Its not rocket science that people behind KILLERS &amp; 0SEC are the same lamers.\nKILLERS pres SD while 0SEC pres 720p. KILLERS cant pre the 720ps EARLIER theirselves because then they will be \ncaught cheating if they did, because they pre on a couple of REAL sites with traders trading off their pres. Thats\nthe main reason they had to establish a new grp which only emerge when there is competition against KILLERS, \nthe so called 0SEC. And this particular grptag is used to early addpre releases and trade them before the complete\nrelease could be pred. A reason sfv will NEVER be traded right away or a proof could be provided for it being there.\n\nKILLERS/BATV also do not internal 0SEC pres, even though many are nuked and have abrupt endings. \nThey simply do not want to internal their own groups.\n\nIn one of the nfos KILLER's pred they wrote that they do not have anything to do with nukenets. Not true.\nThey staff the nukenets -&gt; Onenet/sheep/Zonenet/Localnet. They immediately get defensive when KILLERS and 0SEC \nreleases are nuked on these nukenets and even when 0SEC/FLEET pres same second, they immediately nuke FLEET without \nany investigation and when 0sec pres later then FLEET they say same second with no proofs. It is absolutely shameful \nthat none of the other nukers stand up and investigate so these bias nukenets can be corrected, the rest of the staff \nis also responsible for letting 0SEC addpre as they refuse to do their jobs.\n\nWe will be ignoring all 0SEC pres going forward and all the invalid 0SEC dupe nukes on these pathetic nukenets. These \nnukenets have become a team to defend certain groups rather than fairly evaluating all pres and doing unbias work. \nWe no longer trust them, their standards are far beneath that of the REAL scene","torrent":{"xt":"urn:btih:ca0f0417da379cd7b1c7a76dfb1c863fef2fc5b0","amp;dn":"Minority.Report.S01E08.READNFO.HDTV.x264-FLEET","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca0f0417da379cd7b1c7a76dfb1c863fef2fc5b0","infoHashBuffer":{"type":"Buffer","data":[202,15,4,23,218,55,156,215,177,199,167,109,251,28,134,63,239,47,197,176]},"announce":[],"urlList":[]}}