{"title":"Head Soccer LaLiga 2016 v2.2.0 Mod + data","uid":12981295,"size":50939250,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:cb2e50126f3434e8e79aa967f3dd8a5a7da9a57a&amp;dn=Head+Soccer+LaLiga+2016+v2.2.0+Mod+%2B+data&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":2,"time":1450035053,"description":"Head Soccer LA LIGA is the official app for Spanish league football for the 2015-2016 season!\r\n\r\nEnjoy the latest football with all of the teams and superstars of La Liga BBVA.\r\n\r\nNow you just need to choose your favourite team, get out on the field, show off your skills, and win tournaments!\r\n\r\nABILITIES:\r\nSPEED: Move more quickly down the field\r\nSHOT: Improve your kicks and shots on goal\r\nJUMP: Leap higher to help you attack and defend your goal\r\nSPRINT: Improve your sprint to overtake your opponent\r\nPOWER UP: Reduce the time you have to wait for special shots\r\n\r\nFRIENDLIES\r\nStart a friendly match! Just choose a team of your favourite player and then select any team as your opponent. Complete all of the challenges to become the best!\r\n\r\nCUP\r\nOnly champions are remembered! If you want to go down in history you must take on your rivals in elimination finals. Make it through all of the rounds and enjoy unforgettable moments that only a few get to experience, playing in a Cup Final!\r\n\r\nLEAGUE\r\nConsistency is key to success in the League! You must face all of the teams and gain points match by match to reach the ultimate objective… to be ranked at the top by the end of the season.\r\n\r\nCHALLENGE\r\nOnly the best players are able to take on this challenge! Show off your ball skills and beat each round as though it were a final!\r\n\r\nDo you think you've got what it takes to be a CHAMPION? Download Head Soccer LaLiga now!\r\n\r\nWhat's new:\r\n- Personalizad players of RC Deportivo and RC Celta teams\r\n- You can exchange gold for bills in the store, and we've improved the exchange of gold for bills\r\n- Optimization of rewarded videos\r\n\r\n\r\nContains annoying pop-up Ads\r\nRequires Android: Varies with device","torrent":{"xt":"urn:btih:cb2e50126f3434e8e79aa967f3dd8a5a7da9a57a","amp;dn":"Head+Soccer+LaLiga+2016+v2.2.0+Mod+%2B+data","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb2e50126f3434e8e79aa967f3dd8a5a7da9a57a","infoHashBuffer":{"type":"Buffer","data":[203,46,80,18,111,52,52,232,231,154,169,103,243,221,138,90,125,169,165,122]},"announce":[],"urlList":[]}}