{"title":"Desperate Pleasures - Anal First Timers 2 XXX","uid":12932103,"size":1353170096,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:cd3c4cad947b6961e23ff6f0229af3301d07eaa6&amp;dn=Desperate+Pleasures+-+Anal+First+Timers+2+XXX+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"feeldabyte","files":3,"time":1449536360,"description":"Screens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/rNHRe \nhttp://imgkiss.com/image/rNdM4\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\n\r\nInvolved: Bailey Paige, Anna Oksana, Camille Black, John Noble, JW Ties\r\n\r\nXXX that just shouldn't happen! Tiny Bailey Paige has been in several XXX scenes and done a ton of fetish modeling. About a year ago she promised her first anal scene when she was ready so we waited patiently. When she was finally ready she was still pretty nervous so I warmed her up with a bit of rough sex on the couch. We moved into the bedroom and started stretching her tight asshole. I played with the buttplug while she sucked my cock. The buttplug popped out and before Bailey knew what hit her, my cock was buried in her ass. That was one first time worth waiting for! 18 Year old Anna Oksana has the most amazing ass and after doing a few XXX videos she decided to do her first anal scene. We startd off letting her use the hitachi to relax and before we knew it Anna squirted for the very first time. Between butt plugs, a glass toy and the Hitachi Anna was ready for a hard cock. As soon as my cock was in her ass Anna started calling me daddy and begging me to fuck her ass harder so I did. Anna came quite a few times and ended up with a very well filled ass by the time we were through. Filmed on 2 cams, so you won't miss a thing! Curvy tattooed nympho Camille Black has wanted to be in porn for most of her life so when John contacted her on Fetlife it was a dream cum true. She got ready for the shoot and started using a few toys for the photo shoot but before long this dirty girl has the photographer's cock in her mouth while she masturbates with toys. One thing leads to another and Camille not only gets fucked for the first time on camera, she takes a thick, gooey creampie in her gaping asshole too. \r\n\r\n\r\nSail to another one :  https://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:cd3c4cad947b6961e23ff6f0229af3301d07eaa6","amp;dn":"Desperate+Pleasures+-+Anal+First+Timers+2+XXX+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd3c4cad947b6961e23ff6f0229af3301d07eaa6","infoHashBuffer":{"type":"Buffer","data":[205,60,76,173,148,123,105,97,226,63,246,240,34,154,243,48,29,7,234,166]},"announce":[],"urlList":[]}}