{"title":"Forensic Report on Nazi Death Camps - The Rudolph Report [EN PDF","uid":12667582,"size":4627359,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cdb6822c34f0d8fb93141091b64ffa63c82aaa1d&amp;dn=Forensic+Report+on+Nazi+Death+Camps+-+The+Rudolph+Report+%5BEN+PDF&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"perfect_stan","files":1,"time":1446385406,"description":"Forensic Report on Nazi Death Camps - The Rudolph Report\r\n\r\n\r\nIn the 1970's, the stories passed down about the WW-2 German prison camps were welded together into a narrative we now call &quot;the Holocaust&quot; - meaning &quot;the burnt offering.&quot; Through telling and re-telling, the Holocaust has grown to a multi-million dollar industry, and has changed to mean something particular to Jewish history. It has been used to found a nation (Israel), and to justify many exceptions to morality.\r\n\r\nTherefore, true scientific investigations and analysis fill a crucial role.\r\n\r\nInvestigations of physical evidence and original documentation, however, have cast doubts on the Holocaust narrative that has been formed. For example, areas claimed to be mass graves, have been found with modern investigative technology to contain no human remains. Testimonies of accused perpetrators show evidence of outright fabrication, or were obtained through torture. Many of the supposed eyewitnesses have provided stories riddled by inconsistencies, describe physically impossible events, or were even total frauds who were never actually in the camps.\r\n\r\n\r\nIf the Holocaust narrative is false, the ramifications are far reaching. Ethnic Germans have been slandered for decades on the basis of the Holocaust. Terrorism used in the founding of Israel was justified through it. It was even used to justify the slaughter, rape, and murder of millions of ethnic Germans after World War 2.\r\n\r\nPlease SEED!!!","torrent":{"xt":"urn:btih:cdb6822c34f0d8fb93141091b64ffa63c82aaa1d","amp;dn":"Forensic+Report+on+Nazi+Death+Camps+-+The+Rudolph+Report+%5BEN+PDF","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cdb6822c34f0d8fb93141091b64ffa63c82aaa1d","infoHashBuffer":{"type":"Buffer","data":[205,182,130,44,52,240,216,251,147,20,16,145,182,79,250,99,200,42,170,29]},"announce":[],"urlList":[]}}