{"title":"Paolo Conte - Un Gelato Al Limon [Flac][TntVillage]","uid":12961178,"size":195703409,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cf1835673d873af0f96bdf460c80873cce7f2ace&amp;dn=Paolo+Conte+-+Un+Gelato+Al+Limon+%5BFlac%5D%5BTntVillage%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"funk1971","files":18,"time":1449850659,"description":"\nhttp://extraimago.com/images/2015/12/07/Album.jpg\r\n\r\nAlbum:Un Gelato al Limon\r\nArtist:Paolo Conte\r\nRelased:1979\r\nLabel:BMG\r\nContiene Tracce separate, log, cue, m3u, cover(600dpi)\r\n\r\n[b]Tracklisting[/b][i]\r\n1. La Donna d'Inverno\r\n2. Bartali\r\n3. Arte\r\n4. Angiolino\r\n5. Dal Loggione\r\n6. Gelato al Limon\r\n7. Blue Tangos\r\n8. Sud America\r\n9. Uomo Camion\r\n10. Rebus[/i]\r\n\r\n\r\nWhile his first two superb albums, released in 1974 and 1975, failed to gain widespread popularity for Paolo Conte, his reputation among Italian songwriters kept growing steadily. In the meantime, Conte spent four years away from his solo career concentrating on other projects, but finally made the third time lucky with 1979's Un Gelato al Limon. The album's success was undoubtedly boosted when Lucio Dalla and Francesco de Gregori performed the title track in their mega-tour, as documented by the subsequent live album Banana Republic. The same year, Enzo Janacci included two other Conte originals from Un Gelato al Limon on his album Fotoricordo. Musically or lyrically, there is little in Un Gelato al Limon (or in almost any other Paolo Conte album, for that matter) that was not already present in the first two records. In fact, the new batch of material is, if anything, less consistently excellent than those of the previous releases. Several of the songs feel like rewrites of older ones, something that would become a constant in Conte's career. This is perhaps hardly avoidable for a songwriter like Conte, who has always concentrated on a fixed set of themes and characters, such as provincial bourgeois boredom and vaudeville artists, and the particular world they inhabit. At any rate, any Paolo Conte effort is a most enjoyable affair, and Un Gelato al Limon is no exception. Two of his best-known songs are here, the title track and &quot;Bartali,&quot; two trademark Conte snapshots of watching life passing by through the slow Italian summer, with its scant spectacles and consolations -- a fleeting (probably illicit) love affair and bicycle racing, respectively. Another colpo di genio is &quot;Dal Loggione,&quot; one of those Conte songs about the love of music, a subject that allows him to sound more genuinely sincere than steeped in character, as is usually the case. As if to signal his entrance into star status, Un Gelato al Limon is the first Paolo Conte album to feature his photograph on the cover. Of course, he is shown against the darkened stage of a shabby nightclub, with the locale's bar counter featured on the back cover. A man and his world, indeed","torrent":{"xt":"urn:btih:cf1835673d873af0f96bdf460c80873cce7f2ace","amp;dn":"Paolo+Conte+-+Un+Gelato+Al+Limon+%5BFlac%5D%5BTntVillage%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf1835673d873af0f96bdf460c80873cce7f2ace","infoHashBuffer":{"type":"Buffer","data":[207,24,53,103,61,135,58,240,249,107,223,70,12,128,135,60,206,127,42,206]},"announce":[],"urlList":[]}}