{"title":"PetiteHDPorn - Emma Brown (Petite Passion) NEW 24 October 2015","uid":12627803,"size":250648114,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:d05384e24074bdfe87c509c1976668f23cf77286&amp;dn=PetiteHDPorn+-+Emma+Brown+%28Petite+Passion%29+NEW+24+October+2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1445796607,"description":"Lusty Russian Emma Brown has invited her boyfriend Edward Bleek back to her dorm for the first time, and she's intent on letting nature take its course. The sweet brunette can't keep her hips from swaying as Edward works them both out of their clothes, nor can she prevent her cry of eagerness when Edward puts his mouth and magic fingers to work pleasuring her tight bald slit.Emma can't wait to get her pussy fucked, but she isn't about to do that without doing some tasting of her own. Getting on her knees, she opens her mouth wide to take as much of Edward's cock as possible in a blowjob that gets him harder than ever. When she turns around and then leans forward on her hands and knees, though, Edward knows that the foreplay is over.The couple comes together doggy style, but soon they are exploring every raunchy position that Emma dreams of. The lusty coed can't get enough of her lover's dick deep in her juicy twat, especially as he brings her to one climax after another. When it's finally Edward's turn to cum, Emma watches with a smile as he pulls out and jizzes all over her flat belly to brand her with his love.\r\nCategories: Small Boobs, Puffy Nipples, Brunette, Long hair, Hardcore, Tan, Girl-Boy, Blowjob, European, Deep Throat\r\n \nhttp://imgdone.com/viewer.php?file=05785027287834163249.jpg\r\n \nhttp://imgdone.com/viewer.php?file=66779498946302604467.jpg","torrent":{"xt":"urn:btih:d05384e24074bdfe87c509c1976668f23cf77286","amp;dn":"PetiteHDPorn+-+Emma+Brown+%28Petite+Passion%29+NEW+24+October+2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d05384e24074bdfe87c509c1976668f23cf77286","infoHashBuffer":{"type":"Buffer","data":[208,83,132,226,64,116,189,254,135,197,9,193,151,102,104,242,60,247,114,134]},"announce":[],"urlList":[]}}