{"title":"01.British.Liberalism.The.Grand.Tour.AAC.m4a.BBCRadio4RIP.MPup","uid":12959639,"size":13267985,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:d186b3862ded496984980315c85622c82ffef756&amp;dn=01.British.Liberalism.The.Grand.Tour.AAC.m4a.BBCRadio4RIP.MPup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":1,"time":1449833452,"description":"01.British.Liberalism.The.Grand.Tour.John.Locke.v.Arbitrary.Power.AAC.m4a.BBC.Radio.4.WEBRIP.[MPup]\r\n\r\nAudioCodec: AAC audio file\r\nChannels: 2 channels / Stereo\r\nSamplingRate: 48.000 kHz\r\nBitRate: 128 kbps\r\nRuntime: 13:39 Minutes\r\n\r\nAnne starts in Oxford in 1683, with the story of the last large-scale book burning in Britain. She traces how dissident philosopher John Locke took on the whole principle of the arbitrary power of the monarchy.\r\n\r\nAs Anne discovers with the help of Justin Champion and Hannah Dawson, dissident texts were burned and Locke was repeatedly driven out of the country and hunted by the King's agents. Yet all the time he was developing his ideas on the proper limits of power, and on religious toleration.\r\n\r\nWhen James II was ousted in 1688, Locke returned to London in triumph, and his ideas have helped to shape how we live ever since.\r\n\r\nBut, as Anne explores in later episodes, the story of British liberalism is not one of straightforward victories. Locke explicitly excluded non-Anglicans from his vision of liberty. And what about black people, or women?\r\n\r\nOver the course of the first five programmes, Anne traces the development of the ideas we now call liberalism through the lives and works of Adam Smith, Mary Wollstonecraft, Thomas Clarkson, John Bright and John Stuart Mill.\r\n\r\nShe explores how a rebellion led by black Jamaicans led to a massacre - and how demands that the British Governor of Jamaica be put on trial divided Victorian intellectuals against each other.\r\n\r\nAnd she ends the first week of programmes with the apotheosis of one kind of liberalism in the era of William Gladstone, even as a different version of his creed was taking shape.\r\n\r\nIn the second week, Anne takes us from the non-violent Suffragist campaign for votes for women, onto the triumph of an elite liberalism in the 1960s - and explores how, ever since, the idea of liberalism has grown more and more complicated","torrent":{"xt":"urn:btih:d186b3862ded496984980315c85622c82ffef756","amp;dn":"01.British.Liberalism.The.Grand.Tour.AAC.m4a.BBCRadio4RIP.MPup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d186b3862ded496984980315c85622c82ffef756","infoHashBuffer":{"type":"Buffer","data":[209,134,179,134,45,237,73,105,132,152,3,21,200,86,34,200,47,254,247,86]},"announce":[],"urlList":[]}}