{"title":"FemaleAgent - Don, Vanny (Sexy witch masturbates as married coup","uid":12639691,"size":829148710,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:d1ea219ff83b932d46030206b71ae58daec7d1c3&amp;dn=FemaleAgent+-+Don%2C+Vanny+%28Sexy+witch+masturbates+as+married+coup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"EndYou","files":1,"time":1445975898,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/image/Zf0 \nhttp://imgpremium.com/image/Zfh \r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nThe name of the actress: Alexis Crystal aka Anouk, Don and Vanny\r\nName movie: Sexy witch masturbates as married couple fuck on the couch\r\nNumber Online: f1328\r\nNPP site and the site: FemaleAgent.com / FakeHub.com\r\n\r\nYear: 2015\r\nGenre: Creampie, Sex Toys, Casting, Amateur\r\nDuration: 00:37:05\r\n\r\nDon and Vanny (37 mins). It was approaching Halloween so I decided to don my sexy witches outfit and decorate the office with some pumpkins. When the casting couple arrived I was a bit disappointed that they did not even mention my outfit or the effort I'd put into the office, but I guess it's not everyone's favorite time of year. We proceeded with the interview and they seemed like an open minded married couple and I was able to convince them to do a casting for me in return of which I would give them plenty of work. They seemed a little nervous at first but she was soon on her knees stuffing her husbands cock into her mouth. I began to give them directions on what to do next, like trying the 69 position and for the husband to lick his wifes pussy. Watching these two fuck on my couch was getting me really turned on, but married couples often do not want me to join in. So I pulled my favorite toy and sat down on the couch next to them. I told them to carry on and as I watched her ride her husbands cock, moaning with satisfaction, I slipped my dildo into my wet pussy. I was so turned on and masturbating next to this horny couple was pushing all of my buttons. I was soon contorted in ecstasy on the couch as I fucked myself to a glorious orgasm. As I sat there bathing in the glow of my orgasm, I watched them continue to fuck. They were not a very vocal couple but they were really enjoying themselves on my couch.Then, without warning, his body went all stiff as he blew his load deep inside her tight pussy. I asked him if he had cum inside his wifes pussy and he did not reply, but when he pulled out two massive loads of cum came dripping out of her pussy. It was such a beautiful sight, there's nothing sweeter then a husband giving his wife a creampie for a Halloween treat.\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 852x480 24fps 2720kbps\r\nAudio: AAC 44100Hz stereo 127kbps","torrent":{"xt":"urn:btih:d1ea219ff83b932d46030206b71ae58daec7d1c3","amp;dn":"FemaleAgent+-+Don%2C+Vanny+%28Sexy+witch+masturbates+as+married+coup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1ea219ff83b932d46030206b71ae58daec7d1c3","infoHashBuffer":{"type":"Buffer","data":[209,234,33,159,248,59,147,45,70,3,2,6,183,26,229,141,174,199,209,195]},"announce":[],"urlList":[]}}