{"title":"Age.Gap.Love.[UK].s02e03.360p.LDTV.ABC.AU.WEBRIP.[MPup]","uid":12864500,"size":215169004,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d33760d5a229664f3ee33691533163109e827e05&amp;dn=Age.Gap.Love.%5BUK%5D.s02e03.360p.LDTV.ABC.AU.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":1,"time":1448779283,"description":"Age.Gap.Love.[UK].s02e03.360p.LDTV.ABC.AU.WEBRIP.[MPup]\r\nLow-Definition Television (LDTV) ABC iview WEBRIP: 640x360\r\n[b]My Family Disapprove[/b]\r\n\r\n[i]Age Gap Love, follows couples from across the UK and the US who are determined to prove that mileage on the clock is no barrier to real romance - despite suffering judgement and backlash from friends and family.[/i]\r\n\r\nFormat: MPEG-4\r\nSize: 640x360\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 44.1 KHz\r\n\r\nDespite age differences ranging from 20 to almost 60 years, the couples in this series are all unified in their determination to prove that mileage on the clock is no barrier to real romance. Each episode examines a different theme, from marriage to the problems caused by intergenerational relationships.\r\n\r\nPat and Mark have a 32-year age gap, and this Newcastle couple also have starkly differing life experiences when it comes to marriage. This is Markʼs first serious relationship while 60-year old Pat has been married eight times previously! Many of Markʼs relatives, however, are unhappy about his plans to become Patʼs ninth husband and are refusing to attend his age-gap wedding.\r\n\r\nIn Hemel Hempstead, 69-year-old Bob is so in love with his 29-year-old wife, Kelly, that he has had her image tattoed on the bald spot at the top of his head! Kelly talks about her longing to have children one day and her decision not to have them with Bob! They both agree that he is just too old.\r\n\r\nRichard, 49, and Elizabeth, 23, live in the midwestern US state of Missouri, where they work together as cattle hauliers. The programme follows them on the road and meets Richardʼs daughter, who reveals her shock at first hearing about Richardʼs age gap lover.\r\n\r\nJames, 28, and Yet Wha, 48, from Norwich first met on an online dating website for people seeking age-gap love. They have been together ever since and now James is secretly hoping that she will agree to be his much older wife. The cameras are there for the surprise proposal, but will Yet Wha say yes?\r\n\r\n[img]http://extraimago.com/images/2015/11/29/dc2903164f5473a8d5904b806c7ed2a1.jpg[/img]","torrent":{"xt":"urn:btih:d33760d5a229664f3ee33691533163109e827e05","amp;dn":"Age.Gap.Love.%5BUK%5D.s02e03.360p.LDTV.ABC.AU.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d33760d5a229664f3ee33691533163109e827e05","infoHashBuffer":{"type":"Buffer","data":[211,55,96,213,162,41,102,79,62,227,54,145,83,49,99,16,158,130,126,5]},"announce":[],"urlList":[]}}