{"title":"Doctor.in.the.House.Complete.Series.1.EN.SUB.x265.WEBRIP.[MPup]","uid":12959036,"size":691523433,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d50f01890fc195488385003fbc6f32cf4fc1de0b&amp;dn=Doctor.in.the.House.Complete.Series.1.EN.SUB.x265.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":6,"time":1449824538,"description":"Doctor.in.the.House.Complete.BBC.Documentary.Series.1.EN.SUB.HEVC.x265.WEBRIP.[MPup]\r\n\r\n[b]THIS IS A BBC DOCUMENTARY THAT AIRED IN 2015. Only information in this description is accurate. I am not responsible for auto generated material that appears above the Description line[/b]\r\n\r\n[center][size=200][i][color=&quot;blue&quot;]This torrent is HEVC x26[/color][color=&quot;red&quot;]5[/color][/i]\r\n[b][color=&quot;purple&quot;]It is[/color] [color=&quot;orange&quot;][u]NOT[/u][/color] [color=&quot;purple&quot;]a x26[/color][color=&quot;red&quot;]4[/color] [color=&quot;purple&quot;]torrent[/color][/b][/size]\r\n[b]Click Below to Find Out What You Need and How To Play This File Type[/b]\r\n[thread=ba9a8bd79][/center]\r\n\r\nFormat: [b]This is a [i]HEVC x265 MKV[/i] file. You may need to update your video codecs to play this file.[/b]\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\nDocumentary. In each episode a family invites a GP into their home to investigate every aspect of their lives. They're worried about their health, and they're hoping he can solve their problems.\r\n\r\n\r\nDoctor.in.the.House.s01e01\r\n\r\n[img]http://extraimago.com/images/2015/12/09/c490a50367d9d88ae6f4f971ccbc2e33.png[/img]\r\n\r\nThe doctor is called in to help 48-year-old Priti, a working mother who is struggling with multiple problems including stress, headaches, weight gain and disrupted sleep. But, after staying over and living alongside the family, the doctor discovers that it's actually Priti's partner, 49-year-old Sandeep, whose health is seriously at risk. He's been living with diabetes for the last decade, but his blood sugar is out of control, and a scan reveals he has frightening levels of visceral fat around his organs.\r\n\r\nIt's a major challenge for the doctor. He needs to come up with a plan to transform the whole family's health by making simple, everyday lifestyle changes - involving every aspect of their lives, from the moment they wake up to the way they sleep at night.\r\n\r\nAt the end of his intervention, the family undergo a series of tests to measure just how much impact the doctor has had on their health.\r\n\r\n[img]http://extraimago.com/images/2015/12/09/ad438a3c8f6eaf5c6befad328dbdbc80.jpg[/img]\r\n\r\nDoctor.in.the.House.s01e02\r\n\r\n[img]http://extraimago.com/images/2015/12/09/51414c3f5c9406c240433078a03884f7.png[/img]\r\n\r\nThe doctor is called upon to get to the bottom of Ray's back pain. He's been suffering for decades even though he looks fit and runs his own gym. By spending time with Ray at home and at work, the doctor discovers that Ray is taking a number of strong painkillers as a coping mechanism, and he's worried by what he sees. The doctor has to educate Ray about the dangers of painkillers at the same time as trying to find out what is at the heart of his mysterious back pain.\r\n\r\nTo complicate matters, the doctor undertakes another major detective story in the family. Ray and Rachel's five-year-old son Lucas has eczema, and no-one has been able to find out what is causing it.\r\n\r\nThe whole family's health is interlinked, and the doctor needs to come up with a plan to transform their health by making simple lifestyle changes - involving every aspect of their lives, from the moment they wake up to the way they sleep at night.\r\n\r\nAt the end of his intervention, the family undergo a series of tests to measure just how much impact the doctor's suggested lifestyle changes have had on their health.\r\n\r\n[img]http://extraimago.com/images/2015/12/09/a66ebe0561d3f6c6bdd5a76039c595d9.jpg[/img]\r\n\r\nDoctor.in.the.House.s01e03\r\n\r\n[img]http://extraimago.com/images/2015/12/09/95aae329934997459dc82e65415650c2.png[/img]\r\n\r\nThe doctor spends time with the D'Arcy family in Shropshire. Mum and dad Dottie and Russ have a love of fast food and shock the doctor with a regular family meal. Dotti discovers she has type 2 diabetes, and Rangan's mission to correct her diet leads him to unravel the root cause of the family's relationship with food.\r\n\r\nRangan discovers that Russ's firefighter career is more deskbound than active, so encourages a radical lifestyle change. The whole family's health is interlinked, and the doctor encourages them to transform their health by making simple lifestyle changes - involving every aspect from the moment they wake up to the way they sleep at night.\r\n\r\nAt the end of his intervention, the family undergo a series of tests to measure just how much impact the doctor's suggested lifestyle changes have had on their health, with incredible results.\r\n\r\n[img]http://extraimago.com/images/2015/12/09/a81a189f09ea92bbee01322bcbeb1008.jpg[/img]","torrent":{"xt":"urn:btih:d50f01890fc195488385003fbc6f32cf4fc1de0b","amp;dn":"Doctor.in.the.House.Complete.Series.1.EN.SUB.x265.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d50f01890fc195488385003fbc6f32cf4fc1de0b","infoHashBuffer":{"type":"Buffer","data":[213,15,1,137,15,193,149,72,131,133,0,63,188,111,50,207,79,193,222,11]},"announce":[],"urlList":[]}}