{"title":"The Bible Series 2 - The Five Books of Moses","uid":12789328,"size":2058029104,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d6f9bcbd96121b95ca94f4244558af6f76273ff7&amp;dn=The+Bible+Series+2+-+The+Five+Books+of+Moses&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"POtHS11","files":28,"time":1447897323,"description":"The Bible Series - The Five Books of Moses \r\n\r\nDON'T be deterred by the unfamiliar name. If you've never heard of the Five Books of Moses (not actually composed by Moses; people who believe in divine revelation see him as more secretary than author), you've heard of the Torah and the Pentateuch, the Hebrew and Greek names, respectively, for the first five books of the Hebrew Bible: Genesis, Exodus, Leviticus, Numbers and Deuteronomy. The story starts with the creation of the world, and ends with Moses dying on the wrong side of the Jordan and being buried in an unmarked grave. In between these extremes of possible experience, between the magnificent birth of the universe and the anonymous death of the human being, lies a tale that still has the power to astonish: &quot;The encounter between a group of people and the Lord of the world in the course of history,&quot; in Martin Buber's phrase.\r\n\r\nBut this encounter has such enormous implications, and the story in which we read of it is so frank about what it means to enter into a relationship with the Lord, that for two millenniums readers have preferred to veil its details in allegory. Who wouldn't rather construe Abraham's knife as a metaphor for all the things that test our faith or a foreshadowing of the Cross than as a big sharp blade held by a father over his son's throat? Raw images like these must be what made theology necessary. Only by universalizing or typologizing the life stories of the biblical protagonists could most people stand to think about them","torrent":{"xt":"urn:btih:d6f9bcbd96121b95ca94f4244558af6f76273ff7","amp;dn":"The+Bible+Series+2+-+The+Five+Books+of+Moses","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d6f9bcbd96121b95ca94f4244558af6f76273ff7","infoHashBuffer":{"type":"Buffer","data":[214,249,188,189,150,18,27,149,202,148,244,36,69,88,175,111,118,39,63,247]},"announce":[],"urlList":[]}}