{"title":"W,Chmielarz - cykl Jakub Mortka 1-3 [PL]","uid":12796877,"size":2149007301,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d7dfa1cbb124348cfc1ea6413e4c23c89a6f7ebc&amp;dn=W%2CChmielarz+-+cykl+Jakub+Mortka+1-3+%5BPL%5D+MP3%40128&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"everdarksoul","files":165,"time":1447984226,"description":"Paczka audiobook'ów trzech pierwszych powieści, z kryminalnego cyklu autorstwa Wojciecha Chmielarza, którego głównym bohaterem jest komisarz warszawskiej policji, Jakub Mortka. Ten trzydziesto-kilku letni, nieco zgorzkniały &quot;facet po przejściach&quot;, niedawny rozwodnik - jest też jednym z najlepszych śledczych wydziału ds. zabójstw i terroru kryminalnego Komendy Stołecznej Policji, obdarzonym zarówno intelektem, bystrością obserwacji i doświadczeniem, jak i świetną intuicją - a śledztwa jakie z racji pełnionej funckji prowadzi, należą zazwyczaj do tych najtrudniejszych - wielowątkowych, popełnionych z niejasnych lub niewiadomych przyczyn, a często też i makabrycznych zbrodni... W.Chmielarz - z zawodu dziennikarz - dał się już poznać czytelnikom jako autor krótszych form, m.in. w Nowej Fantastyce, jednak jego prawdziwym, pisarskim debiutem jest właśnie cykl o Komisarzu Mortce, a wszystkie kolejne jego odsłony były nominowane do najbardziej prestiżowych konkursów w Polsce, w tym do Nagrody Wielkiego Kalibru, którą to ostatecznie zdobył w 2015 roku, za trzecią część cyklu - &quot;Przejęcie&quot;. Równie bliska zdobycia tej nagrody była rok wcześniej część druga - Farma Lalek - jednak ostatecznie &quot;Kaliber&quot; powędrował wtedy do Marcina Wrońskiego za powieść &quot;Pogrom w przyszły wtorek&quot;. &quot;Farma...&quot; zdobyła jednak tak duży poklask, że stacja TVN rozpoczęła już przygotowania do nakręcenia filmu fabularnego na jej podstawie. Chronologiczna kolejność opisywanych wydarzeń z życia Mortki jest zgodna z tym, w jakiej kolejności ukazywały się poszczególne tomy cyklu - i jak dotąd są to:\r\n\r\ncykl Komisarz Jakub Mortka:\r\n\r\nTom 1 - Podpalacz\r\nTom 2 - Farma Lalek\r\nTom 3 - Przejęcie\r\n\r\nDane:\r\n\r\n1 - 585 MB / 26x    / czas: 10:38:42 / czyta: Andrzej Mastalerz\r\n2 - 694 MB / 58x    / czas: 12:35:47 / czyta: Janusz Zadura\r\n3 - 765 MB / 67x    / czas: 13:54:06 / czyta: Janusz Zadura\r\n\r\nDodatkowo wstawka zawiera również paczkę e-book'ów tych trzech powieści, zapisanych w formatach EPUB+MOBI, w jakości dobrej i b.dobrej.\r\n\r\n\r\nCzęść 1 - Podpalacz - zarys fabuły:\r\nWarszawa, środek mroźnej zimy. W spalonym domu leży ciało zamordowanego biznesmena, a jego ciężko poparzona żona walczy o życie w szpitalu. Komisarz Jakub Mortka ma nadzieję, że to gangsterskie porachunki albo przypadkowe zaprószenie ognia. Niestety wkrótce wie już, że trafił na seryjnego podpalacza, który krąży po mieście z koktajlami Mołotowa. Giną kolejne osoby, w tym dwoje dzieci - jak się okazuje: bratankowie jednego z najgrozniejszych bossów stołecznego półświatka. Mortka musi odłożyć na bok osobiste problemy i z całą energią poświęcić się śledztwu. Trzeba powstrzymać szaleńca, zanim zginą następni ludzie. Wkrótce Mortka przekona się też, że sprawa ta ma jeszcze inne dno - odkrycie którego postawi przed nim samym najtrudniejszy test moralny w jego karierze. Świetny policyjny kryminał ze współczesną Warszawą w tle.\r\n\r\nCzęść 2 - Farma Lalek - zarys fabuły:\r\nKrotowice - miasteczko zagubione gdzieś w Karkonoszach. Jedenastoletnia Marta nie wraca do domu na noc. Policja rozpoczyna poszukiwania i szybko odnajduje pedofila, który przyznaje się do gwałtu i zabójstwa. Ale to tylko początek. Stare uranowe sztolnie kryją bowiem wiele tajemnic - poszukując dziewczynki, Mortka natrafia w nich na okrutnie okaleczone zwłoki kilku kobiet... Choć poniekąd został tu &quot;zesłany&quot; za naruszenie procedur podczas próby zatrzymania podpalacza, dla komisarza Jakuba Mortki staż w Krotowicach miał być odpoczynkiem i spokojną chwilą na przemyślenie własnego życia. Zamiast tego będzie zmuszony szukać sprawcy makabrycznej zbrodni, której okrucieństwo przerasta wszystko, z czym do tej pory się spotkał. Wytypowany na podejrzanego mężczyzna ginie podczas obławy, a niebawem zamordowana zostaje kolejna kobieta - dzień wcześniej poznana przez komisarza... Okazuje się też, że w szeregach policji jest ktoś, kto pomaga bandytom w ich ochydnym procederze, a szalę goryczy przelewa wiadomość, że Mortka prawdopodobnie został zarażony wirusem HIV... Doskonały i mroczny thriller. TVN przygotowuje ekranizację książki.\r\n\r\nCzęść 3 - Przejęcie - zarys fabuły:\r\nŚrodek upalnego lata, Kolumbia. Grupa Polaków wybranych do reklamy Coca-Coli spędza wakacje życia w luksusowym hotelu nad oceanem. Ale kiedy beztroscy turyści dostaną od Kolumbijczyków propozycję nie do odrzucenia, raj zmieni się w piekło. I nie wszyscy wrócą z tej podróży… Sobota nad ranem, w Warszawie wstaje świt. Słychać śpiew ptaków i szum rzeki. Z mostu Gdańskiego zwisa ciało mężczyzny - rozpruty brzuch, ręce skrępowane na plecach, a w dłoni orzeszek ziemny. W skorupce. W dynamicznej, pełnej napięcia i zaskakujących zwrotów akcji powieści z dobrze już znanym komisarzem Jakubem Mortką w roli głównej, Wojciech Chmielarz potwierdza, że jest jednym z najlepszych autorów kryminałów młodego pokolenia","torrent":{"xt":"urn:btih:d7dfa1cbb124348cfc1ea6413e4c23c89a6f7ebc","amp;dn":"W%2CChmielarz+-+cykl+Jakub+Mortka+1-3+%5BPL%5D+MP3%40128","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7dfa1cbb124348cfc1ea6413e4c23c89a6f7ebc","infoHashBuffer":{"type":"Buffer","data":[215,223,161,203,177,36,52,140,252,30,166,65,62,76,35,200,154,111,126,188]},"announce":[],"urlList":[]}}