{"title":"diamante de sangue","uid":12948992,"size":895643312,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d81519f1004922891262549ad0993c72cde6b887&amp;dn=diamante+de+sangue+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tgama","files":2,"time":1449706615,"description":"Sinopse e detalhes\r\nSerra Leoa, final da década de 90. O país está em plena guerra civil, com conflitos constantes entre o governo e a Força Unida Revolucionária (FUR). Quando uma tropa da FUR invade uma aldeia da etnia Mende, o pescador Solomon Vandy (Djimon Hounsou) é separado de sua família, que consegue fugir. Solomon é levado a um campo de mineração de diamantes, onde é obrigado a trabalhar. Lá ele encontra um diamante cor-de-rosa, que tem cerca de 100 quilates. Solomon consegue escondê-lo em um pedaço de pano e o enterra, mas é descoberto por um integrante da FUR. Neste exato momento ocorre um ataque do governo, que faz com que Solomon e vários dos presentes sejam presos. Ao chegar na cadeia lá está Danny Archer (Leonardo DiCaprio), um ex-mercenário nascido no Zimbábue que se dedica a contrabandear diamantes para a Libéria, de onde são vendidos a grandes corporações. Danny ouve um integrante da FUR acusar Solomon de ter escondido o diamante e se interessa pela história. Ao deixar a prisão Danny faz com que Solomon também saia, propondo-lhe um trato: que ele mostre onde o diamante está escondido, em troca de ajuda para que possa encontrar sua família. Solomon não acredita em Danny mas, sem saída, aceita o acordo","torrent":{"xt":"urn:btih:d81519f1004922891262549ad0993c72cde6b887","amp;dn":"diamante+de+sangue+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d81519f1004922891262549ad0993c72cde6b887","infoHashBuffer":{"type":"Buffer","data":[216,21,25,241,0,73,34,137,18,98,84,154,208,153,60,114,205,230,184,135]},"announce":[],"urlList":[]}}