{"title":"Kompas Antivirus 3.3","uid":12643393,"size":8725273,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d850632c3c4e7a9882c75e674d2f3595bf0edc82&amp;dn=Kompas+Antivirus+3.3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KompasAV","files":1,"time":1446029376,"description":"Kompas Antivirus 3.3.0\r\n \nhttp://anti.malware.web.id/\r\n------------------\r\n\r\nKompas antivirus is free antivirus software and designed to fight off all malware types especially to detect\r\nRATs, keyloggers, stealers, crypters, binders, spywares, worms and more. \r\n\r\nJust relying on a single vendor is not sufficient to completely protect you. You do need a second layer to make sure you are secure. \r\n\r\nKompas Antivirus features simple interface to make it simple and easy to use and it can be carried on a USB drive to quickly scan any computer(s) for malware.\r\n\r\n    - Fast and Light Scan Engine\r\n\r\n    - Automatic Priority Updates and Scheduled Scanning\r\n\r\n    - Real-Time File System Protection Blocks Known Threats\r\n\r\n    - Advanced Heuristic Protection Prevents New Zero Day Malware Infection\r\n\r\n    - Best USB Antivirus Detects All Kinds of Threat in Removable Media\r\n\r\n    - Best Detection for Encrypted VBS Malwares\r\n\r\n    - Additional Tools Unhides Files/Folders, Restores Hijacked Browser and many more.\r\n\r\n\r\nPerkenalkan\r\n-----------\r\n\r\nSatu antivirus saja tidak cukup untuk mencegah ancaman virus baru yang muncul di setiap saat.\r\n\r\nKompas Antivirus merupakan antivirus gratis yang menawarkan perlindungan secara real-time\r\ndari virus terbaru serta dapat digunakan berdampingan dengan antivirus lain.\r\n\r\nPendeteksian difokuskan terhadap malware terbaru seperti botnet, spyware,\r\nkeylogger, password stealer, trojan downloader, crypter, cryptolocker dan lainnya. \r\n\r\nDengan proses kecepatan scan yang relatif cepat dan pilihan mode scan yang praktis,\r\nAnda dapat dengan mudah menjaga keamanan komputer dari ancaman virus.\r\n\r\nKompas Antivirus handal dalam mendeteksi malware yang menyebar melalui flashdisk\r\nsehingga tidak ada celah untuk malware menginfeksi komputer. \r\n\r\nDatabase malware selalu di-update secara rutin agar dapat mendeteksi virus terbaru.\r\n\r\nPercayakan perlindungan komputer Anda dengan mengggunakan Kompas Antivirus.\r\n\r\n\r\nApa Yang Terbaru (28 Oktober 2015)\r\n----------------------------------\r\n- Penambahan shell extension untuk Windows dengan arsitektur 64 bit.\r\n- Penambahan file log ketika scan melalui command line.\r\n- Scaling dinonaktifkan sehingga tampilan tidak terpotong pada DPI yang diperbesar.\r\n- Perbaikan minor bugs","torrent":{"xt":"urn:btih:d850632c3c4e7a9882c75e674d2f3595bf0edc82","amp;dn":"Kompas+Antivirus+3.3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d850632c3c4e7a9882c75e674d2f3595bf0edc82","infoHashBuffer":{"type":"Buffer","data":[216,80,99,44,60,78,122,152,130,199,94,103,77,47,53,149,191,14,220,130]},"announce":[],"urlList":[]}}