{"title":"Vampiric Cult ebooks (Vampire Temple)","uid":12955760,"size":10237622,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d8fbd6da486e5fb8aa30ba47659365033c938b71&amp;dn=Vampiric+Cult+ebooks+%28Vampire+Temple%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"LuYang","files":28,"time":1449778334,"description":"ALL THE EBOOKS ARE IN PDF FORMAT.\r\n\r\n----------------------------------\r\nBOOKS ABOUT PSI (ENERGY) VAMPIRISM\r\nTEMPLE OF THE VAMPIRE\r\nREAL VAMPYRISM\r\nPDF COLLECTION\r\nE-BOOKS\r\n----------------------------------\r\n\r\nDescription:\r\n\r\nThe Temple of the Vampire (aka ToV, TotV, TOV, or Vampire Temple) is an online religious group allegedly founded in 1989. It sells expensive books with illegible fonts and flying-skull jewelry. They started out advertising in the back pages of magazines and spamming Usenet. The leader (George/Lucas) is friends with Peter H. Gilmore who took over the Church of Satan (formerly run by Anton La Vey) in 2001, after which point CoS and ToV slowly began to affiliate more with growing years. Now, most of the current CoS leadership (the Council of Nine) are also members of the ToV. \r\n\r\nThe Temple of the Vampire is a cult which practices the religion of Vampirism. Its members believe that they practice an ancient religion which they claim has been known by various names over the centuries: Order of the Dragon, Temple of the Dragon, and Temple of the Vampire Dragon Goddess Tiamat. The Temple believes its membership is made up of those who have realized their difference from the masses of humanity and discovered they resonate with the night, know they are predators, and want something more out of life.\r\n\r\nThe public face of the Temple was officially organized in 1989, though they claim their religion goes back much further. The Temple is a secretive occult organisation that is run by an council of members of the Inner Circle or Order of Prometheus. There are two levels of membership in the Temple. General lifetime membership is available to anyone who purchases a copy of The Vampire Bible from the Temple Active membership in the Temple requires members to pay a monthly subscription (however, members of the Priesthood of UR have the option to pay $100 a year for active membership)","torrent":{"xt":"urn:btih:d8fbd6da486e5fb8aa30ba47659365033c938b71","amp;dn":"Vampiric+Cult+ebooks+%28Vampire+Temple%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8fbd6da486e5fb8aa30ba47659365033c938b71","infoHashBuffer":{"type":"Buffer","data":[216,251,214,218,72,110,95,184,170,48,186,71,101,147,101,3,60,147,139,113]},"announce":[],"urlList":[]}}