{"title":"Mongo Santamaria And Friends - Mambo Mongo (1993)@flac","uid":12920533,"size":365090674,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:da6aa445b415e930d58959fce74d99445b1dbe53&amp;dn=Mongo+Santamaria+And+Friends+-+Mambo+Mongo+%281993%29%40flac&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alekow1","files":24,"time":1449412880,"description":"\nThere are seemingly unlimited variations, styles or flavors of jazz playing being performed today and a few more on the way. There seems to be a great deal of similarities between Island jazz, Latin jazz, Cuban jazz and even Afro-jazz. I have not run across any written rules but lately it seems as if they are sharing some common tendencies. Few groups seem to embrace being a trio or quartet, a half dozen performers seems to be the minimum number. Instead of only using a traditional drum kit, all sorts of percussion instruments are used and the accents are often placed unpredictably. That is certainly true on this recording as well as adding two of the very best jazz flutists in existence.\r\n\r\nThe first track &quot;Dark Before The Dawn&quot; makes it abundantly clear that this recording is not straightforward jazz. The Latin flavor is there in spades with even more thrown in for good, very good measure. Not simply island music since Santamaria was born in Havana Cuba and lived there for almost thirty years, he continued what the collaboration of Dizzy Gillespie with Chano Pozo started and became known as &quot;Afro-Cuban Jazz&quot;.\r\n\r\nThe outstanding flutist, Hubert Lows, is slightly highlighted here and on &quot;Are They Only Dreams&quot; his is only two performances on this recording. Aficionados of fine flute playing need not worry here. On &quot;Caribbean Sunrise&quot; and &quot;Los Ninos Del Mundo&quot; the equally talented and famous flutist Dave Valentin is equally featured. Both these flutist are very well known and popular fronting their own groups. Valentin's teacher persuaded him to not double on saxophone years ago - his teacher was none other than Hubert Laws!\r\n\r\nPerhaps surprisingly, Mongo Santamaria is not listed as playing any instruments other than his famous congas. Eddie Rodriguez and Jerome Goldschmidt handle the other percussion instruments except for Johnny Almendra on the timbales. If not familiar to you, timbales are the well-known Latin drums that are shallow and one-sided and differ only from each other in diameter. On the last track, &quot;La Mogolla&quot;, composed by Santamaria there is a great deal of interplay between his congas and the timbales. This is not &quot;hi-Fi&quot; playing, as they do not move air as much as typical old time jazz drums might. They are simply making music and keeping the rhythm here on this particularly interesting track and often are the only instruments being played. That is particularly true on this track. The brass players are in hiding here but in the beginning few minutes bass player Guillermo gets to show off a bit.\r\n\r\nOn &quot;Cali&quot;, pianist Dario Eskenazi gets featured more than usual and to fine effect, often in combination with one or more of the horn players Eddie Allen, Jimmy Cozier or Craig Rivers.\r\n\r\nA summary is relatively easy for this effort originally recorded more than ten years ago. Performances here are simply as good as they get. Unlike the recently reviewed Michel Camilo Grammy award-winning album, here you always realize that every track is a Latin or Afro-Cuban flavored jazz recording. Make no mistake about that.  \r\n\r\n                                                                                                                                                 Karl Lozier (enjoythemusic.com)\r\n \nhttp://i.imgur.com/Ij8eOFy.jpg\r\n\r\n\r\n01. Dark Before The Dawn    [5:46]\r\n02. Caribbean Sunrise    [4:49]\r\n03. Mambo Mongo    [6:55]\r\n04. Los Ninos Del Mundo    [6:05]\r\n05. Cali    [5:07]\r\n06. Are They Only Dreams    [5:01]\r\n07. Cuco Y Olga    [6:03]\r\n08. Azteca    [5:23]\r\n09. La Mogolla    [9:32]\r\n\r\n\r\n\r\nCongas - Mongo Santamaria\r\nBass - Guillermo Edgehill\r\nAlto Saxophone - Jimmy Cozier\r\nTenor Saxophone, Soprano Saxophone - Craig Rivers\r\nTrumpet - Eddie Allen\r\nFlute - Dave Valentin (tracks: 2, 4), Hubert Laws (tracks: 1, 6)\r\nPiano - Dario Eskenazi\r\nTimbales - Johnny Andreu Almendra\r\nTambora [Cata] - Jerome Goldschmidt (tracks: 8)\r\nBata [Itotele] - Jerome Goldschmidt (tracks: 9)\r\nPercussion, Vocals - Eddie Rodriguez\r\n\r\n\r\nDirected By, Conductor - Marty Sheller\r\nProducer - David Chesky\r\nRecorded By - Bob Katz\r\nLiner Notes - Steve Sacks\r\n\r\n\r\nRecorded March 30 &amp; 31, 1993 at BMG Studio A, New York, NY \r\n\r\nRecorded using minimal miking techniques and without overdubbing or artificial enhancement to ensure the purest and most natural sound possible.\r\n\r\n\r\nLabel: Chesky Records\r\nReleased: 1993 \r\nCatalogue: JD100\r\n\r\nCodec: Flac\r\nCompression Level: 6\r\nQuality: High\r\n\r\n\r\nCD-rip by alekow (EAC and Flac)\r\nCovers Included (600dpi)\r\n\r\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:da6aa445b415e930d58959fce74d99445b1dbe53","amp;dn":"Mongo+Santamaria+And+Friends+-+Mambo+Mongo+%281993%29%40flac","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da6aa445b415e930d58959fce74d99445b1dbe53","infoHashBuffer":{"type":"Buffer","data":[218,106,164,69,180,21,233,48,213,137,89,252,231,77,153,68,91,29,190,83]},"announce":[],"urlList":[]}}