{"title":"Pool Nation FX - Lite","uid":12943262,"size":2707380964,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:dac9f85f09affbb02815b48fab8f8693a4b1536c&amp;dn=Pool+Nation+FX+-+Lite&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dauphong","files":1,"time":1449649371,"description":"A visually stunning Pool Simulation with an incredible physics engine. On one hand Pool Nation FX is a serious Sim, on the other a more casual experience; with top-down view, aiming aid on, play for cash kind of fun. You can customise your rule sets and play Pool your way for a realistic pool experience on or offline. Or explore our trick shot mode – which lets you suspend objects in the air, set them on fire and create impossible trickshots. Whatever your love for pool, there is a Pool Nation FX just for you:\r\nPool Nation FX Lite\r\nPerfect for the casual pool shark, dip your toes in the water with limitless 8 Ball Pool online an offline practice mode, a Daily Bonus Match, Daily Trickshot Challenge and full access to the customisable features including collectable cues, balls, decals and locations. Play with your friends online.\r\nUpgrade to Pool Nation FX, Online or Offline packs to unlock more features:\r\nWant to access all areas Pool Nation FX has to offer... Earn money in-game as you advance through your pool career offline, and battle it out online with the introduction of all new modes including; Play for Cash, Leagues, Fully customisable Trickshot Editor and a Snooker Career. Pool Nation FX is much more than just a pool game. It’s the ultimate pool game","torrent":{"xt":"urn:btih:dac9f85f09affbb02815b48fab8f8693a4b1536c","amp;dn":"Pool+Nation+FX+-+Lite","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dac9f85f09affbb02815b48fab8f8693a4b1536c","infoHashBuffer":{"type":"Buffer","data":[218,201,248,95,9,175,251,176,40,21,180,143,171,143,134,147,164,177,83,108]},"announce":[],"urlList":[]}}