{"title":"Principles of Heat Transfer in Porous Media 2nd ed - M. Kaviany","uid":12688524,"size":4573187,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de08e8138e461043e554cfeb7fa30eb7627c0e31&amp;dn=Principles+of+Heat+Transfer+in+Porous+Media+2nd+ed+-+M.+Kaviany&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1446639521,"description":"Principles of Heat Transfer in Porous Media 2nd ed - M. Kaviany (Springer, 1995).pdf\r\n\r\nThis monograph aims at providing, through integration of available theoretical and empirical treatments, the differential conservation equations and the associated constitutive equations required for the analysis of transport in porous media. Although the empirical treatment of fluid flow and heat transfer in porous media is over a century old, only in the last four decades has the transport in these heterogeneous systems been addressed in sufficient detail. So far, single-phase flow and heat transfer in porous media have been treated or at least formulated satisfactorily. But the subject of two-phase flow and the related heat transfer in porous media is still in its infancy. This monograph identifies the principles of transport in porous media, reviews the available rigorous treatments, and whenever possible compares the available predictions, based on these theoretical treatments of various transport mechanisms, with the existing experimental results. The theoretical treatment is based on the local volume-averaging of the momentum and energy equations with the closure conditions necessary for obtaining solutions. While emphasizing a basic understanding of heat transfer in porous media, the monograph does not ignore the need for the predictive tools. Therefore, whenever a rigorous theoretical treatment of a phenomenon is not available, semiempirical and empirical treatments are given","torrent":{"xt":"urn:btih:de08e8138e461043e554cfeb7fa30eb7627c0e31","amp;dn":"Principles+of+Heat+Transfer+in+Porous+Media+2nd+ed+-+M.+Kaviany","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de08e8138e461043e554cfeb7fa30eb7627c0e31","infoHashBuffer":{"type":"Buffer","data":[222,8,232,19,142,70,16,67,229,84,207,235,127,163,14,183,98,124,14,49]},"announce":[],"urlList":[]}}