{"title":"FemaleAgent - Tracey, Vanessa (First lesbian experience on agent","uid":12939105,"size":659508402,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:df35c0fdc96f7414bb23f36ccdc8131ab402da6e&amp;dn=FemaleAgent+-+Tracey%2C+Vanessa+%28First+lesbian+experience+on+agent&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"feeldabyte","files":1,"time":1449613591,"description":"Screens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n \nhttp://imgkiss.com/image/rlZZv \nhttp://imgkiss.com/image/rlyn9\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nThis casting was almost a case of the one that got away. This gorgeous young woman walked into my office seeking work as a model. She was slim, beautiful and she had a pleasant demeanor. She had no experience and had been working in an office job since she left school. She wanted change and I wanted her pussy on the end of my tongue. After we had almost concluded the interview during which I had hinted that I would have lots of work for her, I then blurted out that I wanted to have sex with her right there and then in the office. She seemed slightly taken aback and she asked me if I was serious. When I told her I really was she got all flustered. Then she politely declined, stood up and walked out of my office. I was disappointed, I had really fancied this sexy woman and I was dying to taste her sweet nectar. Rarely do the women I pursue resist my charms. When it almost seemed like I was going to have to let the cameraman lick my pussy so I could get some sexual satisfaction, there was a knock on the door. She had returned and she had thought about my offer and decided that she could not turn down this opportunity. Also she thought I was beautiful and she hadn't realized how attracted she was to me. She was a little bit nervous as she had never been with another woman before. I told her not to be and I strode over to where she sat and we were soon locked in a passionate embrace. What followed was an amazing, sexually charged casting where I showed her exactly how to pleasure a woman and how to let a woman pleasure her.\r\n\r\n\r\nSail to another one :  https://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:df35c0fdc96f7414bb23f36ccdc8131ab402da6e","amp;dn":"FemaleAgent+-+Tracey%2C+Vanessa+%28First+lesbian+experience+on+agent","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df35c0fdc96f7414bb23f36ccdc8131ab402da6e","infoHashBuffer":{"type":"Buffer","data":[223,53,192,253,201,111,116,20,187,35,243,108,205,200,19,26,180,2,218,110]},"announce":[],"urlList":[]}}