{"title":"Rigmar Radio Karaoke Collection 11250","uid":12965523,"size":1405213225,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e1d2314ce3d383fea65d31fe9d89f2da69d5fdad&amp;dn=Rigmar+Radio+Karaoke+Collection+11250&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rigmar_radio","files":498,"time":1449885672,"description":"Please do not run more than one download at a time and for the fastest download speeds STOP all seeding torrents until done.  If you have a lot of upload bandwidth then of course you may run a seeding torrent or two, but only if you are an expert at bit torrent.\r\n\r\nThe average speed of this swarm needs your upload speed as you download to help get this content out there fast.   Thank you.\r\n\r\nMoet asseblief nie meer as een aflaai op 'n tyd en vir die vinnigste aflaai spoed stop al loting torrents tot gaar. As jy het 'n baie oplaaibandwydtevlak dan natuurlik kan jy 'n loting torrent of twee te hardloop, maar net as jy 'n kenner op bietjie torrent.\r\n\r\nDie gemiddelde spoed van hierdie swerm het jou oplaai spoed as jy dit aflaai te help om die inhoud daar buite vinnig. Dankie.\r\n\r\nPor favor, no ejecutar más de una descarga a la vez y para las velocidades de descarga más rápidas detener todos los torrentes de siembra hasta que esté hecho. Si usted tiene mucho ancho de banda de subida y luego, por supuesto, es posible que encuentre un torrente siembra o dos, pero sólo si usted es un experto en bit torrent.\r\n\r\nLa velocidad media de este enjambre necesita su velocidad de subida que se descargue para ayudar a conseguir este contenido por ahí rápido. Gracias.\r\n\r\nS'il vous plaît ne pas exécuter plus d'un téléchargement à un moment et pour les vitesses de téléchargement les plus rapides Arrêtez tous les torrents d'ensemencement jusqu'à ce que fait. Si vous avez beaucoup de bande passante de téléchargement puis bien sûr vous pouvez exécuter un torrent de semis ou deux, mais seulement si vous êtes un expert à Bit Torrent.\r\n\r\nLa vitesse moyenne de cet essaim a besoin de votre vitesse de téléchargement que vous téléchargez pour aider à obtenir ce contenu là-bas rapide. Je vous remercie.\r\n\r\nRigmar Radio - Helping educate Bit Torrent users since 2003","torrent":{"xt":"urn:btih:e1d2314ce3d383fea65d31fe9d89f2da69d5fdad","amp;dn":"Rigmar+Radio+Karaoke+Collection+11250","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1d2314ce3d383fea65d31fe9d89f2da69d5fdad","infoHashBuffer":{"type":"Buffer","data":[225,210,49,76,227,211,131,254,166,93,49,254,157,137,242,218,105,213,253,173]},"announce":[],"urlList":[]}}