{"title":"Rigmar Radio Karaoke Collection 5750","uid":12891282,"size":1517972890,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e4640d5688b962d36b2269581e85f88387b0ad57&amp;dn=Rigmar+Radio+Karaoke+Collection+5750&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rigmar_radio","files":500,"time":1449127692,"description":"250 More Karaoke songs from the Rigmar 2015 Collection.  Enjoy:\r\n\r\nPlease do not run any other torrents when downloading from this swarm.  STOP all the rest.  You may continue after you have downloaded this torrent and are seeding it.\r\n\r\nYour upload speeds to THIS SWARM are the key to faster downloads.  Do not waste it by overloading your bit torrent client with dozens of downloads and seeding torrents.  NO SEED is going to wait for you if it takes you months to download just 250 songs and 1.5GB of data.\r\n\r\nS'il vous plaît ne pas exécuter d'autres torrents lors du téléchargement à partir de cet essaim. ARRÊTEZ tout le reste. Vous pouvez continuer une fois que vous avez téléchargé ce torrent et que l'ensemencement il.\r\n\r\nVos vitesses de téléchargement à cet essaim sont la clé pour des téléchargements plus rapides. Ne gaspillez pas en surchargeant votre client bit torrent avec des dizaines de téléchargements et des torrents d'ensemencement. NO SEED va attendre pour vous si cela vous prend des mois pour télécharger à seulement 250 chansons et 1,5 Go de données.\r\n\r\nPor favor, no ejecute ningún otro torrentes al descargar de este enjambre. PARAR todo el resto. Usted puede continuar después de haber descargado este torrente y se siembra la misma.\r\n\r\nSus velocidades de carga a este enjambre son la clave para descargas más rápidas. No la desperdicies sobrecargando su cliente bit torrent con docenas de descargas y torrentes de siembra. NO SEED va a esperar para usted si le toma meses para descargar sólo 250 canciones y 1,5 GB de datos.\r\n\r\nRigmar Radio - Attempting to Educate the Bit Torrent User since 2003","torrent":{"xt":"urn:btih:e4640d5688b962d36b2269581e85f88387b0ad57","amp;dn":"Rigmar+Radio+Karaoke+Collection+5750","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4640d5688b962d36b2269581e85f88387b0ad57","infoHashBuffer":{"type":"Buffer","data":[228,100,13,86,136,185,98,211,107,34,105,88,30,133,248,131,135,176,173,87]},"announce":[],"urlList":[]}}