{"title":"The.True.Story.s05e01.Star.Trek.360p.LDTV.WEBRIP.[MPup]","uid":12958511,"size":227394355,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e6aac57294fe672e9ba251bcda13757ae7334d20&amp;dn=The.True.Story.s05e01.Star.Trek.360p.LDTV.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":1,"time":1449815998,"description":"The.True.Story.s05e01.Star.Trek.360p.LDTV.WEBRIP.[MPup]\r\nLow-Definition Television (LDTV) ABC iview WEBRIP: 640x360\r\n[b]AKA The Real Story 2008[/b]\r\n\r\n[i]The True Story AU s05e01 Star Trek 360p LDTV WEBRIP [MPup] AKA The Real Story US [2008][/i]\r\n\r\nFormat: MPEG-4\r\nSize: 640x360\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 44.1 KHz\r\n\r\nThe True Story looks at the real lives and true stories behind Hollywood blockbusters and this episode examines the Sci-Fi phenomenon and most successful franchise in history – Star Trek.\r\n\r\nSince the original motion picture premier in 1979 Star Trek has boldly gone onto produce multiple TV series, 11 further films and can boast the most loyal and passionate fanbase in the world.\r\n\r\nThe origins of this multi-billion dollar business can be traced back to one man - LA cop, Gene Roddenberry. As the world of television blossomed in the 1950’s, Roddenberry began to write scripts for police dramas in his spare time. Until one day he came up with a ground-breaking new idea – Star Trek. \r\n\r\nThe original motion picture is set in the twenty-third century when a powerful alien machine called Vger approaches Earth destroying everything in its path. The last possible chance to save the planet is Admiral James T Kirk at the helm of the USS Enterprise. Using impressive special effects it was what legions of Trekkies/Treckers were waiting for.\r\n\r\nThe True Story, through key interviews with Herb Solow, the producer of the Star Trek TV series, Roddenberry’s son, Rod, and Mr Spock himself - Leonard Nimoy charts Roddenberry’s meteoric rise to fame and the lengths he would go to keep his series on air.\r\n\r\nStar Trek didn’t only delight Trekkies, but also went on to inspire the scientific world and NASA scientists to recreate as in reality what they had seen in on screen in Star Trek. \r\n\r\nInvestigating Star Trek’s use of antimatter we reveal how one of the world’s most expensive physics experiment at CERN Switzerland is trapping the most explosive substance on the planet.\r\n\r\nIn further scientific examples of Roddenberry’s vision, scientists have gone on to develop the first scientific principles of teleportation, the replication of human organs by 3D printers and the creation of artificial intelligence androids.\r\n\r\n[img]http://extraimago.com/images/2015/12/11/be77e6b633d73014971991e1e8fc47ab.jpg[/img]","torrent":{"xt":"urn:btih:e6aac57294fe672e9ba251bcda13757ae7334d20","amp;dn":"The.True.Story.s05e01.Star.Trek.360p.LDTV.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6aac57294fe672e9ba251bcda13757ae7334d20","infoHashBuffer":{"type":"Buffer","data":[230,170,197,114,148,254,103,46,155,162,81,188,218,19,117,122,231,51,77,32]},"announce":[],"urlList":[]}}