{"title":"David Busch's Quick Snap Guide to Using Digital SLR Lenses","uid":12957145,"size":12076298,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ea178a6ffff2dd9ffbc943948ca20fa99348f679&amp;dn=David+Busch%27s+Quick+Snap+Guide+to+Using+Digital+SLR+Lenses&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1449797873,"description":"David Busch's Quick Snap Guide to Using Digital SLR Lenses\r\n\r\n\r\nAre you ready to go beyond the basics with your digital SLR camera but are unsure which interchangeable lens or two to buy and more importantly, how and when to use each lens? &quot;David Busch's Quick Snap Guide to Using Digital SLR Lenses&quot; offers focused, concise information and techniques on how to use different lenses to take great photographs. You'll begin with a quick overview of how lenses work and the types of lenses available, including normal, telephoto, wide-angle, prime, and zoom. Then you'll explore typical lens controls and features such as focus rings, depth-of-field scales, and image stabilization, and how particular settings can help improve your photography. Once you have the basics down you'll learn how to create cool effects using lens filters and accessories, and how to select the best lens aperture for particular types of photos. Finally, you'll go in-depth with telephoto, wide-angle, and macro lenses. Each topic or concept is explained using a clear, two- or fourpage spread, and beautiful, full-color images illustrate the results of photographing with each setting, technique, or lens. A mini-glossary will help you define unfamiliar terms as you go. Get ready to enhance your photographs using the versatility of interchangeable lenses on your digital SLR!\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:ea178a6ffff2dd9ffbc943948ca20fa99348f679","amp;dn":"David+Busch%27s+Quick+Snap+Guide+to+Using+Digital+SLR+Lenses","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea178a6ffff2dd9ffbc943948ca20fa99348f679","infoHashBuffer":{"type":"Buffer","data":[234,23,138,111,255,242,221,159,251,201,67,148,140,162,15,169,147,72,246,121]},"announce":[],"urlList":[]}}