{"title":"SoftMaker Office Professional v2016.749.1202","uid":12910123,"size":384083796,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ead72fe02c352ba416b3ca73b51f21fcf2b98075&amp;dn=SoftMaker+Office+Professional+v2016.749.1202&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ZarkBit","files":1,"time":1449288243,"description":"SoftMaker Office Professional v2016.749.1202\r\n\r\nIt doesn't have to be Microsoft after all...\r\n\r\nSoftMaker Office is the best alternative to Microsoft Office: affordable, powerful, lightning-fast, and compatible.\r\n\r\nWith SoftMaker Office 2016, documents, calculations and presentations are handled just as fast\r\nas E-mail correspondence or your appointment and task planning. From simple everyday tasks to the\r\nmost demanding documents, SoftMaker Office 2016 is your indispensable helper.\r\n\r\n...SoftMaker Office 2016 is ...\r\n\r\n...Fast:\r\nStarts as fast as lightning, opens documents in the blink of an eye and enables you to attain results immediately.\r\n\r\n...Strong:\r\nOffers a huge functional scope and can be operated simply and intuitively.\r\n\r\n...Compatible:\r\nEdits Microsoft Office documents as true to the original as Microsoft Office itself.\r\nSoftMaker Office 2016\r\nWrite, calculate, present, work with your E-mail and calendar.\r\n\r\n...Word processing: TextMaker 2016\r\n\r\nFrom normal daily correspondence to scientific essays, from a greeting card to an elaborately designed newsletter: \r\nWith TextMaker 2016, you can create attractive documents as fast as lightning, alone or in teamwork with colleagues. \r\nYou can either print the completed documents or pass them on as PDFs or E-books.\r\n\r\n...Spreadsheet program: PlanMaker 2016\r\n\r\nWith more than 350 calculation functions, huge worksheets with one million rows and professional functions such as pivot tables, PlanMaker 2016 is suitable for all kinds of calculations – whether a simple credit comparison or the overall financial planning for a company. \r\nPlanMaker enables you to analyze data diversely and to illustrate the results with charts in presentation quality.\r\n\r\n...Presentation software: Presentations 2016\r\n\r\nLittle work, large effect: You can create impressive presentations as fast as lightning with Presentations 2016. \r\nNumerous ready-made templates which can be re-designed at the touch of a button do the work for you. \r\nLend presentations that certain je ne sais quoi with graphics, charts, sound, videos, animations and slide transitions and impress your public with captivating discourses.\r\n\r\n...E-mails, tasks, appointments: Thunderbird\r\n\r\nThunderbird takes competent care of your E-mails and ensures that you keep your appointments, tasks and contacts under control. \r\nSoftMaker has extended the Thunderbird interface, developed functions for fast filing and navigation of large quantities of E-mails and augmented Thunderbird with a fully automatic import from the eM Client","torrent":{"xt":"urn:btih:ead72fe02c352ba416b3ca73b51f21fcf2b98075","amp;dn":"SoftMaker+Office+Professional+v2016.749.1202","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ead72fe02c352ba416b3ca73b51f21fcf2b98075","infoHashBuffer":{"type":"Buffer","data":[234,215,47,224,44,53,43,164,22,179,202,115,181,31,33,252,242,185,128,117]},"announce":[],"urlList":[]}}