{"title":"Ibps,ssc Quantitative aptitude session by Rohith agarwal","uid":12989481,"size":850492603,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:eb98dc97143682f0a0e2d519803171097be8e9ab&amp;dn=Ibps%2Cssc+Quantitative+aptitude+session+by+Rohith+agarwal&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"mrdreams","files":20,"time":1450113072,"description":"Just look at it once and save your Rs.5000\r\nI have all the videos of Ibps po course(Quantitative+Reasoning+English+Banking awareness+current affairs) of this guy.\r\nIf you join this course on their official website now for Rs.6000,you cannot download these videos officially on their site,you can watch only online for a  period of 6 months validity and multiple log in is also restricted that is only one user can access the site on 1 computer  on their website,so that their is no chance of sharing the money with your friends to join this course.\r\nI can provide you the link also just check it out for your confirmation regarding price and downloading chances with customer care(www.talentsprint.com).\r\n\r\nHow I got all these videos?\r\nI joined this course long ago,I was good in these computers and it was very difficult to get all those videos,but my knowledge of computers made it to me very easy.\r\n\r\nHow to save your Rs.5000?\r\nI can provide you some demo videos on the topics you prefer through mail,If you like it then you can buy all the videos for just Rs.1000.Also you can get all the pdf questions with answers.So that you can easily download it and the price also can be shared with your friends.\r\n\r\nHow to believe this?\r\nIf you are willing to join for a tutorial to crack upcoming ibps po exams,then believe me this guy is the one who can help you,I have personally checked out many online coaching sites,it is the best site you can get online.\r\nI know you can't believe this,but i will send you some free 50 demo videos of your choice and only pay a few advance after that then if you have any hope in me then you can get all the stuffs","torrent":{"xt":"urn:btih:eb98dc97143682f0a0e2d519803171097be8e9ab","amp;dn":"Ibps%2Cssc+Quantitative+aptitude+session+by+Rohith+agarwal","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb98dc97143682f0a0e2d519803171097be8e9ab","infoHashBuffer":{"type":"Buffer","data":[235,152,220,151,20,54,130,240,160,226,213,25,128,49,113,9,123,232,233,171]},"announce":[],"urlList":[]}}