{"title":"Electrical Power Transmission System Engineering: Analysis and D","uid":12661395,"size":24565372,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebfcb5e13696fd1065155296677dca63d1ea9992&amp;dn=Electrical+Power+Transmission+System+Engineering%3A+Analysis+and+D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"NoctDeath","files":2,"time":1446299144,"description":"Title: Electrical Power Transmission System Engineering: Analysis and Design \r\nAuthor: Turan Gonen \r\nFormat: PDF \r\nHardcover: 1093 pages \r\nPublisher: CRC Press; 3 edition (May 14, 2014) \r\nLanguage: English \r\nISBN: 9781482232226 \r\n\r\n\r\nElectrical Power Transmission System Engineering: Analysis and Design is devoted to the exploration and explanation of modern power transmission engineering theory and practice. Designed for senior-level undergraduate and beginning-level graduate students, the book serves as a text for a two-semester course or, by judicious selection, the material may be condensed into one semester. Written to promote hands-on self-study, it also makes an ideal reference for practicing engineers in the electric power utility industry.\r\n\r\nBasic material is explained carefully, clearly, and in detail, with multiple examples. Each new term is defined as it is introduced. Ample equations and homework problems reinforce the information presented in each chapter. A special effort is made to familiarize the reader with the vocabulary and symbols used by the industry. Plus, the addition of numerous impedance tables for overhead lines, transformers, and underground cables makes the text self-contained.\r\n\r\nThe Third Edition is not only up to date with the latest advancements in electrical power transmission system engineering, but also:\r\n\r\n- Provides a detailed discussion of flexible alternating current (AC) transmission systems\r\n- Offers expanded coverage of the structures, equipment, and environmental impacts of transmission lines\r\n- Features additional examples of shunt fault analysis using MATLAB®\r\n\r\nAlso included is a review of the methods for allocating transmission line fixed charges among joint users, new trends and regulations in transmission line construction, a guide to the Federal Energy Regulatory Commission (FERC) electric transmission facilities permit process and Order No. 1000, and an extensive glossary of transmission system engineering terminology.\r\n\r\nCovering the electrical and mechanical aspects of the field with equal detail, Electrical Power Transmission System Engineering: Analysis and Design, Third Edition supplies a solid understanding of transmission system engineering today","torrent":{"xt":"urn:btih:ebfcb5e13696fd1065155296677dca63d1ea9992","amp;dn":"Electrical+Power+Transmission+System+Engineering%3A+Analysis+and+D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebfcb5e13696fd1065155296677dca63d1ea9992","infoHashBuffer":{"type":"Buffer","data":[235,252,181,225,54,150,253,16,101,21,82,150,103,125,202,99,209,234,153,146]},"announce":[],"urlList":[]}}