{"title":"The Best of Me by Nicholas Sparks","uid":12882038,"size":441775,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ecd24472ba6051f0498844241ad34eef2d35c132&amp;dn=The+Best+of+Me+by+Nicholas+Sparks&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TopShelfBook","files":2,"time":1449019047,"description":"The Best of Me by Nicholas Sparks | EPUB\r\n\r\n\r\n&quot;Everyone wanted to believe that endless love was possible. She'd believed in it once, too, back when she was eighteen.&quot;\r\n\r\nIn the spring of 1984, high school students Amanda Collier and Dawson Cole fell deeply, irrevocably in love. Though they were from opposite sides of the tracks, their love for one another seemed to defy the realities of life in the small town of Oriental, North Carolina. But as the summer of their senior year came to a close, unforeseen events would tear the young couple apart, setting them on radically divergent paths.\r\n\r\nNow, twenty-five years later, Amanda and Dawson are summoned back to Oriental for the funeral of Tuck Hostetler, the mentor who once gave shelter to their high school romance. Neither has lived the life they imagined . . . and neither can forget the passionate first love that forever changed their lives. As Amanda and Dawson carry out the instructions Tuck left behind for them, they realize that everything they thought they knew -- about Tuck, about themselves, and about the dreams they held dear -- was not as it seemed. Forced to confront painful memories, the two former lovers will discover undeniable truths about the choices they have made. And in the course of a single, searing weekend, they will ask of the living, and the dead: Can love truly rewrite the past?\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:ecd24472ba6051f0498844241ad34eef2d35c132","amp;dn":"The+Best+of+Me+by+Nicholas+Sparks","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecd24472ba6051f0498844241ad34eef2d35c132","infoHashBuffer":{"type":"Buffer","data":[236,210,68,114,186,96,81,240,73,136,68,36,26,211,78,239,45,53,193,50]},"announce":[],"urlList":[]}}