{"title":"Worlds.Worst.Place.to.Be.a.Woman.EN.SUB.HEVC.x265.WEBRIP.[MPup]","uid":12640554,"size":278861958,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ed7a2ce7942e51539474909e76e218432ba04c05&amp;dn=Worlds.Worst.Place.to.Be.a.Woman.EN.SUB.HEVC.x265.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1445983629,"description":"Stacey.Dooley.Investigates.2015.10.26.Worlds.Worst.Place.to.Be.a.Woman.EN.SUB.HEVC.x265.WEBRIP.[MPup]\r\n\r\nFormat: [b]This is a [i]HEVC x265 MKV[/i] file. You may need to update your video codecs to play this file.[/b]\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]2 of 2[/b]\r\n\r\nStacey Dooley travels to Honduras. In a country with little justice for women and the highest murder rate for young females, how are such endemic issues being tackled?\r\n\r\n[img]http://extraimago.com/images/2015/10/27/86bfd93912c3b65b21b6e15533c44c53.jpg[/img]\r\n\r\nStacey Dooley presents the second of two hard-hitting films from the worst places in the world to be female, to investigate why some young women today live in such dangerous, desperate and degrading conditions.\r\n\r\nShe travels to Honduras, known as murder capital of the world, where 16 women are murdered during Stacey's short trip. In a country with little justice for women and the highest murder rate for young females, how are such endemic issues being tackled?\r\n\r\nViolence against women is so common in Honduras that it has a special name - femicide. A woman is murdered every 13 hours here and Stacey discovers that very little is being done to address it. She meets with women who model to earn money needed to escape their violent and dangerous environments, but as Stacey discovers, it's dangerous to be a beautiful woman here.\r\n\r\nShe meets Theresa Munoz, the mother of Miss Honduras Maria Jose Alvarado and her sister Sofia, who were shot dead by Sofia's boyfriend at a party. Yet with people too afraid to come forward with testimonies, the police reveal it's likely their killer will walk free.\r\n\r\nStacey also meets some of the young women who've had enough and are campaigning for change, when she spends a night with a group of female students demanding more rights for women. At 3am, as they try to evade the police and put up posters before they are torn down, Stacey finds out just how difficult making a change can be.\r\n\r\nIn Honduras, the Catholic government ban on abortion and the contraceptive pill means that rape victims, often as young as 11, are forced to give birth whilst only children themselves. As the list of questions grows, Stacey visits the district attorney, only to find them unwilling to face her questions","torrent":{"xt":"urn:btih:ed7a2ce7942e51539474909e76e218432ba04c05","amp;dn":"Worlds.Worst.Place.to.Be.a.Woman.EN.SUB.HEVC.x265.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed7a2ce7942e51539474909e76e218432ba04c05","infoHashBuffer":{"type":"Buffer","data":[237,122,44,231,148,46,81,83,148,116,144,158,118,226,24,67,43,160,76,5]},"announce":[],"urlList":[]}}