{"title":"Fallout 4 – Black Box+PTBR+Update.v1.1.30-CODEX","uid":12785575,"size":21535157167,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:eda4e31f19841e2a33303fb692d16120019ca6d6&amp;dn=Fallout+4+%26ndash%3B+Black+Box%2BPTBR%2BUpdate.v1.1.30-CODEX&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vulcan59444","files":28,"time":1447861134,"description":"Bethesda Game Studios, criadores premiados do Fallout 3 e The Elder Scrolls V: Skyrim, as boas-vindas ao mundo de Fallout 4 - seu jogo mais ambicioso de sempre, ea próxima geração de jogos de mundo aberto. \r\nComo o único sobrevivente de Vault 111, você entra em um mundo destruído pela guerra nuclear. Cada segundo é uma luta pela sobrevivência, e cada escolha é sua. Somente você pode reconstruir e determinar o destino do Agreste. Welcome home ... Faça o que quiser em um mundo enorme aberto com centenas de locais, personagens e missões. Junte-se a múltiplas facções que disputam o poder ou ir sozinho, as escolhas são todas suas. Tu és especial! A partir de um soldado Poder Armored à fala mansa carismático, você pode escolher entre centenas de Perks e desenvolver seu próprio estilo de jogo. \r\nUm gráficos de próxima geração e iluminação todo-novo motor traz para a vida do mundo de Fallout como nunca antes \r\nIntense primeiro ou terceiro combate pessoa , coletar, atualizar e construir milhares de itens no sistema de elaboração mais avançado de sempre. Armas, armaduras, produtos químicos e alimentos\r\nO jogo está rachado por CODEX. Instruções: - montar a imagem (.iso) -Instale o jogo -Copy o crack no interior do iso para o diretório do jogo. você pode encontrar um tutorial detalhado como quebrar um jogo completo e gratuito, no menu, válido para qualquer rachadura Skidrow Reloaded ou jogos FLT Profeta do Codex ou de qualquer versão","torrent":{"xt":"urn:btih:eda4e31f19841e2a33303fb692d16120019ca6d6","amp;dn":"Fallout+4+%26ndash%3B+Black+Box%2BPTBR%2BUpdate.v1.1.30-CODEX","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eda4e31f19841e2a33303fb692d16120019ca6d6","infoHashBuffer":{"type":"Buffer","data":[237,164,227,31,25,132,30,42,51,48,63,182,146,209,97,32,1,156,166,214]},"announce":[],"urlList":[]}}