{"title":"The.Mountain-Series.2--BBC-2015--720p","uid":13001542,"size":3133641163,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:ef7952ed9454ad42932794f27c5429b7a20e6677&amp;dn=The.Mountain-Series.2--BBC-2015--720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uggauga","files":12,"time":1450199776,"description":"The Mountain - Series 2\r\n\r\nBBC (2015) - 6 episodes\r\n\r\nSeries charting life around Cairngorm, which lies at the heart of Scotland's greatest winter wilderness\r\n \nhttp://www.bbc.co.uk/programmes/b06p0xsl\r\n________________________________\r\n\r\n1280x720 resolution - with subtitles - enjoy !!\r\n________________________________\r\n\r\nEpisode 1 of 6\r\nThe summer months bring new opportunities for the hardy folk who live in the shadow of Cairngorm. This time: the snow's disappearing along with the skiers, but warmer weather brings no rest for the mountain team. The funicular train comes off its tracks, Ruari the ski patroller turns gamekeeper for the summer, the new boss at the sailing school has big boots to fill, and a young couple try to get their music festival off the ground.\r\n\r\nEpisode 2 of 6\r\nThe summer months bring new opportunities for the hardy folk who live in the shadow of Cairngorm. This time: Spud the piper returns and gets a riding lesson, Ruari goes diving for his wedding menu, the oldest ski tow on the mountain needs demolishing, and a young mountain biker gets out of school to go racing.\r\n\r\nEpisode 3 of 6\r\nThe summer months bring new opportunities for the hardy folk who live in the shadow of Cairngorm. This time: the steam railway gets a little overheated, the mountain team battles the midges, the dreams of Rona the downhill racer come adrift, and the pub springs a leak. Disaster all round really.\r\n\r\nEpisode 4 of 6\r\nThe summer months bring new opportunities for the hardy folk who live in the shadow of Cairngorm.\r\nThe mountain team has to call in the helicopter to reach their remotest ski tow, the Glorious Twelfth looks less than glorious, Ruari goes up the creek on his way to his wedding, and 25,000 people turn up in Aviemore to hear Spud the piper.\r\n\r\nEpisode 5 of 6\r\nThe summer months bring new opportunities for the hardy folk who live in the shadow of Cairngorm.\r\nPerhaps the UK's weirdest music festival gets under way, the sailing school calls up new management to survive, and the ski patrol team takes on the adventure triathalon.\r\n\r\nEpisode 6 of 6\r\nThe summer months bring new opportunities for the hardy folk who live in the shadow of Cairngorm. As the summer comes to a close with a big splash, the mountain gets its new ski tow installed in the nick of time, and Polly and Ross count the cost of a busy summer","torrent":{"xt":"urn:btih:ef7952ed9454ad42932794f27c5429b7a20e6677","amp;dn":"The.Mountain-Series.2--BBC-2015--720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef7952ed9454ad42932794f27c5429b7a20e6677","infoHashBuffer":{"type":"Buffer","data":[239,121,82,237,148,84,173,66,147,39,148,242,124,84,41,183,162,14,102,119]},"announce":[],"urlList":[]}}