{"title":"Synagogue of Satan - Andrew Hitchcock [EN PDF]","uid":12638357,"size":3358606,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1ea3af84c11256c8e614a067e612b2b99ab1f7b&amp;dn=Synagogue+of+Satan+-+Andrew+Hitchcock+%5BEN+PDF%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"perfect_stan","files":1,"time":1445961970,"description":"Synagogue of Satan\r\nBy Andrew Hitchcock\r\n\r\n\r\nThe Horrible Truth about the Synagogue of Satan World events do not happen by accident. World history is planned far in advance by a conspiratorial Cabal, an Invisible Hand, working secretly behind the scenes. In this highly documented volume, researcher Andrew Hitchcock uncovers the wicked elite group responsible for virtually all wars, revolutions, financial debacles, and social upheavals. That group he accurately identifies as the Synagogue of Satan.\r\nAmazingly, the Bible's apocalyptic scriptures warn of this very same group. The book of Revelation reveals that the hellish agents who comprise the Synagogue of Satan do not hesitate to imprison, defraud, and kill multitudes of innocent victims. Their deceptive conspiracy will someday soon shake the entire planet and cause the bloody death of billions of its inhabitants. Here is the record of how the Synagogue of Satan has stealthily moved to dominate and control the world's money and banking. It has set up secret societies and organizations such as the Bilderbergers, Freemasonry, and the Council on Foreign Relations to do its dirty work. And now, this ages-old conspiracy is prepared to plunge mankind into the utter depths of all-out destruction.\r\n\r\nEnjoy and please SEED!!!","torrent":{"xt":"urn:btih:f1ea3af84c11256c8e614a067e612b2b99ab1f7b","amp;dn":"Synagogue+of+Satan+-+Andrew+Hitchcock+%5BEN+PDF%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1ea3af84c11256c8e614a067e612b2b99ab1f7b","infoHashBuffer":{"type":"Buffer","data":[241,234,58,248,76,17,37,108,142,97,74,6,126,97,43,43,153,171,31,123]},"announce":[],"urlList":[]}}