{"title":"Railworks TS2016 DTG  Maerdy Loco Add-On","uid":12978736,"size":869542230,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f6196b366eeaf4b826583d770a7c0f830b88eaed&amp;dn=Railworks+TS2016+DTG++Maerdy+Loco+Add-On&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TS2015","files":1,"time":1450014684,"description":"Following the much-loved ‘Memories of Maerdy’ add-on from Mesh Tools is the stunning new ‘Return to Maerdy’ add-on for Train Simulator, complete with the unique English Electric Type 3B Battery Locomotive and WD Hunslet 0-6-0ST ‘Austerity’. \r\n\r\nThe real-life Maerdy branch was in South Wales, running from Porth to Maerdy Colliery, following the River Rhondda. Originally owned by the Taff Vale Railway, it was used as a coal mining freight railway and continued into service when the Great Western Railway took it over in 1923. The line also ran passenger services from Porth, stopping at Ynyshir, Pontygwaith, Tylorstown and Ferndale. The line continued up to the Colliery as freight only, privately owned by the NCB. \r\n\r\nThe last passenger train on the branch ran on 15th June 1964 before services ended as part of the Beeching cuts, just leaving coal trains running to Maerdy Colliery. The track was lifted in 1987, though the colliery didn’t close until 1990. Today, many of the bridges remain and the line is a cycle path, however the track bed South of Tylorstown is now gone, and the remains of the stations and bridges have been removed and replaced by the Porth and Lower Rhondda Fach Relief Road. \r\n\r\nIncluded with this highly detailed Colliery extension to the Maerdy branch are two unique locomotives – the English Electric Type 3B battery locomotive and the WD ‘Austerity’ 0-6-0ST steam locomotive. \r\n\r\nThe English Electric Type 3B was a class of four wheel electric locomotives built by English Electric between 1921 and 1951, mostly at the Dick Kerr Works in Preston. The locomotives could be powered by batteries or from overhead wires, with voltage, power and weight adaptable, making few of the Class actually the same. All locomotives had a central Steeple cab with sloping bonnets either side, which could either be filled with ballast, such as concrete or scrap metal, or banks of lead acid batteries if the locomotive was battery powered. \r\n\r\nThe Hunslet ‘Austerity’ was an 0-6-0ST shunting engine designed by R.A. Riddles for the War department. The design evolved many years before from the Class 48150 0-6-0ST produced by Hunslet; these small tank engines were then developed by Hunslet into the class 50550, a much heavier and more powerful engine. \r\n\r\nIn total 377 ‘Austerity’ locomotives were produced for the War Department up until 1947. After the war, the NCB ordered 77 new ‘Austerity’ models for use in its collieries. The NCB continued to use these locomotives well into the 1980s, long after steam on the mainline had come to an end.\r\n\r\n\r\nTHIS ADDON WILL WORK ON LEGIT AND PIRATED VERSION OF TRAIN SIMULATOR 2015!!!","torrent":{"xt":"urn:btih:f6196b366eeaf4b826583d770a7c0f830b88eaed","amp;dn":"Railworks+TS2016+DTG++Maerdy+Loco+Add-On","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6196b366eeaf4b826583d770a7c0f830b88eaed","infoHashBuffer":{"type":"Buffer","data":[246,25,107,54,110,234,244,184,38,88,61,119,10,124,15,131,11,136,234,237]},"announce":[],"urlList":[]}}