{"title":"BBC Coal House Series 1, x264, MVGroup","uid":12627918,"size":3660744774,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f7c380832c26c8cc87b9907fe5a236430540aa7b&amp;dn=BBC+Coal+House+Series+1%2C+x264%2C+MVGroup&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"08GEZBVDZB66K6","files":20,"time":1445798675,"description":"Coal House is a Welsh television series made by Indus Films for BBC Wales, and broadcast on BBC One Wales, with a subsequent UK wide repeat of both series on BBC Four. \r\n\r\nThe series follows three or more families who are placed in a location which replicates the lifestyle of Welsh people living in a coal mining town of that period. The chosen families leave all 21st century luxuries behind, swapping a modern high-tech life for a miner's cottage in Stack Square in the Welsh hills of Blaenavon. The mines are owned by Mr. Blanford, and are 4 miles (6.4 km) up the hills. Men and boys over the age of 14 are required to work in the mines.\r\n\r\nFilmed from early October 2007 and shown from late October 2007, three families (the Cartwright family from Penarth, the Griffiths family from Ceredigion; and the Phillips family from the Vale of Glamorgan), cope with daily life as the Welsh mining community lived it 80 years ago - a year after the last general strike and before the pits were nationalised.\r\nFor the men and boys over 14 there was the harsh reality of long walks to work over mountains in all weather, to face a long day as coal miners at Blaentillery No.2 Mine - the last working mine of its kind in the UK. Meanwhile, the women had to run the home under 1927 conditions, keeping the children fed, watered and clean. Even making a cup of tea involved the hard work of collecting water from a pump and lighting a fire.\r\nA special hour-length final episode was recorded which included footage from a Hunger March Concert held at Park Street Chapel, Blaenafon. Blaenavon Male Voice Choir took part in the concert, along with members of the Coal House families who sang and recited verse","torrent":{"xt":"urn:btih:f7c380832c26c8cc87b9907fe5a236430540aa7b","amp;dn":"BBC+Coal+House+Series+1%2C+x264%2C+MVGroup","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7c380832c26c8cc87b9907fe5a236430540aa7b","infoHashBuffer":{"type":"Buffer","data":[247,195,128,131,44,38,200,204,135,185,144,127,229,162,54,67,5,64,170,123]},"announce":[],"urlList":[]}}