{"title":"Bio-Objects - Life in the 21st Century","uid":12641527,"size":1461742,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9fdef995522920173376d910e3b039bdcf657a4&amp;dn=Bio-Objects+-+Life+in+the+21st+Century&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1445999978,"description":"Bio-Objects - Life in the 21st Century (Ashgate, 2012).pdf\r\n\r\nISBN 9781409411789\r\n\r\nIncreasing knowledge of the biological is fundamentally transforming what life itself means and where its boundaries lie. New developments in the biosciences - especially through the molecularisation of life - are (re)shaping healthcare and other aspects of our society. This cutting edge volume studies contemporary bio-objects, or the categories, materialities and processes that are central to the configuring of 'life' today, as they emerge, stabilize and circulate through society. Examining a variety of bio-objects in contexts beyond the laboratory, Bio-Objects: Life in the 21st Century explores new ways of thinking about how novel bio-objects enter contemporary life, analysing the manner in which, among others, the boundaries between human and animal, organic and non-organic, and being 'alive' and the suspension of living, are questioned, destabilised and in some cases re-established. Thematically organised around questions of changing boundaries; the governance and regulation of bio-objects; and changing social, economic and political relations, this book presents rich new case studies from Europe that will be of interest to scholars of science and technology studies, social theory, sociology and law","torrent":{"xt":"urn:btih:f9fdef995522920173376d910e3b039bdcf657a4","amp;dn":"Bio-Objects+-+Life+in+the+21st+Century","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9fdef995522920173376d910e3b039bdcf657a4","infoHashBuffer":{"type":"Buffer","data":[249,253,239,153,85,34,146,1,115,55,109,145,14,59,3,155,220,246,87,164]},"announce":[],"urlList":[]}}