{"title":"Young.Trans.and.Looking.For.Love.EN.SUB.HEVC.x265.WEBRIP.[MPup]","uid":12904793,"size":221331741,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fe0dfda17920cfeca2307e98c0651a511a14f098&amp;dn=Young.Trans.and.Looking.For.Love.EN.SUB.HEVC.x265.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"makinapufterpup","files":2,"time":1449242440,"description":"BBC.Documentaries.2015.11.23.Young.Trans.and.Looking.For.Love.EN.SUB.HEVC.x265.WEBRIP.[MPup]\r\n\r\n[i][color=&quot;blue&quot;]This torrent is HEVC x26[/color][color=&quot;red&quot;]5[/color][/i]\r\n[b][color=&quot;purple&quot;]It is[/color] [color=&quot;orange&quot;][u]NOT[/u][/color] [color=&quot;purple&quot;]a x26[/color][color=&quot;red&quot;]4[/color] [color=&quot;purple&quot;]torrent[/color][/b]\r\n\r\nFormat: [b]This is a [i]HEVC x265 MKV[/i] file. You may need to update your video codecs to play this file.[/b]\r\n\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[img]http://extraimago.com/images/2015/12/02/5fba8d3f108eda2b4916a89697db4a41.jpg[/img]\r\n\r\nArin Andrews and Katie Hill look like any American teenage couple in love, but there’s one big difference: they are both transgender. Arin began life as Emerald, a beauty pageant-winning little girl, whereas the name on Katie’s birth certificate was Luke, a boy obsessed with computer games. Since 2012, Arin and Katie have shared their transitions online through video diaries watched by millions - as they became the poster boy and poster girl of the young trans community.\r\n\r\nAt present, it is estimated that 700,000 people in the US identify as transgender*, whilst statistics show the number of British children who want to change their gender has doubled in the last six months**. As part of BBC Three’s Breaking The Mould season, this one-off film discovers how Arin and Katie are spreading their message of hope and acceptance to a global audience, inspiring a new transgender generation who are looking for love.\r\n\r\nOf them, we meet 18 year-old Devon (who has gone from girl to boy) and looks up to Arin, taking comfort from knowing there is someone online going through the same challenges. However, Devon has to deal with the thorny issue of how and when to tell a girl that, biologically, he is still female.\r\n\r\nMeanwhile, Claire (pictured) is a 20 year-old trans woman longing for a fairytale romance like Arin and Katie’s, but finding it impossible to meet a boyfriend, despite her good looks. For Claire, social media and her group of trans friends provide much needed support through day-to-day challenges, from online dating profiles to wearing a swimsuit in public for the first time.\r\n\r\nThese brave stories also reveal the emotional ups and downs of what it is to be transgender. Shockingly, recent UK statistics show that 48 percent of young transgender people have attempted suicide***. From the lows of bullying, abuse and suicide attempts, to their joy as they undergo hormone treatments and surgery, we see what life is really like for these courageous individuals and their families.\r\n\r\n* The Williams Institute, UCLA\r\n** Tavistock and Portman NHS trust\r\n*** The RaRE Research Report, published by PACE","torrent":{"xt":"urn:btih:fe0dfda17920cfeca2307e98c0651a511a14f098","amp;dn":"Young.Trans.and.Looking.For.Love.EN.SUB.HEVC.x265.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe0dfda17920cfeca2307e98c0651a511a14f098","infoHashBuffer":{"type":"Buffer","data":[254,13,253,161,121,32,207,236,162,48,126,152,192,101,26,81,26,20,240,152]},"announce":[],"urlList":[]}}